iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
};

#define System_Control_Space_NVIC (*(volatile struct System_Control_Space_NVIC_tag *) 0xe000e100)

struct System_Control_Space_SysTick_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t TICKINT:1;
      uint64_t CLKSOURCE:1;
      uint64_t reservedSpace0:13;
      uint64_t COUNTFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RELOAD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_RVR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CURRENT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_CVR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TENMS:24;
      uint64_t reservedSpace0:6;
      uint64_t SKEW:1;
      uint64_t NOREF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_CALIB;

};

#define System_Control_Space_SysTick (*(volatile struct System_Control_Space_SysTick_tag *) 0xe000e010)

struct System_Control_Space_Memory_Protection_Unit_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEPARATE:1;
      uint64_t reservedSpace0:7;
      uint64_t DREGION:8;
      uint64_t IREGION:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_TYPE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t HFNMIENA:1;
      uint64_t PRIVDEFENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_CTRL;

  uint8_t MPU_RNR;
  uint8_t res0[3];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGION:4;
      uint64_t VALID:1;
      uint64_t ADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RBAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t SIZE:5;
      uint64_t reservedSpace0:2;
      uint64_t SRD:8;
      uint64_t B:1;
      uint64_t C:1;
      uint64_t S:1;
      uint64_t TEX:3;
      uint64_t reservedSpace1:2;
      uint64_t AP:3;
      uint64_t reservedSpace2:1;
      uint64_t XN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RASR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGION:4;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RBAR_A1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t SIZE:5;
      uint64_t reservedSpace0:2;
      uint64_t SRD:8;
      uint64_t B:1;
      uint64_t C:1;
      uint64_t S:1;
      uint64_t TEX:3;
      uint64_t reservedSpace1:2;
      uint64_t AP:3;
      uint64_t reservedSpace2:1;
      uint64_t XN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RASR_A1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGION:4;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RBAR_A2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t SIZE:5;
      uint64_t reservedSpace0:2;
      uint64_t SRD:8;
      uint64_t B:1;
      uint64_t C:1;
      uint64_t S:1;
      uint64_t TEX:3;
      uint64_t reservedSpace1:2;
      uint64_t AP:3;
      uint64_t reservedSpace2:1;
      uint64_t XN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RASR_A2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGION:4;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RBAR_A3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t SIZE:5;
      uint64_t reservedSpace0:2;
      uint64_t SRD:8;
      uint64_t B:1;
      uint64_t C:1;
      uint64_t S:1;
      uint64_t TEX:3;
      uint64_t reservedSpace1:2;
      uint64_t AP:3;
      uint64_t reservedSpace2:1;
      uint64_t XN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RASR_A3;

};

#define System_Control_Space_Memory_Protection_Unit (*(volatile struct System_Control_Space_Memory_Protection_Unit_tag *) 0xe000ed90)

struct TRGMUX_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:8;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC12_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:8;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC12_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:8;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC12_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:24;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPCMP_0_register;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:24;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPCMP_1_register;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:24;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPCMP_2_register;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:8;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BCTU_register;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:1;
      uint64_t SEL3:7;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) eMIOS012_ODIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:1;
      uint64_t SEL3:7;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) eMIOS0_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:1;
      uint64_t SEL3:7;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) eMIOS0_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:1;
      uint64_t SEL3:7;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) eMIOS0_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:16;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) eMIOS0_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:1;
      uint64_t SEL3:7;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) eMIOS1_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:1;
      uint64_t SEL3:7;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) eMIOS1_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:1;
      uint64_t SEL3:7;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) eMIOS1_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:16;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) eMIOS1_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:1;
      uint64_t SEL3:7;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FlexIO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:1;
      uint64_t SEL3:7;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIUL_OUT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:1;
      uint64_t SEL3:7;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIUL_OUT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:1;
      uint64_t SEL3:7;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIUL_OUT2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:1;
      uint64_t SEL3:7;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIUL_OUT3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:24;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPI2C_0_register;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:24;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPSPI_0_register;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:24;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPSPI_1_register;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:24;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPSPI_2_register;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:24;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPUART_0_register;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:24;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPUART_1_register;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:24;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPUART_2_register;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:24;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPUART_3_register;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:16;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCU0_SYNC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:8;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCU0_FORCE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:1;
      uint64_t SEL3:7;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCU0_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:1;
      uint64_t SEL3:7;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCU0_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:1;
      uint64_t SEL3:7;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCU0_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:16;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCU1_SYNC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:8;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCU1_FORCE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:1;
      uint64_t SEL3:7;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCU1_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:1;
      uint64_t SEL3:7;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCU1_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:1;
      uint64_t SEL3:7;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCU1_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:16;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CM7_RXEV;

