iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
};

#define TRGMUX (*(volatile struct TRGMUX_tag *) 0x40080000)

struct BCTU_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEN0:1;
      uint64_t IEN1:1;
      uint64_t IEN2:1;
      uint64_t reservedSpace0:2;
      uint64_t LIST_IEN:1;
      uint64_t reservedSpace1:1;
      uint64_t TRGEN:1;
      uint64_t reservedSpace2:8;
      uint64_t DMA0:1;
      uint64_t DMA1:1;
      uint64_t DMA2:1;
      uint64_t reservedSpace3:7;
      uint64_t GTRGEN:1;
      uint64_t reservedSpace4:2;
      uint64_t FRZ:1;
      uint64_t MDIS:1;
      uint64_t Software_Reset:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NDATA0:1;
      uint64_t NDATA1:1;
      uint64_t NDATA2:1;
      uint64_t reservedSpace0:1;
      uint64_t DATAOVR0:1;
      uint64_t DATAOVR1:1;
      uint64_t DATAOVR2:1;
      uint64_t reservedSpace1:1;
      uint64_t LIST0_Last:1;
      uint64_t LIST1_Last:1;
      uint64_t LIST2_Last:1;
      uint64_t reservedSpace2:4;
      uint64_t TRGF:1;
      uint64_t NDATA0_CLR:1;
      uint64_t NDATA1_CLR:1;
      uint64_t NDATA2_CLR:1;
      uint64_t reservedSpace3:1;
      uint64_t DATAOVR0_CLR:1;
      uint64_t DATAOVR1_CLR:1;
      uint64_t DATAOVR2_CLR:1;
      uint64_t reservedSpace4:1;
      uint64_t LIST0_Last_CLR:1;
      uint64_t LIST1_Last_CLR:1;
      uint64_t LIST2_Last_CLR:1;
      uint64_t reservedSpace5:4;
      uint64_t TRGF_CLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSR;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__32;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__33;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__35;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__36;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__37;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__38;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__39;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__40;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__41;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__42;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__43;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__44;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__45;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__46;

