iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__47;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__48;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__49;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__50;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__51;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__52;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__53;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__54;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__55;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__56;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__57;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__58;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__59;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__60;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__61;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__62;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__63;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__64;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__65;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__66;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__67;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__68;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__69;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__70;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t reservedSpace1:2;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t reservedSpace2:12;
      uint64_t DATA_DEST:3;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG__71;

  uint8_t res2[240];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROTEC_CODE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WRPROT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SFTRG0:1;
      uint64_t SFTRG1:1;
      uint64_t SFTRG2:1;
      uint64_t SFTRG3:1;
      uint64_t SFTRG4:1;
      uint64_t SFTRG5:1;
      uint64_t SFTRG6:1;
      uint64_t SFTRG7:1;
      uint64_t SFTRG8:1;
      uint64_t SFTRG9:1;
      uint64_t SFTRG10:1;
      uint64_t SFTRG11:1;
      uint64_t SFTRG12:1;
      uint64_t SFTRG13:1;
      uint64_t SFTRG14:1;
      uint64_t SFTRG15:1;
      uint64_t SFTRG16:1;
      uint64_t SFTRG17:1;
      uint64_t SFTRG18:1;
      uint64_t SFTRG19:1;
      uint64_t SFTRG20:1;
      uint64_t SFTRG21:1;
      uint64_t SFTRG22:1;
      uint64_t SFTRG23:1;
      uint64_t SFTRG24:1;
      uint64_t SFTRG25:1;
      uint64_t SFTRG26:1;
      uint64_t SFTRG27:1;
      uint64_t SFTRG28:1;
      uint64_t SFTRG29:1;
      uint64_t SFTRG30:1;
      uint64_t SFTRG31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFTRGR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SFTRG32:1;
      uint64_t SFTRG33:1;
      uint64_t SFTRG34:1;
      uint64_t SFTRG35:1;
      uint64_t SFTRG36:1;
      uint64_t SFTRG37:1;
      uint64_t SFTRG38:1;
      uint64_t SFTRG39:1;
      uint64_t SFTRG40:1;
      uint64_t SFTRG41:1;
      uint64_t SFTRG42:1;
      uint64_t SFTRG43:1;
      uint64_t SFTRG44:1;
      uint64_t SFTRG45:1;
      uint64_t SFTRG46:1;
      uint64_t SFTRG47:1;
      uint64_t SFTRG48:1;
      uint64_t SFTRG49:1;
      uint64_t SFTRG50:1;
      uint64_t SFTRG51:1;
      uint64_t SFTRG52:1;
      uint64_t SFTRG53:1;
      uint64_t SFTRG54:1;
      uint64_t SFTRG55:1;
      uint64_t SFTRG56:1;
      uint64_t SFTRG57:1;
      uint64_t SFTRG58:1;
      uint64_t SFTRG59:1;
      uint64_t SFTRG60:1;
      uint64_t SFTRG61:1;
      uint64_t SFTRG62:1;
      uint64_t SFTRG63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFTRGR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SFTRG64:1;
      uint64_t SFTRG65:1;
      uint64_t SFTRG66:1;
      uint64_t SFTRG67:1;
      uint64_t SFTRG68:1;
      uint64_t SFTRG69:1;
      uint64_t SFTRG70:1;
      uint64_t SFTRG71:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFTRGR3;

