iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_DATA:15;
      uint64_t reservedSpace0:1;
      uint64_t LAST:1;
      uint64_t LIST:1;
      uint64_t CH:7;
      uint64_t TRG_SRC:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADCDR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_DATA:15;
      uint64_t reservedSpace0:1;
      uint64_t LAST:1;
      uint64_t LIST:1;
      uint64_t CH:7;
      uint64_t TRG_SRC:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADCDR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_DATA:15;
      uint64_t reservedSpace0:1;
      uint64_t LAST:1;
      uint64_t LIST:1;
      uint64_t CH:7;
      uint64_t TRG_SRC:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADCDR_2;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LISTSZ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTSTAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CHL_y_plus_1:7;
      uint64_t reservedSpace0:7;
      uint64_t NEXT_CH_WAIT_ON_TRIG_y_plus_1:1;
      uint64_t LAST_y_plus_1:1;
      uint64_t ADC_CH_y:7;
      uint64_t reservedSpace1:7;
      uint64_t NEXT_CH_WAIT_ON_TRIG_y:1;
      uint64_t LAST_y:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTCHR__0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CHL_y_plus_1:7;
      uint64_t reservedSpace0:7;
      uint64_t NEXT_CH_WAIT_ON_TRIG_y_plus_1:1;
      uint64_t LAST_y_plus_1:1;
      uint64_t ADC_CH_y:7;
      uint64_t reservedSpace1:7;
      uint64_t NEXT_CH_WAIT_ON_TRIG_y:1;
      uint64_t LAST_y:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTCHR__1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CHL_y_plus_1:7;
      uint64_t reservedSpace0:7;
      uint64_t NEXT_CH_WAIT_ON_TRIG_y_plus_1:1;
      uint64_t LAST_y_plus_1:1;
      uint64_t ADC_CH_y:7;
      uint64_t reservedSpace1:7;
      uint64_t NEXT_CH_WAIT_ON_TRIG_y:1;
      uint64_t LAST_y:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTCHR__2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CHL_y_plus_1:7;
      uint64_t reservedSpace0:7;
      uint64_t NEXT_CH_WAIT_ON_TRIG_y_plus_1:1;
      uint64_t LAST_y_plus_1:1;
      uint64_t ADC_CH_y:7;
      uint64_t reservedSpace1:7;
      uint64_t NEXT_CH_WAIT_ON_TRIG_y:1;
      uint64_t LAST_y:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTCHR__3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CHL_y_plus_1:7;
      uint64_t reservedSpace0:7;
      uint64_t NEXT_CH_WAIT_ON_TRIG_y_plus_1:1;
      uint64_t LAST_y_plus_1:1;
      uint64_t ADC_CH_y:7;
      uint64_t reservedSpace1:7;
      uint64_t NEXT_CH_WAIT_ON_TRIG_y:1;
      uint64_t LAST_y:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTCHR__4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CHL_y_plus_1:7;
      uint64_t reservedSpace0:7;
      uint64_t NEXT_CH_WAIT_ON_TRIG_y_plus_1:1;
      uint64_t LAST_y_plus_1:1;
      uint64_t ADC_CH_y:7;
      uint64_t reservedSpace1:7;
      uint64_t NEXT_CH_WAIT_ON_TRIG_y:1;
      uint64_t LAST_y:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTCHR__5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CHL_y_plus_1:7;
      uint64_t reservedSpace0:7;
      uint64_t NEXT_CH_WAIT_ON_TRIG_y_plus_1:1;
      uint64_t LAST_y_plus_1:1;
      uint64_t ADC_CH_y:7;
      uint64_t reservedSpace1:7;
      uint64_t NEXT_CH_WAIT_ON_TRIG_y:1;
      uint64_t LAST_y:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTCHR__6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CHL_y_plus_1:7;
      uint64_t reservedSpace0:7;
      uint64_t NEXT_CH_WAIT_ON_TRIG_y_plus_1:1;
      uint64_t LAST_y_plus_1:1;
      uint64_t ADC_CH_y:7;
      uint64_t reservedSpace1:7;
      uint64_t NEXT_CH_WAIT_ON_TRIG_y:1;
      uint64_t LAST_y:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTCHR__7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CHL_y_plus_1:7;
      uint64_t reservedSpace0:7;
      uint64_t NEXT_CH_WAIT_ON_TRIG_y_plus_1:1;
      uint64_t LAST_y_plus_1:1;
      uint64_t ADC_CH_y:7;
      uint64_t reservedSpace1:7;
      uint64_t NEXT_CH_WAIT_ON_TRIG_y:1;
      uint64_t LAST_y:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTCHR__8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CHL_y_plus_1:7;
      uint64_t reservedSpace0:7;
      uint64_t NEXT_CH_WAIT_ON_TRIG_y_plus_1:1;
      uint64_t LAST_y_plus_1:1;
      uint64_t ADC_CH_y:7;
      uint64_t reservedSpace1:7;
      uint64_t NEXT_CH_WAIT_ON_TRIG_y:1;
      uint64_t LAST_y:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTCHR__9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CHL_y_plus_1:7;
      uint64_t reservedSpace0:7;
      uint64_t NEXT_CH_WAIT_ON_TRIG_y_plus_1:1;
      uint64_t LAST_y_plus_1:1;
      uint64_t ADC_CH_y:7;
      uint64_t reservedSpace1:7;
      uint64_t NEXT_CH_WAIT_ON_TRIG_y:1;
      uint64_t LAST_y:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTCHR__10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CHL_y_plus_1:7;
      uint64_t reservedSpace0:7;
      uint64_t NEXT_CH_WAIT_ON_TRIG_y_plus_1:1;
      uint64_t LAST_y_plus_1:1;
      uint64_t ADC_CH_y:7;
      uint64_t reservedSpace1:7;
      uint64_t NEXT_CH_WAIT_ON_TRIG_y:1;
      uint64_t LAST_y:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTCHR__11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CHL_y_plus_1:7;
      uint64_t reservedSpace0:7;
      uint64_t NEXT_CH_WAIT_ON_TRIG_y_plus_1:1;
      uint64_t LAST_y_plus_1:1;
      uint64_t ADC_CH_y:7;
      uint64_t reservedSpace1:7;
      uint64_t NEXT_CH_WAIT_ON_TRIG_y:1;
      uint64_t LAST_y:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTCHR__12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CHL_y_plus_1:7;
      uint64_t reservedSpace0:7;
      uint64_t NEXT_CH_WAIT_ON_TRIG_y_plus_1:1;
      uint64_t LAST_y_plus_1:1;
      uint64_t ADC_CH_y:7;
      uint64_t reservedSpace1:7;
      uint64_t NEXT_CH_WAIT_ON_TRIG_y:1;
      uint64_t LAST_y:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTCHR__13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CHL_y_plus_1:7;
      uint64_t reservedSpace0:7;
      uint64_t NEXT_CH_WAIT_ON_TRIG_y_plus_1:1;
      uint64_t LAST_y_plus_1:1;
      uint64_t ADC_CH_y:7;
      uint64_t reservedSpace1:7;
      uint64_t NEXT_CH_WAIT_ON_TRIG_y:1;
      uint64_t LAST_y:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTCHR__14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CHL_y_plus_1:7;
      uint64_t reservedSpace0:7;
      uint64_t NEXT_CH_WAIT_ON_TRIG_y_plus_1:1;
      uint64_t LAST_y_plus_1:1;
      uint64_t ADC_CH_y:7;
      uint64_t reservedSpace1:7;
      uint64_t NEXT_CH_WAIT_ON_TRIG_y:1;
      uint64_t LAST_y:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTCHR__15;

  uint8_t res5[448];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_DATA:15;
      uint64_t reservedSpace0:1;
      uint64_t ADC_NUM:2;
      uint64_t CH:7;
      uint64_t TRG_SRC:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFO1DR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_DATA:15;
      uint64_t reservedSpace0:1;
      uint64_t ADC_NUM:2;
      uint64_t CH:7;
      uint64_t TRG_SRC:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFO2DR;

