iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t A:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) A6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) B6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNT6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:7;
      uint64_t EDPOL:1;
      uint64_t EDSEL:1;
      uint64_t BSL:2;
      uint64_t reservedSpace0:1;
      uint64_t FORCMB:1;
      uint64_t FORCMA:1;
      uint64_t reservedSpace1:3;
      uint64_t FEN:1;
      uint64_t FCK:1;
      uint64_t IF:4;
      uint64_t reservedSpace2:1;
      uint64_t DMA:1;
      uint64_t UCPREN:1;
      uint64_t UCPRE:2;
      uint64_t ODISSL:2;
      uint64_t ODIS:1;
      uint64_t FREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLAG:1;
      uint64_t UCOUT:1;
      uint64_t UCIN:1;
      uint64_t reservedSpace0:12;
      uint64_t OVFL:1;
      uint64_t reservedSpace1:15;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) S6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALTA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALTA6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UCRELDEL_INT:5;
      uint64_t reservedSpace0:9;
      uint64_t UCPRECLK:1;
      uint64_t reservedSpace1:1;
      uint64_t UCEXTPRE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2_6;

  uint8_t res7[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t A:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) A7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) B7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNT7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:7;
      uint64_t EDPOL:1;
      uint64_t EDSEL:1;
      uint64_t BSL:2;
      uint64_t reservedSpace0:1;
      uint64_t FORCMB:1;
      uint64_t FORCMA:1;
      uint64_t reservedSpace1:3;
      uint64_t FEN:1;
      uint64_t FCK:1;
      uint64_t IF:4;
      uint64_t reservedSpace2:1;
      uint64_t DMA:1;
      uint64_t UCPREN:1;
      uint64_t UCPRE:2;
      uint64_t ODISSL:2;
      uint64_t ODIS:1;
      uint64_t FREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLAG:1;
      uint64_t UCOUT:1;
      uint64_t UCIN:1;
      uint64_t reservedSpace0:12;
      uint64_t OVFL:1;
      uint64_t reservedSpace1:15;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) S7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALTA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALTA7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UCRELDEL_INT:5;
      uint64_t reservedSpace0:9;
      uint64_t UCPRECLK:1;
      uint64_t reservedSpace1:1;
      uint64_t UCEXTPRE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2_7;

  uint8_t res8[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t A:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) A8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) B8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNT8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:7;
      uint64_t EDPOL:1;
      uint64_t EDSEL:1;
      uint64_t BSL:2;
      uint64_t reservedSpace0:1;
      uint64_t FORCMB:1;
      uint64_t FORCMA:1;
      uint64_t reservedSpace1:3;
      uint64_t FEN:1;
      uint64_t FCK:1;
      uint64_t IF:4;
      uint64_t reservedSpace2:1;
      uint64_t DMA:1;
      uint64_t UCPREN:1;
      uint64_t UCPRE:2;
      uint64_t ODISSL:2;
      uint64_t ODIS:1;
      uint64_t FREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLAG:1;
      uint64_t UCOUT:1;
      uint64_t UCIN:1;
      uint64_t reservedSpace0:12;
      uint64_t OVFL:1;
      uint64_t reservedSpace1:15;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) S8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALTA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALTA8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UCRELDEL_INT:5;
      uint64_t reservedSpace0:9;
      uint64_t UCPRECLK:1;
      uint64_t reservedSpace1:1;
      uint64_t UCEXTPRE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2_8;

  uint8_t res9[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t A:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) A9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) B9;

  uint8_t res10[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:7;
      uint64_t EDPOL:1;
      uint64_t EDSEL:1;
      uint64_t BSL:2;
      uint64_t reservedSpace0:1;
      uint64_t FORCMB:1;
      uint64_t FORCMA:1;
      uint64_t reservedSpace1:3;
      uint64_t FEN:1;
      uint64_t FCK:1;
      uint64_t IF:4;
      uint64_t reservedSpace2:1;
      uint64_t DMA:1;
      uint64_t UCPREN:1;
      uint64_t UCPRE:2;
      uint64_t ODISSL:2;
      uint64_t ODIS:1;
      uint64_t FREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLAG:1;
      uint64_t UCOUT:1;
      uint64_t UCIN:1;
      uint64_t reservedSpace0:28;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) S9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALTA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALTA9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UCRELDEL_INT:5;
      uint64_t reservedSpace0:9;
      uint64_t UCPRECLK:1;
      uint64_t reservedSpace1:1;
      uint64_t UCEXTPRE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2_9;

  uint8_t res11[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t A:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) A10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) B10;

  uint8_t res12[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:7;
      uint64_t EDPOL:1;
      uint64_t EDSEL:1;
      uint64_t BSL:2;
      uint64_t reservedSpace0:1;
      uint64_t FORCMB:1;
      uint64_t FORCMA:1;
      uint64_t reservedSpace1:3;
      uint64_t FEN:1;
      uint64_t FCK:1;
      uint64_t IF:4;
      uint64_t reservedSpace2:1;
      uint64_t DMA:1;
      uint64_t UCPREN:1;
      uint64_t UCPRE:2;
      uint64_t ODISSL:2;
      uint64_t ODIS:1;
      uint64_t FREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLAG:1;
      uint64_t UCOUT:1;
      uint64_t UCIN:1;
      uint64_t reservedSpace0:28;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) S10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALTA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALTA10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UCRELDEL_INT:5;
      uint64_t reservedSpace0:9;
      uint64_t UCPRECLK:1;
      uint64_t reservedSpace1:1;
      uint64_t UCEXTPRE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2_10;

  uint8_t res13[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t A:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) A11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) B11;

  uint8_t res14[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:7;
      uint64_t EDPOL:1;
      uint64_t EDSEL:1;
      uint64_t BSL:2;
      uint64_t reservedSpace0:1;
      uint64_t FORCMB:1;
      uint64_t FORCMA:1;
      uint64_t reservedSpace1:3;
      uint64_t FEN:1;
      uint64_t FCK:1;
      uint64_t IF:4;
      uint64_t reservedSpace2:1;
      uint64_t DMA:1;
      uint64_t UCPREN:1;
      uint64_t UCPRE:2;
      uint64_t ODISSL:2;
      uint64_t ODIS:1;
      uint64_t FREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLAG:1;
      uint64_t UCOUT:1;
      uint64_t UCIN:1;
      uint64_t reservedSpace0:28;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) S11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALTA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALTA11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UCRELDEL_INT:5;
      uint64_t reservedSpace0:9;
      uint64_t UCPRECLK:1;
      uint64_t reservedSpace1:1;
      uint64_t UCEXTPRE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2_11;

  uint8_t res15[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t A:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) A12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) B12;

  uint8_t res16[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:7;
      uint64_t EDPOL:1;
      uint64_t EDSEL:1;
      uint64_t BSL:2;
      uint64_t reservedSpace0:1;
      uint64_t FORCMB:1;
      uint64_t FORCMA:1;
      uint64_t reservedSpace1:3;
      uint64_t FEN:1;
      uint64_t FCK:1;
      uint64_t IF:4;
      uint64_t reservedSpace2:1;
      uint64_t DMA:1;
      uint64_t UCPREN:1;
      uint64_t UCPRE:2;
      uint64_t ODISSL:2;
      uint64_t ODIS:1;
      uint64_t FREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLAG:1;
      uint64_t UCOUT:1;
      uint64_t UCIN:1;
      uint64_t reservedSpace0:28;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) S12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALTA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALTA12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UCRELDEL_INT:5;
      uint64_t reservedSpace0:9;
      uint64_t UCPRECLK:1;
      uint64_t reservedSpace1:1;
      uint64_t UCEXTPRE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2_12;

  uint8_t res17[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t A:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) A13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) B13;

  uint8_t res18[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:7;
      uint64_t EDPOL:1;
      uint64_t EDSEL:1;
      uint64_t BSL:2;
      uint64_t reservedSpace0:1;
      uint64_t FORCMB:1;
      uint64_t FORCMA:1;
      uint64_t reservedSpace1:3;
      uint64_t FEN:1;
      uint64_t FCK:1;
      uint64_t IF:4;
      uint64_t reservedSpace2:1;
      uint64_t DMA:1;
      uint64_t UCPREN:1;
      uint64_t UCPRE:2;
      uint64_t ODISSL:2;
      uint64_t ODIS:1;
      uint64_t FREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLAG:1;
      uint64_t UCOUT:1;
      uint64_t UCIN:1;
      uint64_t reservedSpace0:28;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) S13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALTA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALTA13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UCRELDEL_INT:5;
      uint64_t reservedSpace0:9;
      uint64_t UCPRECLK:1;
      uint64_t reservedSpace1:1;
      uint64_t UCEXTPRE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2_13;

  uint8_t res19[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t A:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) A14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) B14;

  uint8_t res20[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:7;
      uint64_t EDPOL:1;
      uint64_t EDSEL:1;
      uint64_t BSL:2;
      uint64_t reservedSpace0:1;
      uint64_t FORCMB:1;
      uint64_t FORCMA:1;
      uint64_t reservedSpace1:3;
      uint64_t FEN:1;
      uint64_t FCK:1;
      uint64_t IF:4;
      uint64_t reservedSpace2:1;
      uint64_t DMA:1;
      uint64_t UCPREN:1;
      uint64_t UCPRE:2;
      uint64_t ODISSL:2;
      uint64_t ODIS:1;
      uint64_t FREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLAG:1;
      uint64_t UCOUT:1;
      uint64_t UCIN:1;
      uint64_t reservedSpace0:28;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) S14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALTA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALTA14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UCRELDEL_INT:5;
      uint64_t reservedSpace0:9;
      uint64_t UCPRECLK:1;
      uint64_t reservedSpace1:1;
      uint64_t UCEXTPRE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2_14;

  uint8_t res21[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t A:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) A15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) B15;

  uint8_t res22[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:7;
      uint64_t EDPOL:1;
      uint64_t EDSEL:1;
      uint64_t BSL:2;
      uint64_t reservedSpace0:1;
      uint64_t FORCMB:1;
      uint64_t FORCMA:1;
      uint64_t reservedSpace1:3;
      uint64_t FEN:1;
      uint64_t FCK:1;
      uint64_t IF:4;
      uint64_t reservedSpace2:1;
      uint64_t DMA:1;
      uint64_t UCPREN:1;
      uint64_t UCPRE:2;
      uint64_t ODISSL:2;
      uint64_t ODIS:1;
      uint64_t FREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLAG:1;
      uint64_t UCOUT:1;
      uint64_t UCIN:1;
      uint64_t reservedSpace0:28;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) S15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALTA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALTA15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UCRELDEL_INT:5;
      uint64_t reservedSpace0:9;
      uint64_t UCPRECLK:1;
      uint64_t reservedSpace1:1;
      uint64_t UCEXTPRE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2_15;

  uint8_t res23[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t A:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) A16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) B16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNT16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:7;
      uint64_t EDPOL:1;
      uint64_t EDSEL:1;
      uint64_t BSL:2;
      uint64_t reservedSpace0:1;
      uint64_t FORCMB:1;
      uint64_t FORCMA:1;
      uint64_t reservedSpace1:3;
      uint64_t FEN:1;
      uint64_t FCK:1;
      uint64_t IF:4;
      uint64_t reservedSpace2:1;
      uint64_t DMA:1;
      uint64_t UCPREN:1;
      uint64_t UCPRE:2;
      uint64_t ODISSL:2;
      uint64_t ODIS:1;
      uint64_t FREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLAG:1;
      uint64_t UCOUT:1;
      uint64_t UCIN:1;
      uint64_t reservedSpace0:12;
      uint64_t OVFL:1;
      uint64_t reservedSpace1:15;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) S16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALTA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALTA16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UCRELDEL_INT:5;
      uint64_t reservedSpace0:9;
      uint64_t UCPRECLK:1;
      uint64_t reservedSpace1:1;
      uint64_t UCEXTPRE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2_16;

  uint8_t res24[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t A:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) A17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) B17;

  uint8_t res25[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:7;
      uint64_t EDPOL:1;
      uint64_t EDSEL:1;
      uint64_t BSL:2;
      uint64_t reservedSpace0:1;
      uint64_t FORCMB:1;
      uint64_t FORCMA:1;
      uint64_t reservedSpace1:3;
      uint64_t FEN:1;
      uint64_t FCK:1;
      uint64_t IF:4;
      uint64_t reservedSpace2:1;
      uint64_t DMA:1;
      uint64_t UCPREN:1;
      uint64_t UCPRE:2;
      uint64_t ODISSL:2;
      uint64_t ODIS:1;
      uint64_t FREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLAG:1;
      uint64_t UCOUT:1;
      uint64_t UCIN:1;
      uint64_t reservedSpace0:28;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) S17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALTA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALTA17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UCRELDEL_INT:5;
      uint64_t reservedSpace0:9;
      uint64_t UCPRECLK:1;
      uint64_t reservedSpace1:1;
      uint64_t UCEXTPRE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2_17;

  uint8_t res26[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t A:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) A18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) B18;

  uint8_t res27[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:7;
      uint64_t EDPOL:1;
      uint64_t EDSEL:1;
      uint64_t BSL:2;
      uint64_t reservedSpace0:1;
      uint64_t FORCMB:1;
      uint64_t FORCMA:1;
      uint64_t reservedSpace1:3;
      uint64_t FEN:1;
      uint64_t FCK:1;
      uint64_t IF:4;
      uint64_t reservedSpace2:1;
      uint64_t DMA:1;
      uint64_t UCPREN:1;
      uint64_t UCPRE:2;
      uint64_t ODISSL:2;
      uint64_t ODIS:1;
      uint64_t FREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLAG:1;
      uint64_t UCOUT:1;
      uint64_t UCIN:1;
      uint64_t reservedSpace0:28;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) S18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALTA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALTA18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UCRELDEL_INT:5;
      uint64_t reservedSpace0:9;
      uint64_t UCPRECLK:1;
      uint64_t reservedSpace1:1;
      uint64_t UCEXTPRE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2_18;

