iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
  uint8_t res35[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t A:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) A23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) B23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNT23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:7;
      uint64_t EDPOL:1;
      uint64_t EDSEL:1;
      uint64_t BSL:2;
      uint64_t reservedSpace0:1;
      uint64_t FORCMB:1;
      uint64_t FORCMA:1;
      uint64_t reservedSpace1:3;
      uint64_t FEN:1;
      uint64_t FCK:1;
      uint64_t IF:4;
      uint64_t reservedSpace2:1;
      uint64_t DMA:1;
      uint64_t UCPREN:1;
      uint64_t UCPRE:2;
      uint64_t ODISSL:2;
      uint64_t ODIS:1;
      uint64_t FREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLAG:1;
      uint64_t UCOUT:1;
      uint64_t UCIN:1;
      uint64_t reservedSpace0:12;
      uint64_t OVFL:1;
      uint64_t reservedSpace1:15;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) S23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALTA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALTA23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UCRELDEL_INT:5;
      uint64_t reservedSpace0:9;
      uint64_t UCPRECLK:1;
      uint64_t reservedSpace1:1;
      uint64_t UCEXTPRE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2_23;

};

#define EMIOS_0 (*(volatile struct EMIOS_0_tag *) 0x40088000)

struct EMIOS_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t GPRE:8;
      uint64_t reservedSpace1:10;
      uint64_t GPREN:1;
      uint64_t reservedSpace2:1;
      uint64_t GTBE:1;
      uint64_t FRZ:1;
      uint64_t MDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F0:1;
      uint64_t F1:1;
      uint64_t F2:1;
      uint64_t F3:1;
      uint64_t F4:1;
      uint64_t F5:1;
      uint64_t F6:1;
      uint64_t F7:1;
      uint64_t F8:1;
      uint64_t F9:1;
      uint64_t F10:1;
      uint64_t F11:1;
      uint64_t F12:1;
      uint64_t F13:1;
      uint64_t F14:1;
      uint64_t F15:1;
      uint64_t F16:1;
      uint64_t F17:1;
      uint64_t F18:1;
      uint64_t F19:1;
      uint64_t F20:1;
      uint64_t F21:1;
      uint64_t F22:1;
      uint64_t F23:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GFLAG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OU0:1;
      uint64_t OU1:1;
      uint64_t OU2:1;
      uint64_t OU3:1;
      uint64_t OU4:1;
      uint64_t OU5:1;
      uint64_t OU6:1;
      uint64_t OU7:1;
      uint64_t OU8:1;
      uint64_t OU9:1;
      uint64_t OU10:1;
      uint64_t OU11:1;
      uint64_t OU12:1;
      uint64_t OU13:1;
      uint64_t OU14:1;
      uint64_t OU15:1;
      uint64_t OU16:1;
      uint64_t OU17:1;
      uint64_t OU18:1;
      uint64_t OU19:1;
      uint64_t OU20:1;
      uint64_t OU21:1;
      uint64_t OU22:1;
      uint64_t OU23:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OUDIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UCDIS0:1;
      uint64_t UCDIS1:1;
      uint64_t UCDIS2:1;
      uint64_t UCDIS3:1;
      uint64_t UCDIS4:1;
      uint64_t UCDIS5:1;
      uint64_t UCDIS6:1;
      uint64_t UCDIS7:1;
      uint64_t UCDIS8:1;
      uint64_t UCDIS9:1;
      uint64_t UCDIS10:1;
      uint64_t UCDIS11:1;
      uint64_t UCDIS12:1;
      uint64_t UCDIS13:1;
      uint64_t UCDIS14:1;
      uint64_t UCDIS15:1;
      uint64_t UCDIS16:1;
      uint64_t UCDIS17:1;
      uint64_t UCDIS18:1;
      uint64_t UCDIS19:1;
      uint64_t UCDIS20:1;
      uint64_t UCDIS21:1;
      uint64_t UCDIS22:1;
      uint64_t UCDIS23:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UCDIS;

  uint8_t res0[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t A:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) A0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) B0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:7;
      uint64_t EDPOL:1;
      uint64_t EDSEL:1;
      uint64_t BSL:2;
      uint64_t reservedSpace0:1;
      uint64_t FORCMB:1;
      uint64_t FORCMA:1;
      uint64_t reservedSpace1:3;
      uint64_t FEN:1;
      uint64_t FCK:1;
      uint64_t IF:4;
      uint64_t reservedSpace2:1;
      uint64_t DMA:1;
      uint64_t UCPREN:1;
      uint64_t UCPRE:2;
      uint64_t ODISSL:2;
      uint64_t ODIS:1;
      uint64_t FREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLAG:1;
      uint64_t UCOUT:1;
      uint64_t UCIN:1;
      uint64_t reservedSpace0:12;
      uint64_t OVFL:1;
      uint64_t reservedSpace1:15;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) S0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALTA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALTA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UCRELDEL_INT:5;
      uint64_t reservedSpace0:9;
      uint64_t UCPRECLK:1;
      uint64_t reservedSpace1:1;
      uint64_t UCEXTPRE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2_0;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t A:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) A1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) B1;

