iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
};

#define LCU_0_LC_2 (*(volatile struct LCU_0_LC_2_tag *) 0x40098080)

struct LCU_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MUXSEL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUXSEL_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MUXSEL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUXSEL_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MUXSEL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUXSEL_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MUXSEL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUXSEL_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MUXSEL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUXSEL_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MUXSEL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUXSEL_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MUXSEL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUXSEL_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MUXSEL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUXSEL_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MUXSEL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUXSEL_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MUXSEL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUXSEL_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MUXSEL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUXSEL_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MUXSEL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUXSEL_11;

  uint8_t res0[80];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WP:1;
      uint64_t reservedSpace0:6;
      uint64_t INCL_MUXES:1;
      uint64_t NUM_SYNCS:8;
      uint64_t NUM_FORCES:8;
      uint64_t NUM_LOGIC_CELLS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWEN:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SWEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWVALUE:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SWVALUE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OUTEN:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OUTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LC_INPUTS:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCIN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWOUT:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SWOUT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCOUT:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCOUT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FORCEOUT:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FORCEOUT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FORCESTS:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FORCESTS;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DBGEN:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DBGEN;

};

#define LCU_1 (*(volatile struct LCU_1_tag *) 0x4009c200)

struct LCU_1_LC_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LUTCTRL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LC_LUTCTRL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LUTCTRL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LC_LUTCTRL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LUTCTRL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LC_LUTCTRL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LUTCTRL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LC_LUTCTRL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LUT_FALL_FILT:16;
      uint64_t LUT_RISE_FILT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LC_FILT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LUT_FALL_FILT:16;
      uint64_t LUT_RISE_FILT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LC_FILT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LUT_FALL_FILT:16;
      uint64_t LUT_RISE_FILT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LC_FILT2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LUT_FALL_FILT:16;
      uint64_t LUT_RISE_FILT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LC_FILT3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LUT_INT_EN:4;
      uint64_t reservedSpace0:4;
      uint64_t LUT_DMA_EN:4;
      uint64_t reservedSpace1:4;
      uint64_t FORCE_INT_EN:4;
      uint64_t reservedSpace2:4;
      uint64_t FORCE_DMA_EN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LC_INTDMAEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LUT_STS:4;
      uint64_t reservedSpace0:4;
      uint64_t FORCESTS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LC_STS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OUTPOL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LC_OUTPOL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FORCE_FILT:8;
      uint64_t reservedSpace0:8;
      uint64_t FORCE_POL:3;
      uint64_t reservedSpace1:5;
      uint64_t COMB_EN:3;
      uint64_t reservedSpace2:1;
      uint64_t COMB_FORCE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LC_FFILT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FORCE_SENSE0:4;
      uint64_t FORCE_MODE0:2;
      uint64_t SYNC_SEL0:2;
      uint64_t FORCE_SENSE1:4;
      uint64_t FORCE_MODE1:2;
      uint64_t SYNC_SEL1:2;
      uint64_t FORCE_SENSE2:4;
      uint64_t FORCE_MODE2:2;
      uint64_t SYNC_SEL2:2;
      uint64_t FORCE_SENSE3:4;
      uint64_t FORCE_MODE3:2;
      uint64_t SYNC_SEL3:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LC_FCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SW_MODE:4;
      uint64_t reservedSpace0:4;
      uint64_t SW_SYNC_SEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LC_SCTRL;

