iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
};

#define LCU_1_LC_2 (*(volatile struct LCU_1_LC_2_tag *) 0x4009c080)

struct ADC_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWDN:1;
      uint64_t ADCLKSEL:2;
      uint64_t reservedSpace0:2;
      uint64_t ACKO:1;
      uint64_t ABORT:1;
      uint64_t ABORTCHAIN:1;
      uint64_t reservedSpace1:1;
      uint64_t AVGS:2;
      uint64_t AVGEN:1;
      uint64_t reservedSpace2:3;
      uint64_t STCL:1;
      uint64_t BCTU_MODE:1;
      uint64_t BCTUEN:1;
      uint64_t reservedSpace3:2;
      uint64_t JSTART:1;
      uint64_t JEDGE:1;
      uint64_t JTRGEN:1;
      uint64_t reservedSpace4:1;
      uint64_t NSTART:1;
      uint64_t XSTRTEN:1;
      uint64_t EDGE:1;
      uint64_t TRGEN:1;
      uint64_t reservedSpace5:1;
      uint64_t MODE:1;
      uint64_t WLSIDE:1;
      uint64_t OWREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCSTATUS:3;
      uint64_t reservedSpace0:2;
      uint64_t ACKO:1;
      uint64_t reservedSpace1:3;
      uint64_t CHADDR:7;
      uint64_t BCTUSTART:1;
      uint64_t reservedSpace2:1;
      uint64_t SELF_TEST_S:1;
      uint64_t reservedSpace3:1;
      uint64_t JSTART:1;
      uint64_t reservedSpace4:2;
      uint64_t JABORT:1;
      uint64_t NSTART:1;
      uint64_t reservedSpace5:6;
      uint64_t CALIBRTD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSR;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECH:1;
      uint64_t EOC:1;
      uint64_t JECH:1;
      uint64_t JEOC:1;
      uint64_t EOBCTU:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PIEOCF0:1;
      uint64_t PIEOCF1:1;
      uint64_t PIEOCF2:1;
      uint64_t PIEOCF3:1;
      uint64_t PIEOCF4:1;
      uint64_t PIEOCF5:1;
      uint64_t PIEOCF6:1;
      uint64_t PIEOCF7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CEOCFR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIEOCF0:1;
      uint64_t SIEOCF1:1;
      uint64_t SIEOCF2:1;
      uint64_t SIEOCF3:1;
      uint64_t SIEOCF4:1;
      uint64_t SIEOCF5:1;
      uint64_t SIEOCF6:1;
      uint64_t SIEOCF7:1;
      uint64_t SIEOCF8:1;
      uint64_t SIEOCF9:1;
      uint64_t SIEOCF10:1;
      uint64_t SIEOCF11:1;
      uint64_t SIEOCF12:1;
      uint64_t SIEOCF13:1;
      uint64_t SIEOCF14:1;
      uint64_t SIEOCF15:1;
      uint64_t SIEOCF16:1;
      uint64_t SIEOCF17:1;
      uint64_t SIEOCF18:1;
      uint64_t SIEOCF19:1;
      uint64_t SIEOCF20:1;
      uint64_t SIEOCF21:1;
      uint64_t SIEOCF22:1;
      uint64_t SIEOCF23:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CEOCFR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIEOCF0:1;
      uint64_t EIEOCF1:1;
      uint64_t EIEOCF2:1;
      uint64_t EIEOCF3:1;
      uint64_t EIEOCF4:1;
      uint64_t EIEOCF5:1;
      uint64_t EIEOCF6:1;
      uint64_t EIEOCF7:1;
      uint64_t EIEOCF8:1;
      uint64_t EIEOCF9:1;
      uint64_t EIEOCF10:1;
      uint64_t EIEOCF11:1;
      uint64_t EIEOCF12:1;
      uint64_t EIEOCF13:1;
      uint64_t EIEOCF14:1;
      uint64_t EIEOCF15:1;
      uint64_t EIEOCF16:1;
      uint64_t EIEOCF17:1;
      uint64_t EIEOCF18:1;
      uint64_t EIEOCF19:1;
      uint64_t EIEOCF20:1;
      uint64_t EIEOCF21:1;
      uint64_t EIEOCF22:1;
      uint64_t EIEOCF23:1;
      uint64_t EIEOCF24:1;
      uint64_t EIEOCF25:1;
      uint64_t EIEOCF26:1;
      uint64_t EIEOCF27:1;
      uint64_t EIEOCF28:1;
      uint64_t EIEOCF29:1;
      uint64_t EIEOCF30:1;
      uint64_t EIEOCF31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CEOCFR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSKECH:1;
      uint64_t MSKEOC:1;
      uint64_t MSKJECH:1;
      uint64_t MSKJEOC:1;
      uint64_t MSKEOBCTU:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PIEOCIEN0:1;
      uint64_t PIEOCIEN1:1;
      uint64_t PIEOCIEN2:1;
      uint64_t PIEOCIEN3:1;
      uint64_t PIEOCIEN4:1;
      uint64_t PIEOCIEN5:1;
      uint64_t PIEOCIEN6:1;
      uint64_t PIEOCIEN7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIMR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIEOCIEN0:1;
      uint64_t SIEOCIEN1:1;
      uint64_t SIEOCIEN2:1;
      uint64_t SIEOCIEN3:1;
      uint64_t SIEOCIEN4:1;
      uint64_t SIEOCIEN5:1;
      uint64_t SIEOCIEN6:1;
      uint64_t SIEOCIEN7:1;
      uint64_t SIEOCIEN8:1;
      uint64_t SIEOCIEN9:1;
      uint64_t SIEOCIEN10:1;
      uint64_t SIEOCIEN11:1;
      uint64_t SIEOCIEN12:1;
      uint64_t SIEOCIEN13:1;
      uint64_t SIEOCIEN14:1;
      uint64_t SIEOCIEN15:1;
      uint64_t SIEOCIEN16:1;
      uint64_t SIEOCIEN17:1;
      uint64_t SIEOCIEN18:1;
      uint64_t SIEOCIEN19:1;
      uint64_t SIEOCIEN20:1;
      uint64_t SIEOCIEN21:1;
      uint64_t SIEOCIEN22:1;
      uint64_t SIEOCIEN23:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIMR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIEOCIEN0:1;
      uint64_t EIEOCIEN1:1;
      uint64_t EIEOCIEN2:1;
      uint64_t EIEOCIEN3:1;
      uint64_t EIEOCIEN4:1;
      uint64_t EIEOCIEN5:1;
      uint64_t EIEOCIEN6:1;
      uint64_t EIEOCIEN7:1;
      uint64_t EIEOCIEN8:1;
      uint64_t EIEOCIEN9:1;
      uint64_t EIEOCIEN10:1;
      uint64_t EIEOCIEN11:1;
      uint64_t EIEOCIEN12:1;
      uint64_t EIEOCIEN13:1;
      uint64_t EIEOCIEN14:1;
      uint64_t EIEOCIEN15:1;
      uint64_t EIEOCIEN16:1;
      uint64_t EIEOCIEN17:1;
      uint64_t EIEOCIEN18:1;
      uint64_t EIEOCIEN19:1;
      uint64_t EIEOCIEN20:1;
      uint64_t EIEOCIEN21:1;
      uint64_t EIEOCIEN22:1;
      uint64_t EIEOCIEN23:1;
      uint64_t EIEOCIEN24:1;
      uint64_t EIEOCIEN25:1;
      uint64_t EIEOCIEN26:1;
      uint64_t EIEOCIEN27:1;
      uint64_t EIEOCIEN28:1;
      uint64_t EIEOCIEN29:1;
      uint64_t EIEOCIEN30:1;
      uint64_t EIEOCIEN31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIMR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LAWIF1:1;
      uint64_t HAWIF1:1;
      uint64_t LAWIF2:1;
      uint64_t HAWIF2:1;
      uint64_t LAWIF3:1;
      uint64_t HAWIF3:1;
      uint64_t LAWIF4:1;
      uint64_t HAWIF4:1;
      uint64_t LAWIF5:1;
      uint64_t HAWIF5:1;
      uint64_t LAWIF6:1;
      uint64_t HAWIF6:1;
      uint64_t LAWIF7:1;
      uint64_t HAWIF7:1;
      uint64_t LAWIF8:1;
      uint64_t HAWIF8:1;
      uint64_t LAWIF9:1;
      uint64_t HAWIF9:1;
      uint64_t LAWIF10:1;
      uint64_t HAWIF10:1;
      uint64_t LAWIF11:1;
      uint64_t HAWIF11:1;
      uint64_t LAWIF12:1;
      uint64_t HAWIF12:1;
      uint64_t LAWIF13:1;
      uint64_t HAWIF13:1;
      uint64_t LAWIF14:1;
      uint64_t HAWIF14:1;
      uint64_t LAWIF15:1;
      uint64_t HAWIF15:1;
      uint64_t LAWIF16:1;
      uint64_t HAWIF16:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WTISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LAWIFEN1:1;
      uint64_t HDWIFEN1:1;
      uint64_t LAWIFEN2:1;
      uint64_t HDWIFEN2:1;
      uint64_t LAWIFEN3:1;
      uint64_t HDWIFEN3:1;
      uint64_t LAWIFEN4:1;
      uint64_t HDWIFEN4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WTIMR;

