iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAEN:1;
      uint64_t DCLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PIDMAREN0:1;
      uint64_t PIDMAREN1:1;
      uint64_t PIDMAREN2:1;
      uint64_t PIDMAREN3:1;
      uint64_t PIDMAREN4:1;
      uint64_t PIDMAREN5:1;
      uint64_t PIDMAREN6:1;
      uint64_t PIDMAREN7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIDMAREN0:1;
      uint64_t SIDMAREN1:1;
      uint64_t SIDMAREN2:1;
      uint64_t SIDMAREN3:1;
      uint64_t SIDMAREN4:1;
      uint64_t SIDMAREN5:1;
      uint64_t SIDMAREN6:1;
      uint64_t SIDMAREN7:1;
      uint64_t SIDMAREN8:1;
      uint64_t SIDMAREN9:1;
      uint64_t SIDMAREN10:1;
      uint64_t SIDMAREN11:1;
      uint64_t SIDMAREN12:1;
      uint64_t SIDMAREN13:1;
      uint64_t SIDMAREN14:1;
      uint64_t SIDMAREN15:1;
      uint64_t SIDMAREN16:1;
      uint64_t SIDMAREN17:1;
      uint64_t SIDMAREN18:1;
      uint64_t SIDMAREN19:1;
      uint64_t SIDMAREN20:1;
      uint64_t SIDMAREN21:1;
      uint64_t SIDMAREN22:1;
      uint64_t SIDMAREN23:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIDMAREN0:1;
      uint64_t EIDMAREN1:1;
      uint64_t EIDMAREN2:1;
      uint64_t EIDMAREN3:1;
      uint64_t EIDMAREN4:1;
      uint64_t EIDMAREN5:1;
      uint64_t EIDMAREN6:1;
      uint64_t EIDMAREN7:1;
      uint64_t EIDMAREN8:1;
      uint64_t EIDMAREN9:1;
      uint64_t EIDMAREN10:1;
      uint64_t EIDMAREN11:1;
      uint64_t EIDMAREN12:1;
      uint64_t EIDMAREN13:1;
      uint64_t EIDMAREN14:1;
      uint64_t EIDMAREN15:1;
      uint64_t EIDMAREN16:1;
      uint64_t EIDMAREN17:1;
      uint64_t EIDMAREN18:1;
      uint64_t EIDMAREN19:1;
      uint64_t EIDMAREN20:1;
      uint64_t EIDMAREN21:1;
      uint64_t EIDMAREN22:1;
      uint64_t EIDMAREN23:1;
      uint64_t EIDMAREN24:1;
      uint64_t EIDMAREN25:1;
      uint64_t EIDMAREN26:1;
      uint64_t EIDMAREN27:1;
      uint64_t EIDMAREN28:1;
      uint64_t EIDMAREN29:1;
      uint64_t EIDMAREN30:1;
      uint64_t EIDMAREN31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAR2;

  uint8_t res2[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRL:15;
      uint64_t reservedSpace0:1;
      uint64_t THRH:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THRHLR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRL:15;
      uint64_t reservedSpace0:1;
      uint64_t THRH:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THRHLR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRL:15;
      uint64_t reservedSpace0:1;
      uint64_t THRH:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THRHLR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRL:15;
      uint64_t reservedSpace0:1;
      uint64_t THRH:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THRHLR_3;

  uint8_t res3[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRECONV:1;
      uint64_t PREVAL0:1;
      uint64_t reservedSpace0:1;
      uint64_t PREVAL1:1;
      uint64_t reservedSpace1:1;
      uint64_t PREVAL2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRES0:1;
      uint64_t PRES1:1;
      uint64_t PRES2:1;
      uint64_t PRES3:1;
      uint64_t PRES4:1;
      uint64_t PRES5:1;
      uint64_t PRES6:1;
      uint64_t PRES7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRES0:1;
      uint64_t PRES1:1;
      uint64_t PRES2:1;
      uint64_t PRES3:1;
      uint64_t PRES4:1;
      uint64_t PRES5:1;
      uint64_t PRES6:1;
      uint64_t PRES7:1;
      uint64_t PRES8:1;
      uint64_t PRES9:1;
      uint64_t PRES10:1;
      uint64_t PRES11:1;
      uint64_t PRES12:1;
      uint64_t PRES13:1;
      uint64_t PRES14:1;
      uint64_t PRES15:1;
      uint64_t PRES16:1;
      uint64_t PRES17:1;
      uint64_t PRES18:1;
      uint64_t PRES19:1;
      uint64_t PRES20:1;
      uint64_t PRES21:1;
      uint64_t PRES22:1;
      uint64_t PRES23:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRES0:1;
      uint64_t PRES1:1;
      uint64_t PRES2:1;
      uint64_t PRES3:1;
      uint64_t PRES4:1;
      uint64_t PRES5:1;
      uint64_t PRES6:1;
      uint64_t PRES7:1;
      uint64_t PRES8:1;
      uint64_t PRES9:1;
      uint64_t PRES10:1;
      uint64_t PRES11:1;
      uint64_t PRES12:1;
      uint64_t PRES13:1;
      uint64_t PRES14:1;
      uint64_t PRES15:1;
      uint64_t PRES16:1;
      uint64_t PRES17:1;
      uint64_t PRES18:1;
      uint64_t PRES19:1;
      uint64_t PRES20:1;
      uint64_t PRES21:1;
      uint64_t PRES22:1;
      uint64_t PRES23:1;
      uint64_t PRES24:1;
      uint64_t PRES25:1;
      uint64_t PRES26:1;
      uint64_t PRES27:1;
      uint64_t PRES28:1;
      uint64_t PRES29:1;
      uint64_t PRES30:1;
      uint64_t PRES31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSR2;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INPSAMP:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INPSAMP:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INPSAMP:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTR2;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t CH4:1;
      uint64_t CH5:1;
      uint64_t CH6:1;
      uint64_t CH7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NCMR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH32:1;
      uint64_t CH33:1;
      uint64_t CH34:1;
      uint64_t CH35:1;
      uint64_t CH36:1;
      uint64_t CH37:1;
      uint64_t CH38:1;
      uint64_t CH39:1;
      uint64_t CH40:1;
      uint64_t CH41:1;
      uint64_t CH42:1;
      uint64_t CH43:1;
      uint64_t CH44:1;
      uint64_t CH45:1;
      uint64_t CH46:1;
      uint64_t CH47:1;
      uint64_t CH48:1;
      uint64_t CH49:1;
      uint64_t CH50:1;
      uint64_t CH51:1;
      uint64_t CH52:1;
      uint64_t CH53:1;
      uint64_t CH54:1;
      uint64_t CH55:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NCMR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH64:1;
      uint64_t CH65:1;
      uint64_t CH66:1;
      uint64_t CH67:1;
      uint64_t CH68:1;
      uint64_t CH69:1;
      uint64_t CH70:1;
      uint64_t CH71:1;
      uint64_t CH72:1;
      uint64_t CH73:1;
      uint64_t CH74:1;
      uint64_t CH75:1;
      uint64_t CH76:1;
      uint64_t CH77:1;
      uint64_t CH78:1;
      uint64_t CH79:1;
      uint64_t CH80:1;
      uint64_t CH81:1;
      uint64_t CH82:1;
      uint64_t CH83:1;
      uint64_t CH84:1;
      uint64_t CH85:1;
      uint64_t CH86:1;
      uint64_t CH87:1;
      uint64_t CH88:1;
      uint64_t CH89:1;
      uint64_t CH90:1;
      uint64_t CH91:1;
      uint64_t CH92:1;
      uint64_t CH93:1;
      uint64_t CH94:1;
      uint64_t CH95:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NCMR2;

