iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
  uint8_t res10[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR_29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR_30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECDR_31;

  uint8_t res11[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_SI0_0:2;
      uint64_t reservedSpace0:2;
      uint64_t WSEL_SI0_1:2;
      uint64_t reservedSpace1:2;
      uint64_t WSEL_SI0_2:2;
      uint64_t reservedSpace2:2;
      uint64_t WSEL_SI0_3:2;
      uint64_t reservedSpace3:2;
      uint64_t WSEL_SI0_4:2;
      uint64_t reservedSpace4:2;
      uint64_t WSEL_SI0_5:2;
      uint64_t reservedSpace5:2;
      uint64_t WSEL_SI0_6:2;
      uint64_t reservedSpace6:2;
      uint64_t WSEL_SI0_7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CWSELRPI0;

  uint32_t CWSELRPI1;
  uint8_t res12[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_SI0_0:2;
      uint64_t reservedSpace0:2;
      uint64_t WSEL_SI1_0:2;
      uint64_t reservedSpace1:2;
      uint64_t WSEL_SI2_0:2;
      uint64_t reservedSpace2:2;
      uint64_t WSEL_SI3_0:2;
      uint64_t reservedSpace3:2;
      uint64_t WSEL_SI4_0:2;
      uint64_t reservedSpace4:2;
      uint64_t WSEL_SI5_0:2;
      uint64_t reservedSpace5:2;
      uint64_t WSEL_SI6_0:2;
      uint64_t reservedSpace6:2;
      uint64_t WSEL_SI7_0:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CWSELRSI0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_SI0_1:2;
      uint64_t reservedSpace0:2;
      uint64_t WSEL_SI1_1:2;
      uint64_t reservedSpace1:2;
      uint64_t WSEL_SI2_1:2;
      uint64_t reservedSpace2:2;
      uint64_t WSEL_SI3_1:2;
      uint64_t reservedSpace3:2;
      uint64_t WSEL_SI4_1:2;
      uint64_t reservedSpace4:2;
      uint64_t WSEL_SI5_1:2;
      uint64_t reservedSpace5:2;
      uint64_t WSEL_SI6_1:2;
      uint64_t reservedSpace6:2;
      uint64_t WSEL_SI7_1:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CWSELRSI1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_SI0_2:2;
      uint64_t reservedSpace0:2;
      uint64_t WSEL_SI1_2:2;
      uint64_t reservedSpace1:2;
      uint64_t WSEL_SI2_2:2;
      uint64_t reservedSpace2:2;
      uint64_t WSEL_SI3_2:2;
      uint64_t reservedSpace3:2;
      uint64_t WSEL_SI4_2:2;
      uint64_t reservedSpace4:2;
      uint64_t WSEL_SI5_2:2;
      uint64_t reservedSpace5:2;
      uint64_t WSEL_SI6_2:2;
      uint64_t reservedSpace6:2;
      uint64_t WSEL_SI7_2:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CWSELRSI2;

  uint8_t res13[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_SI0_0:2;
      uint64_t reservedSpace0:2;
      uint64_t WSEL_SI0_1:2;
      uint64_t reservedSpace1:2;
      uint64_t WSEL_SI0_2:2;
      uint64_t reservedSpace2:2;
      uint64_t WSEL_SI0_3:2;
      uint64_t reservedSpace3:2;
      uint64_t WSEL_SI0_4:2;
      uint64_t reservedSpace4:2;
      uint64_t WSEL_SI0_5:2;
      uint64_t reservedSpace5:2;
      uint64_t WSEL_SI0_6:2;
      uint64_t reservedSpace6:2;
      uint64_t WSEL_SI0_7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CWSELREI0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_SI1_8:2;
      uint64_t reservedSpace0:2;
      uint64_t WSEL_SI1_9:2;
      uint64_t reservedSpace1:2;
      uint64_t WSEL_SI1_10:2;
      uint64_t reservedSpace2:2;
      uint64_t WSEL_SI1_11:2;
      uint64_t reservedSpace3:2;
      uint64_t WSEL_SI1_12:2;
      uint64_t reservedSpace4:2;
      uint64_t WSEL_SI1_13:2;
      uint64_t reservedSpace5:2;
      uint64_t WSEL_SI1_14:2;
      uint64_t reservedSpace6:2;
      uint64_t WSEL_SI1_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CWSELREI1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_SI2_16:2;
      uint64_t reservedSpace0:2;
      uint64_t WSEL_SI2_17:2;
      uint64_t reservedSpace1:2;
      uint64_t WSEL_SI2_18:2;
      uint64_t reservedSpace2:2;
      uint64_t WSEL_SI2_19:2;
      uint64_t reservedSpace3:2;
      uint64_t WSEL_SI2_20:2;
      uint64_t reservedSpace4:2;
      uint64_t WSEL_SI2_21:2;
      uint64_t reservedSpace5:2;
      uint64_t WSEL_SI2_22:2;
      uint64_t reservedSpace6:2;
      uint64_t WSEL_SI2_23:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CWSELREI2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_SI3_24:2;
      uint64_t reservedSpace0:2;
      uint64_t WSEL_SI3_25:2;
      uint64_t reservedSpace1:2;
      uint64_t WSEL_SI3_26:2;
      uint64_t reservedSpace2:2;
      uint64_t WSEL_SI3_27:2;
      uint64_t reservedSpace3:2;
      uint64_t WSEL_SI3_28:2;
      uint64_t reservedSpace4:2;
      uint64_t WSEL_SI3_29:2;
      uint64_t reservedSpace5:2;
      uint64_t WSEL_SI3_30:2;
      uint64_t reservedSpace6:2;
      uint64_t WSEL_SI3_31:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CWSELREI3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CWEN0:1;
      uint64_t CWEN1:1;
      uint64_t CWEN2:1;
      uint64_t CWEN3:1;
      uint64_t CWEN4:1;
      uint64_t CWEN5:1;
      uint64_t CWEN6:1;
      uint64_t CWEN7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CWENR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CWEN32:1;
      uint64_t CWEN33:1;
      uint64_t CWEN34:1;
      uint64_t CWEN35:1;
      uint64_t CWEN36:1;
      uint64_t CWEN37:1;
      uint64_t CWEN38:1;
      uint64_t CWEN39:1;
      uint64_t CWEN40:1;
      uint64_t CWEN41:1;
      uint64_t CWEN42:1;
      uint64_t CWEN43:1;
      uint64_t CWEN44:1;
      uint64_t CWEN45:1;
      uint64_t CWEN46:1;
      uint64_t CWEN47:1;
      uint64_t CWEN48:1;
      uint64_t CWEN49:1;
      uint64_t CWEN50:1;
      uint64_t CWEN51:1;
      uint64_t CWEN52:1;
      uint64_t CWEN53:1;
      uint64_t CWEN54:1;
      uint64_t CWEN55:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CWENR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CWEN64:1;
      uint64_t CWEN65:1;
      uint64_t CWEN66:1;
      uint64_t CWEN67:1;
      uint64_t CWEN68:1;
      uint64_t CWEN69:1;
      uint64_t CWEN70:1;
      uint64_t CWEN71:1;
      uint64_t CWEN72:1;
      uint64_t CWEN73:1;
      uint64_t CWEN74:1;
      uint64_t CWEN75:1;
      uint64_t CWEN76:1;
      uint64_t CWEN77:1;
      uint64_t CWEN78:1;
      uint64_t CWEN79:1;
      uint64_t CWEN80:1;
      uint64_t CWEN81:1;
      uint64_t CWEN82:1;
      uint64_t CWEN83:1;
      uint64_t CWEN84:1;
      uint64_t CWEN85:1;
      uint64_t CWEN86:1;
      uint64_t CWEN87:1;
      uint64_t CWEN88:1;
      uint64_t CWEN89:1;
      uint64_t CWEN90:1;
      uint64_t CWEN91:1;
      uint64_t CWEN92:1;
      uint64_t CWEN93:1;
      uint64_t CWEN94:1;
      uint64_t CWEN95:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CWENR2;

  uint8_t res14[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AWOR_CH0:1;
      uint64_t AWOR_CH1:1;
      uint64_t AWOR_CH2:1;
      uint64_t AWOR_CH3:1;
      uint64_t AWOR_CH4:1;
      uint64_t AWOR_CH5:1;
      uint64_t AWOR_CH6:1;
      uint64_t AWOR_CH7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AWORR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AWOR_CH0:1;
      uint64_t AWOR_CH1:1;
      uint64_t AWOR_CH2:1;
      uint64_t AWOR_CH3:1;
      uint64_t AWOR_CH4:1;
      uint64_t AWOR_CH5:1;
      uint64_t AWOR_CH6:1;
      uint64_t AWOR_CH7:1;
      uint64_t AWOR_CH8:1;
      uint64_t AWOR_CH9:1;
      uint64_t AWOR_CH10:1;
      uint64_t AWOR_CH11:1;
      uint64_t AWOR_CH12:1;
      uint64_t AWOR_CH13:1;
      uint64_t AWOR_CH14:1;
      uint64_t AWOR_CH15:1;
      uint64_t AWOR_CH16:1;
      uint64_t AWOR_CH17:1;
      uint64_t AWOR_CH18:1;
      uint64_t AWOR_CH19:1;
      uint64_t AWOR_CH20:1;
      uint64_t AWOR_CH21:1;
      uint64_t AWOR_CH22:1;
      uint64_t AWOR_CH23:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AWORR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AWOR_CH0:1;
      uint64_t AWOR_CH1:1;
      uint64_t AWOR_CH2:1;
      uint64_t AWOR_CH3:1;
      uint64_t AWOR_CH4:1;
      uint64_t AWOR_CH5:1;
      uint64_t AWOR_CH6:1;
      uint64_t AWOR_CH7:1;
      uint64_t AWOR_CH8:1;
      uint64_t AWOR_CH9:1;
      uint64_t AWOR_CH10:1;
      uint64_t AWOR_CH11:1;
      uint64_t AWOR_CH12:1;
      uint64_t AWOR_CH13:1;
      uint64_t AWOR_CH14:1;
      uint64_t AWOR_CH15:1;
      uint64_t AWOR_CH16:1;
      uint64_t AWOR_CH17:1;
      uint64_t AWOR_CH18:1;
      uint64_t AWOR_CH19:1;
      uint64_t AWOR_CH20:1;
      uint64_t AWOR_CH21:1;
      uint64_t AWOR_CH22:1;
      uint64_t AWOR_CH23:1;
      uint64_t AWOR_CH24:1;
      uint64_t AWOR_CH25:1;
      uint64_t AWOR_CH26:1;
      uint64_t AWOR_CH27:1;
      uint64_t AWOR_CH28:1;
      uint64_t AWOR_CH29:1;
      uint64_t AWOR_CH30:1;
      uint64_t AWOR_CH31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AWORR2;

  uint8_t res15[68];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t INPSAMP_S:8;
      uint64_t reservedSpace1:8;
      uint64_t INPSAMP_C:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FMA_S:1;
      uint64_t reservedSpace0:1;
      uint64_t FMA_C:1;
      uint64_t FMA_WDTERR:1;
      uint64_t FMA_WDSERR:1;
      uint64_t reservedSpace1:2;
      uint64_t EN:1;
      uint64_t reservedSpace2:3;
      uint64_t MSKERR_S0:1;
      uint64_t MSKERR_S1:1;
      uint64_t MSKERR_S2:1;
      uint64_t reservedSpace3:1;
      uint64_t MSKERR_C:1;
      uint64_t MSKWDG_EOA_S:1;
      uint64_t reservedSpace4:1;
      uint64_t MSKWDG_EOA_C:1;
      uint64_t reservedSpace5:4;
      uint64_t MSKST_EOC:1;
      uint64_t reservedSpace6:1;
      uint64_t MSKWDTERR:1;
      uint64_t SERR:1;
      uint64_t MSKWDSERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTEP:5;
      uint64_t reservedSpace0:3;
      uint64_t ALG:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STCR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BR:8;
      uint64_t reservedSpace0:8;
      uint64_t WDT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STBRR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t STEP_C:5;
      uint64_t reservedSpace1:1;
      uint64_t ERR_S0:1;
      uint64_t ERR_S1:1;
      uint64_t ERR_S2:1;
      uint64_t reservedSpace2:1;
      uint64_t ERR_C:1;
      uint64_t WDG_EOA_S:1;
      uint64_t reservedSpace3:1;
      uint64_t WDG_EOA_C:1;
      uint64_t reservedSpace4:4;
      uint64_t ST_EOC:1;
      uint64_t OVERWR:1;
      uint64_t WDTERR:1;
      uint64_t reservedSpace5:1;
      uint64_t WDSERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STSR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA0:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STSR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA0:15;
      uint64_t reservedSpace0:1;
      uint64_t DATA1:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STSR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DATA1:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STSR4;

  uint8_t res16[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCDATA:15;
      uint64_t reservedSpace0:3;
      uint64_t OWERWR:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STDR1;

  uint8_t res17[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRL:15;
      uint64_t reservedSpace0:1;
      uint64_t THRH:14;
      uint64_t WDTE:1;
      uint64_t AWDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAW0R;

  uint8_t res18[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRL:15;
      uint64_t reservedSpace0:16;
      uint64_t AWDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAW1R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRL:15;
      uint64_t reservedSpace0:16;
      uint64_t AWDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAW2R;

  uint8_t res19[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRL:15;
      uint64_t reservedSpace0:1;
      uint64_t THRH:14;
      uint64_t WDTE:1;
      uint64_t AWDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAW4R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRL:15;
      uint64_t reservedSpace0:1;
      uint64_t THRH:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAW5R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:17;
      uint64_t HSEN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AMSIO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEST_EN:1;
      uint64_t reservedSpace0:2;
      uint64_t TEST_FAIL:1;
      uint64_t AVG_EN:1;
      uint64_t NR_SMPL:2;
      uint64_t reservedSpace1:7;
      uint64_t CALSTFUL:1;
      uint64_t C_T_BUSY:1;
      uint64_t reservedSpace2:11;
      uint64_t TSAMP:2;
      uint64_t RESN:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CALBISTREG;

  uint8_t res20[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFFSET_USER:8;
      uint64_t reservedSpace0:8;
      uint64_t GAIN_USER:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OFSGNUSR;

  uint8_t res21[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:15;
      uint64_t ENX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAL2;

