iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
};

#define PIT_1_TIMER_2 (*(volatile struct PIT_1_TIMER_2_tag *) 0x400b4120)

struct PIT_1_TIMER_3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LDVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TVL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TIE:1;
      uint64_t CHN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFLG;

};

#define PIT_1_TIMER_3 (*(volatile struct PIT_1_TIMER_3_tag *) 0x400b4130)

struct PIT_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRZ:1;
      uint64_t MDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

};

#define PIT_2 (*(volatile struct PIT_2_tag *) 0x402fc000)

struct PIT_2_TIMER_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LDVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TVL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TIE:1;
      uint64_t CHN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFLG;

};

#define PIT_2_TIMER_0 (*(volatile struct PIT_2_TIMER_0_tag *) 0x402fc100)

struct PIT_2_TIMER_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LDVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TVL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TIE:1;
      uint64_t CHN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFLG;

};

#define PIT_2_TIMER_1 (*(volatile struct PIT_2_TIMER_1_tag *) 0x402fc110)

struct PIT_2_TIMER_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LDVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TVL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TIE:1;
      uint64_t CHN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFLG;

};

#define PIT_2_TIMER_2 (*(volatile struct PIT_2_TIMER_2_tag *) 0x402fc120)

struct PIT_2_TIMER_3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LDVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TVL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TIE:1;
      uint64_t CHN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFLG;

};

#define PIT_2_TIMER_3 (*(volatile struct PIT_2_TIMER_3_tag *) 0x402fc130)

struct AXBS_LITE_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0:3;
      uint64_t reservedSpace0:1;
      uint64_t M1:3;
      uint64_t reservedSpace1:1;
      uint64_t M2:3;
      uint64_t reservedSpace2:1;
      uint64_t M3:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRS0;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARK:3;
      uint64_t reservedSpace0:1;
      uint64_t PCTL:2;
      uint64_t reservedSpace1:2;
      uint64_t ARB:2;
      uint64_t reservedSpace2:6;
      uint64_t HPE0:1;
      uint64_t HPE1:1;
      uint64_t HPE2:1;
      uint64_t HPE3:1;
      uint64_t reservedSpace3:10;
      uint64_t HLP:1;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRS0;

  uint8_t res1[236];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0:3;
      uint64_t reservedSpace0:1;
      uint64_t M1:3;
      uint64_t reservedSpace1:1;
      uint64_t M2:3;
      uint64_t reservedSpace2:1;
      uint64_t M3:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRS1;

  uint8_t res2[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARK:3;
      uint64_t reservedSpace0:1;
      uint64_t PCTL:2;
      uint64_t reservedSpace1:2;
      uint64_t ARB:2;
      uint64_t reservedSpace2:6;
      uint64_t HPE0:1;
      uint64_t HPE1:1;
      uint64_t HPE2:1;
      uint64_t HPE3:1;
      uint64_t reservedSpace3:10;
      uint64_t HLP:1;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRS1;

  uint8_t res3[236];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0:3;
      uint64_t reservedSpace0:1;
      uint64_t M1:3;
      uint64_t reservedSpace1:1;
      uint64_t M2:3;
      uint64_t reservedSpace2:1;
      uint64_t M3:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRS2;

  uint8_t res4[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARK:3;
      uint64_t reservedSpace0:1;
      uint64_t PCTL:2;
      uint64_t reservedSpace1:2;
      uint64_t ARB:2;
      uint64_t reservedSpace2:6;
      uint64_t HPE0:1;
      uint64_t HPE1:1;
      uint64_t HPE2:1;
      uint64_t HPE3:1;
      uint64_t reservedSpace3:10;
      uint64_t HLP:1;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRS2;

  uint8_t res5[236];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0:3;
      uint64_t reservedSpace0:1;
      uint64_t M1:3;
      uint64_t reservedSpace1:1;
      uint64_t M2:3;
      uint64_t reservedSpace2:1;
      uint64_t M3:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRS3;

  uint8_t res6[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARK:3;
      uint64_t reservedSpace0:1;
      uint64_t PCTL:2;
      uint64_t reservedSpace1:2;
      uint64_t ARB:2;
      uint64_t reservedSpace2:6;
      uint64_t HPE0:1;
      uint64_t HPE1:1;
      uint64_t HPE2:1;
      uint64_t HPE3:1;
      uint64_t reservedSpace3:10;
      uint64_t HLP:1;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRS3;

  uint8_t res7[236];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0:3;
      uint64_t reservedSpace0:1;
      uint64_t M1:3;
      uint64_t reservedSpace1:1;
      uint64_t M2:3;
      uint64_t reservedSpace2:1;
      uint64_t M3:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRS4;

  uint8_t res8[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARK:3;
      uint64_t reservedSpace0:1;
      uint64_t PCTL:2;
      uint64_t reservedSpace1:2;
      uint64_t ARB:2;
      uint64_t reservedSpace2:6;
      uint64_t HPE0:1;
      uint64_t HPE1:1;
      uint64_t HPE2:1;
      uint64_t HPE3:1;
      uint64_t reservedSpace3:10;
      uint64_t HLP:1;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRS4;

  uint8_t res9[236];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0:3;
      uint64_t reservedSpace0:1;
      uint64_t M1:3;
      uint64_t reservedSpace1:1;
      uint64_t M2:3;
      uint64_t reservedSpace2:1;
      uint64_t M3:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRS5;

  uint8_t res10[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARK:3;
      uint64_t reservedSpace0:1;
      uint64_t PCTL:2;
      uint64_t reservedSpace1:2;
      uint64_t ARB:2;
      uint64_t reservedSpace2:6;
      uint64_t HPE0:1;
      uint64_t HPE1:1;
      uint64_t HPE2:1;
      uint64_t HPE3:1;
      uint64_t reservedSpace3:10;
      uint64_t HLP:1;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRS5;

  uint8_t res11[236];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0:3;
      uint64_t reservedSpace0:1;
      uint64_t M1:3;
      uint64_t reservedSpace1:1;
      uint64_t M2:3;
      uint64_t reservedSpace2:1;
      uint64_t M3:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRS6;

