iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
  uint8_t res12[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARK:3;
      uint64_t reservedSpace0:1;
      uint64_t PCTL:2;
      uint64_t reservedSpace1:2;
      uint64_t ARB:2;
      uint64_t reservedSpace2:6;
      uint64_t HPE0:1;
      uint64_t HPE1:1;
      uint64_t HPE2:1;
      uint64_t HPE3:1;
      uint64_t reservedSpace3:10;
      uint64_t HLP:1;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRS6;

};

#define AXBS_LITE (*(volatile struct AXBS_LITE_tag *) 0x40200000)

struct XBIC_AXBS_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ME7:1;
      uint64_t ME6:1;
      uint64_t ME5:1;
      uint64_t ME4:1;
      uint64_t ME3:1;
      uint64_t ME2:1;
      uint64_t ME1:1;
      uint64_t ME0:1;
      uint64_t SE7:1;
      uint64_t SE6:1;
      uint64_t SE5:1;
      uint64_t SE4:1;
      uint64_t SE3:1;
      uint64_t SE2:1;
      uint64_t SE1:1;
      uint64_t SE0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYN:8;
      uint64_t MST:4;
      uint64_t SLV:3;
      uint64_t reservedSpace0:16;
      uint64_t EIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYN:8;
      uint64_t MST:4;
      uint64_t SLV:3;
      uint64_t DPME7:1;
      uint64_t DPME6:1;
      uint64_t DPME5:1;
      uint64_t DPME4:1;
      uint64_t DPME3:1;
      uint64_t DPME2:1;
      uint64_t DPME1:1;
      uint64_t DPME0:1;
      uint64_t DPSE7:1;
      uint64_t DPSE6:1;
      uint64_t DPSE5:1;
      uint64_t DPSE4:1;
      uint64_t DPSE3:1;
      uint64_t DPSE2:1;
      uint64_t DPSE1:1;
      uint64_t DPSE0:1;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EAR;

};

#define XBIC_AXBS (*(volatile struct XBIC_AXBS_tag *) 0x40204000)

struct XBIC_AXBS_PERI_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ME7:1;
      uint64_t ME6:1;
      uint64_t ME5:1;
      uint64_t ME4:1;
      uint64_t ME3:1;
      uint64_t ME2:1;
      uint64_t ME1:1;
      uint64_t ME0:1;
      uint64_t SE7:1;
      uint64_t SE6:1;
      uint64_t SE5:1;
      uint64_t SE4:1;
      uint64_t SE3:1;
      uint64_t SE2:1;
      uint64_t SE1:1;
      uint64_t SE0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYN:8;
      uint64_t MST:4;
      uint64_t SLV:3;
      uint64_t reservedSpace0:16;
      uint64_t EIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYN:8;
      uint64_t MST:4;
      uint64_t SLV:3;
      uint64_t DPME7:1;
      uint64_t DPME6:1;
      uint64_t DPME5:1;
      uint64_t DPME4:1;
      uint64_t DPME3:1;
      uint64_t DPME2:1;
      uint64_t DPME1:1;
      uint64_t DPME0:1;
      uint64_t DPSE7:1;
      uint64_t DPSE6:1;
      uint64_t DPSE5:1;
      uint64_t DPSE4:1;
      uint64_t DPSE3:1;
      uint64_t DPSE2:1;
      uint64_t DPSE1:1;
      uint64_t DPSE0:1;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EAR;

};

#define XBIC_AXBS_PERI (*(volatile struct XBIC_AXBS_PERI_tag *) 0x40208000)

struct XBIC_AXBS_TCM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ME7:1;
      uint64_t ME6:1;
      uint64_t ME5:1;
      uint64_t ME4:1;
      uint64_t ME3:1;
      uint64_t ME2:1;
      uint64_t ME1:1;
      uint64_t ME0:1;
      uint64_t SE7:1;
      uint64_t SE6:1;
      uint64_t SE5:1;
      uint64_t SE4:1;
      uint64_t SE3:1;
      uint64_t SE2:1;
      uint64_t SE1:1;
      uint64_t SE0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYN:8;
      uint64_t MST:4;
      uint64_t SLV:3;
      uint64_t reservedSpace0:16;
      uint64_t EIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYN:8;
      uint64_t MST:4;
      uint64_t SLV:3;
      uint64_t DPME7:1;
      uint64_t DPME6:1;
      uint64_t DPME5:1;
      uint64_t DPME4:1;
      uint64_t DPME3:1;
      uint64_t DPME2:1;
      uint64_t DPME1:1;
      uint64_t DPME0:1;
      uint64_t DPSE7:1;
      uint64_t DPSE6:1;
      uint64_t DPSE5:1;
      uint64_t DPSE4:1;
      uint64_t DPSE3:1;
      uint64_t DPSE2:1;
      uint64_t DPSE1:1;
      uint64_t DPSE0:1;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EAR;

};

#define XBIC_AXBS_TCM (*(volatile struct XBIC_AXBS_TCM_tag *) 0x40400000)

struct XBIC_AXBS_EDMA_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ME7:1;
      uint64_t ME6:1;
      uint64_t ME5:1;
      uint64_t ME4:1;
      uint64_t ME3:1;
      uint64_t ME2:1;
      uint64_t ME1:1;
      uint64_t ME0:1;
      uint64_t SE7:1;
      uint64_t SE6:1;
      uint64_t SE5:1;
      uint64_t SE4:1;
      uint64_t SE3:1;
      uint64_t SE2:1;
      uint64_t SE1:1;
      uint64_t SE0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYN:8;
      uint64_t MST:4;
      uint64_t SLV:3;
      uint64_t reservedSpace0:16;
      uint64_t EIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYN:8;
      uint64_t MST:4;
      uint64_t SLV:3;
      uint64_t DPME7:1;
      uint64_t DPME6:1;
      uint64_t DPME5:1;
      uint64_t DPME4:1;
      uint64_t DPME3:1;
      uint64_t DPME2:1;
      uint64_t DPME1:1;
      uint64_t DPME0:1;
      uint64_t DPSE7:1;
      uint64_t DPSE6:1;
      uint64_t DPSE5:1;
      uint64_t DPSE4:1;
      uint64_t DPSE3:1;
      uint64_t DPSE2:1;
      uint64_t DPSE1:1;
      uint64_t DPSE0:1;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EAR;

