iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
};

#define XBIC_AXBS_EDMA (*(volatile struct XBIC_AXBS_EDMA_tag *) 0x40404000)

struct EDMA_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t EDBG:1;
      uint64_t ERCA:1;
      uint64_t reservedSpace1:1;
      uint64_t HAE:1;
      uint64_t HALT:1;
      uint64_t GCLC:1;
      uint64_t GMRC:1;
      uint64_t ECX:1;
      uint64_t CX:1;
      uint64_t reservedSpace2:14;
      uint64_t ACTIVE_ID:5;
      uint64_t reservedSpace3:2;
      uint64_t ACTIVE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DBE:1;
      uint64_t SBE:1;
      uint64_t SGE:1;
      uint64_t NCE:1;
      uint64_t DOE:1;
      uint64_t DAE:1;
      uint64_t SOE:1;
      uint64_t SAE:1;
      uint64_t ECX:1;
      uint64_t UCE:1;
      uint64_t reservedSpace0:14;
      uint64_t ERRCHN:5;
      uint64_t reservedSpace1:2;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HRS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HRS;

  uint8_t res0[240];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_31;

