iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
  uint8_t res6[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SDAAPGENSTATUS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDAAPGENSTATUS1;

  uint8_t res7[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SDAAPGENSTATUS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDAAPGENSTATUS2;

  uint8_t res8[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SDAAPGENSTATUS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDAAPGENSTATUS3;

  uint8_t res9[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SDAAPGENSTATUS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDAAPGENSTATUS4;

  uint8_t res10[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ID;

};

#define SDA_AP (*(volatile struct SDA_AP_tag *) 0x40254700)

struct EIM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t GEIEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EIMCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t EICH30EN:1;
      uint64_t EICH29EN:1;
      uint64_t EICH28EN:1;
      uint64_t EICH27EN:1;
      uint64_t EICH26EN:1;
      uint64_t EICH25EN:1;
      uint64_t EICH24EN:1;
      uint64_t EICH23EN:1;
      uint64_t EICH22EN:1;
      uint64_t EICH21EN:1;
      uint64_t EICH20EN:1;
      uint64_t EICH19EN:1;
      uint64_t EICH18EN:1;
      uint64_t EICH17EN:1;
      uint64_t EICH16EN:1;
      uint64_t EICH15EN:1;
      uint64_t EICH14EN:1;
      uint64_t EICH13EN:1;
      uint64_t EICH12EN:1;
      uint64_t EICH11EN:1;
      uint64_t EICH10EN:1;
      uint64_t EICH9EN:1;
      uint64_t EICH8EN:1;
      uint64_t EICH7EN:1;
      uint64_t EICH6EN:1;
      uint64_t EICH5EN:1;
      uint64_t EICH4EN:1;
      uint64_t EICH3EN:1;
      uint64_t EICH2EN:1;
      uint64_t EICH1EN:1;
      uint64_t EICH0EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHEN;

  uint8_t res0[248];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t CHKBIT_MASK:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD0_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD0_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B4_7DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD0_WORD2;

  uint8_t res1[52];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t CHKBIT_MASK:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD1_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD1_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B4_7DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD1_WORD2;

  uint8_t res2[52];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t CHKBIT_MASK:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD2_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD2_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B4_7DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD2_WORD2;

  uint8_t res3[52];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:18;
      uint64_t CHKBIT_MASK:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD3_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD3_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B4_7DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD3_WORD2;

  uint8_t res4[52];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t CHKBIT_MASK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD4_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD4_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B4_7DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD4_WORD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B8_11DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD4_WORD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B12_15DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD4_WORD4;

  uint8_t res5[44];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t CHKBIT_MASK:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD5_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD5_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B4_7DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD5_WORD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B8_11DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD5_WORD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B12_15DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD5_WORD4;

  uint8_t res6[44];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t CHKBIT_MASK:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD6_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD6_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B4_7DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD6_WORD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B8_11DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD6_WORD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B12_15DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD6_WORD4;

  uint8_t res7[44];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t CHKBIT_MASK:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD7_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD7_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B4_7DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD7_WORD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B8_11DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD7_WORD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B12_15DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD7_WORD4;

  uint8_t res8[44];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:18;
      uint64_t CHKBIT_MASK:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD8_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD8_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B4_7DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD8_WORD2;

