iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
  uint8_t res9[52];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t CHKBIT_MASK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD9_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD9_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B4_7DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD9_WORD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B8_11DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD9_WORD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B12_15DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD9_WORD4;

  uint8_t res10[44];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t CHKBIT_MASK:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD10_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD10_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B4_7DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD10_WORD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B8_11DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD10_WORD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B12_15DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD10_WORD4;

  uint8_t res11[44];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t CHKBIT_MASK:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD11_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD11_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B4_7DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD11_WORD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B8_11DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD11_WORD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B12_15DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD11_WORD4;

  uint8_t res12[44];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t CHKBIT_MASK:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD12_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD12_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B4_7DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD12_WORD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B8_11DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD12_WORD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B12_15DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD12_WORD4;

  uint8_t res13[44];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t CHKBIT_MASK:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD13_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD13_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B4_7DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD13_WORD2;

  uint8_t res14[52];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t CHKBIT_MASK:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD14_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD14_WORD1;

  uint8_t res15[56];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t CHKBIT_MASK:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD15_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD15_WORD1;

  uint8_t res16[56];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t CHKBIT_MASK:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD16_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD16_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B4_7DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD16_WORD2;

  uint8_t res17[52];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t CHKBIT_MASK:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD17_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD17_WORD1;

  uint8_t res18[56];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t CHKBIT_MASK:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD18_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD18_WORD1;

  uint8_t res19[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD19_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B4_7DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD19_WORD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B8_11DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD19_WORD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B12_15DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD19_WORD4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B16_19DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD19_WORD5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B20_23DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD19_WORD6;

  uint8_t res20[40];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD20_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B4_7DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD20_WORD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B8_11DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD20_WORD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B12_15DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD20_WORD4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B16_19DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD20_WORD5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B20_23DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD20_WORD6;

  uint8_t res21[40];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD21_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B4_7DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD21_WORD2;

  uint8_t res22[56];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD22_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B4_7DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD22_WORD2;

  uint8_t res23[56];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD23_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B4_7DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD23_WORD2;

  uint8_t res24[56];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD24_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B4_7DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD24_WORD2;

  uint8_t res25[56];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD25_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B4_7DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD25_WORD2;

