iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
  uint8_t res5[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORR_ERR_CNT4;

  uint8_t res6[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORR_ERR_CNT5;

  uint8_t res7[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORR_ERR_CNT6;

  uint8_t res8[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORR_ERR_CNT7;

  uint8_t res9[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORR_ERR_CNT8;

  uint8_t res10[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORR_ERR_CNT9;

  uint8_t res11[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EAR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t SYNDROME:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYN10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORR_ERR_CNT10;

  uint8_t res12[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EAR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t SYNDROME:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYN11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORR_ERR_CNT11;

  uint8_t res13[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EAR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t SYNDROME:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYN12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORR_ERR_CNT12;

  uint8_t res14[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EAR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t SYNDROME:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYN13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORR_ERR_CNT13;

  uint8_t res15[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EAR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t SYNDROME:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYN14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORR_ERR_CNT14;

  uint8_t res16[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EAR15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t SYNDROME:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYN15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORR_ERR_CNT15;

  uint8_t res17[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EAR16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t SYNDROME:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYN16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORR_ERR_CNT16;

  uint8_t res18[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EAR17;

  uint8_t res19[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORR_ERR_CNT17;

  uint8_t res20[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EAR18;

  uint8_t res21[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORR_ERR_CNT18;

  uint8_t res22[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EAR19;

  uint8_t res23[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORR_ERR_CNT19;

};

#define ERM (*(volatile struct ERM_tag *) 0x4025c000)

struct MSCM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERSONALITY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPXTYPE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPXNUM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RYPZ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPXREV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCWY:8;
      uint64_t DCSZ:8;
      uint64_t ICWY:8;
      uint64_t ICSZ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPXCFG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t L2WY:8;
      uint64_t L2SZ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPXCFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ITCMSZ:8;
      uint64_t DTCMSZ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPXCFG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FPU:1;
      uint64_t SIMD:1;
      uint64_t MMU:1;
      uint64_t CMP:1;
      uint64_t CPY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPXCFG3;

