iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERSONALITY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CP0TYPE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CP0NUM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RYPZ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CP0REV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCWY:8;
      uint64_t DCSZ:8;
      uint64_t ICWY:8;
      uint64_t ICSZ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CP0CFG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t L2WY:8;
      uint64_t L2SZ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CP0CFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ITCMSZ:8;
      uint64_t DTCMSZ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CP0CFG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FPU:1;
      uint64_t SIMD:1;
      uint64_t MMU:1;
      uint64_t CMP:1;
      uint64_t CPY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CP0CFG3;

  uint8_t res1[452];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CP0_INT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRCP0ISR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRCP0IGR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CP0_INT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRCP0ISR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRCP0IGR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CP0_INT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRCP0ISR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRCP0IGR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CP0_INT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRCP0ISR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRCP0IGR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CP0_INT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRCP1ISR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRCP1IGR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CP0_INT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRCP1ISR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRCP1IGR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CP0_INT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRCP1ISR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRCP1IGR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CP0_INT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRCP1ISR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRCP1IGR3;

  uint8_t res2[448];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CP0_TR:1;
      uint64_t reservedSpace0:30;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRCPCFG;

  uint8_t res3[508];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN_RD_CM7_0_AHBM:1;
      uint64_t EN_RD_CM7_0_AHBP:1;
      uint64_t EN_RD_EDMA:1;
      uint64_t reservedSpace0:1;
      uint64_t EN_RD_HSE:1;
      uint64_t EN_RD_EMAC:1;
      uint64_t EN_RD_CM7_1_AHBM:1;
      uint64_t EN_RD_CM7_1_AHBP:1;
      uint64_t EN_RD_TCM:1;
      uint64_t EN_ADD_PFLASH_PORT0:1;
      uint64_t EN_ADD_PFLASH_PORT1:1;
      uint64_t EN_ADD_PFLASH_PORT2:1;
      uint64_t EN_WR_PRAM0:1;
      uint64_t EN_ADD_PRAM0:1;
      uint64_t EN_WR_PRAM1:1;
      uint64_t EN_ADD_PRAM1:1;
      uint64_t EN_WR_TCM:1;
      uint64_t EN_ADD_TCM:1;
      uint64_t reservedSpace1:1;
      uint64_t EN_ADD_QSPI:1;
      uint64_t EN_WR_AIPS0:1;
      uint64_t EN_ADD_AIPS0:1;
      uint64_t EN_WR_AIPS1:1;
      uint64_t EN_ADD_AIPS1:1;
      uint64_t EN_WR_AIPS2:1;
      uint64_t EN_ADD_AIPS2:1;
      uint64_t EN_WR_CM7_0_TCM:1;
      uint64_t EN_ADD_CM7_0_TCM:1;
      uint64_t EN_WR_CM7_1_TCM:1;
      uint64_t EN_ADD_CM7_1_TCM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENEDC;

  uint8_t res4[252];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_DIS_WR_OPT:1;
      uint64_t reservedSpace0:3;
      uint64_t DMA_AXBS_S0_DIS_WR_OPT:1;
      uint64_t reservedSpace1:3;
      uint64_t DMA_AXBS_S1_DIS_WR_OPT:1;
      uint64_t reservedSpace2:3;
      uint64_t HSE_DIS_WR_OPT:1;
      uint64_t reservedSpace3:3;
      uint64_t TCM_DIS_WR_OPT:1;
      uint64_t reservedSpace4:3;
      uint64_t QSPI_DIS_WR_OPT:1;
      uint64_t reservedSpace5:3;
      uint64_t AIPS1_DIS_WR_OPT:1;
      uint64_t reservedSpace6:3;
      uint64_t AIPS2_DIS_WR_OPT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IAHBCFGREG;

  uint8_t res5[380];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_0;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_2;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_3;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_4;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_5;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_6;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_7;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_8;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_9;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_10;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_11;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_12;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_13;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_14;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_15;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_16;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_17;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_18;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_19;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_20;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_21;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_22;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_23;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_24;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_25;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_26;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_27;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_28;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_29;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_30;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_31;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_32;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_33;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_34;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_35;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_36;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_37;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_38;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_39;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_40;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_41;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_42;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_43;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_44;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_45;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_46;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_47;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_48;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_49;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_50;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_51;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_52;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_53;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_54;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_55;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_56;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_57;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_58;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_59;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_60;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_61;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_62;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_63;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_64;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_65;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_66;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_67;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_68;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_69;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_70;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_71;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_72;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_73;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_74;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_75;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_76;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_77;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_78;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_79;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_80;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_81;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_82;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_83;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_84;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_85;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_86;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_87;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_88;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t reservedSpace0:14;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_89;

