iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
};

#define MSCM (*(volatile struct MSCM_tag *) 0x40260000)

struct PRAMC_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FT_DIS:1;
      uint64_t reservedSpace0:5;
      uint64_t P0_BO_DIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRCR1;

};

#define PRAMC_0 (*(volatile struct PRAMC_0_tag *) 0x40264000)

struct PRAMC_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FT_DIS:1;
      uint64_t reservedSpace0:5;
      uint64_t P0_BO_DIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRCR1;

};

#define PRAMC_1 (*(volatile struct PRAMC_1_tag *) 0x40464000)

struct PFLASH_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t P0_CBFEN:1;
      uint64_t P0_DBFEN:1;
      uint64_t reservedSpace0:2;
      uint64_t P0_CPFEN:1;
      uint64_t P0_DPFEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P0_CBFEN:1;
      uint64_t P0_DBFEN:1;
      uint64_t reservedSpace0:2;
      uint64_t P0_CPFEN:1;
      uint64_t P0_DPFEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCR_1;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DERR_SUP:1;
      uint64_t BLK4_PS:3;
      uint64_t reservedSpace0:3;
      uint64_t DMEEE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M15AP:2;
      uint64_t M14AP:2;
      uint64_t M13AP:2;
      uint64_t M12AP:2;
      uint64_t M11AP:2;
      uint64_t M10AP:2;
      uint64_t M9AP:2;
      uint64_t M8AP:2;
      uint64_t M7AP:2;
      uint64_t M6AP:2;
      uint64_t M5AP:2;
      uint64_t M4AP:2;
      uint64_t reservedSpace0:2;
      uint64_t M2AP:2;
      uint64_t M1AP:2;
      uint64_t M0AP:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFAPR;

  uint8_t res1[744];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PEADR_L:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCPGM_PEADR_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PEADR_P:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCPGM_PEADR_P;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XPEADR_L:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCPGM_XPEADR_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XPEADR_P:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCPGM_XPEADR_P;

  uint8_t res2[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLCK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_SPELOCK_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLCK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_SPELOCK_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLCK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_SPELOCK_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLCK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_SPELOCK_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLCK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_SPELOCK_4;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLKU_SPELOCK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSLCK:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_SSPELOCK_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSLCK:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_SSPELOCK_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSLCK:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_SSPELOCK_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSLCK:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_SSPELOCK_3;

  uint8_t res4[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETSLCK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_SETSLOCK_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETSLCK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_SETSLOCK_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETSLCK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_SETSLOCK_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETSLCK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_SETSLOCK_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETSLCK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_SETSLOCK_4;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETSLCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLKU_SETSLOCK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSETSLCK:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_SSETSLOCK_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSETSLCK:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_SSETSLOCK_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSETSLCK:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_SSETSLOCK_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSETSLCK:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_SSETSLOCK_3;

  uint8_t res6[212];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLKU_LOCKMASTER_S;

};

#define PFLASH (*(volatile struct PFLASH_tag *) 0x40268000)

struct PFLASH_PFCBLKi_LOCKMASTER_S_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_7;

