iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
};

#define PFLASH_PFCBLKi_LOCKMASTER_SS_0 (*(volatile struct PFLASH_PFCBLKi_LOCKMASTER_SS_0_tag *) 0x40268484)

struct PFLASH_PFCBLKi_LOCKMASTER_SS_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS2;

};

#define PFLASH_PFCBLKi_LOCKMASTER_SS_1 (*(volatile struct PFLASH_PFCBLKi_LOCKMASTER_SS_1_tag *) 0x40268494)

struct PFLASH_PFCBLKi_LOCKMASTER_SS_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS2;

};

#define PFLASH_PFCBLKi_LOCKMASTER_SS_2 (*(volatile struct PFLASH_PFCBLKi_LOCKMASTER_SS_2_tag *) 0x402684a4)

struct PFLASH_PFCBLKi_LOCKMASTER_SS_3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS2;

};

#define PFLASH_PFCBLKi_LOCKMASTER_SS_3 (*(volatile struct PFLASH_PFCBLKi_LOCKMASTER_SS_3_tag *) 0x402684b4)

struct SWT_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t WEN:1;
      uint64_t FRZ:1;
      uint64_t STP:1;
      uint64_t reservedSpace0:1;
      uint64_t SLK:1;
      uint64_t HLK:1;
      uint64_t ITR:1;
      uint64_t WND:1;
      uint64_t RIA:1;
      uint64_t SMD:2;
      uint64_t reservedSpace1:13;
      uint64_t MAP7:1;
      uint64_t MAP6:1;
      uint64_t MAP5:1;
      uint64_t MAP4:1;
      uint64_t MAP3:1;
      uint64_t MAP2:1;
      uint64_t MAP1:1;
      uint64_t MAP0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WTO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WST:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RRF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RRR;

};

#define SWT_0 (*(volatile struct SWT_0_tag *) 0x40270000)

struct STM_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t FRZ:1;
      uint64_t reservedSpace0:6;
      uint64_t CPS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNT;

};

#define STM_0 (*(volatile struct STM_0_tag *) 0x40274000)

struct STM_0_CHANNEL_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMP;

};

#define STM_0_CHANNEL_0 (*(volatile struct STM_0_CHANNEL_0_tag *) 0x40274010)

struct STM_0_CHANNEL_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMP;

};

#define STM_0_CHANNEL_1 (*(volatile struct STM_0_CHANNEL_1_tag *) 0x40274020)

struct STM_0_CHANNEL_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMP;

};

#define STM_0_CHANNEL_2 (*(volatile struct STM_0_CHANNEL_2_tag *) 0x40274030)

struct STM_0_CHANNEL_3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMP;

