iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
};

#define STM_0_CHANNEL_3 (*(volatile struct STM_0_CHANNEL_3_tag *) 0x40274040)

struct STM_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t FRZ:1;
      uint64_t reservedSpace0:6;
      uint64_t CPS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNT;

};

#define STM_1 (*(volatile struct STM_1_tag *) 0x40474000)

struct STM_1_CHANNEL_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMP;

};

#define STM_1_CHANNEL_0 (*(volatile struct STM_1_CHANNEL_0_tag *) 0x40474010)

struct STM_1_CHANNEL_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMP;

};

#define STM_1_CHANNEL_1 (*(volatile struct STM_1_CHANNEL_1_tag *) 0x40474020)

struct STM_1_CHANNEL_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMP;

};

#define STM_1_CHANNEL_2 (*(volatile struct STM_1_CHANNEL_2_tag *) 0x40474030)

struct STM_1_CHANNEL_3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMP;

};

#define STM_1_CHANNEL_3 (*(volatile struct STM_1_CHANNEL_3_tag *) 0x40474040)

struct XRDC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t GVLD:1;
      uint64_t HRL:4;
      uint64_t reservedSpace0:2;
      uint64_t MRF:1;
      uint64_t VAW:1;
      uint64_t reservedSpace1:21;
      uint64_t LK1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  uint8_t res0[236];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NDID:8;
      uint64_t NMSTR:8;
      uint64_t NMRC:8;
      uint64_t NPAC:4;
      uint64_t MID:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWCFG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DID:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWCFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PIDP0:1;
      uint64_t PIDP1:1;
      uint64_t PIDP2:1;
      uint64_t PIDP3:1;
      uint64_t PIDP4:1;
      uint64_t PIDP5:1;
      uint64_t PIDP6:1;
      uint64_t PIDP7:1;
      uint64_t PIDP8:1;
      uint64_t PIDP9:1;
      uint64_t PIDP10:1;
      uint64_t PIDP11:1;
      uint64_t PIDP12:1;
      uint64_t PIDP13:1;
      uint64_t PIDP14:1;
      uint64_t PIDP15:1;
      uint64_t PIDP16:1;
      uint64_t PIDP17:1;
      uint64_t PIDP18:1;
      uint64_t PIDP19:1;
      uint64_t PIDP20:1;
      uint64_t PIDP21:1;
      uint64_t PIDP22:1;
      uint64_t PIDP23:1;
      uint64_t PIDP24:1;
      uint64_t PIDP25:1;
      uint64_t PIDP26:1;
      uint64_t PIDP27:1;
      uint64_t PIDP28:1;
      uint64_t PIDP29:1;
      uint64_t PIDP30:1;
      uint64_t PIDP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWCFG2;

  uint8_t res1[4];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t NMDAR:4;
      uint64_t reservedSpace0:3;
      uint64_t NCM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MDACFG0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t NMDAR:4;
      uint64_t reservedSpace0:3;
      uint64_t NCM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MDACFG1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t NMDAR:4;
      uint64_t reservedSpace0:3;
      uint64_t NCM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MDACFG2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t NMDAR:4;
      uint64_t reservedSpace0:3;
      uint64_t NCM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MDACFG3;

  uint8_t res2[1];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t NMDAR:4;
      uint64_t reservedSpace0:3;
      uint64_t NCM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MDACFG5;

  uint8_t res3[58];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t NMRGD:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MRCFG0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t NMRGD:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MRCFG1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t NMRGD:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MRCFG2;

  uint8_t res4[189];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MRCINST:16;
      uint64_t PACINST:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DERRLOC_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MRCINST:16;
      uint64_t PACINST:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DERRLOC_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MRCINST:16;
      uint64_t PACINST:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DERRLOC_2;

  uint8_t res5[500];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DERR_W0_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EDID:4;
      uint64_t reservedSpace0:4;
      uint64_t EATR:3;
      uint64_t ERW:1;
      uint64_t reservedSpace1:12;
      uint64_t EPORT:3;
      uint64_t reservedSpace2:3;
      uint64_t EST:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DERR_W1_0;

