iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
  uint8_t res49[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t SRTADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W0_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t ENDADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W1_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D0ACP:3;
      uint64_t D1ACP:3;
      uint64_t D2ACP:3;
      uint64_t reservedSpace0:15;
      uint64_t SNUM:4;
      uint64_t reservedSpace1:2;
      uint64_t SE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W2_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:29;
      uint64_t LK2:2;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W3_2;

  uint8_t res50[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t SRTADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W0_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t ENDADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W1_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D0ACP:3;
      uint64_t D1ACP:3;
      uint64_t D2ACP:3;
      uint64_t reservedSpace0:15;
      uint64_t SNUM:4;
      uint64_t reservedSpace1:2;
      uint64_t SE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W2_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:29;
      uint64_t LK2:2;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W3_3;

  uint8_t res51[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t SRTADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W0_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t ENDADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W1_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D0ACP:3;
      uint64_t D1ACP:3;
      uint64_t D2ACP:3;
      uint64_t reservedSpace0:15;
      uint64_t SNUM:4;
      uint64_t reservedSpace1:2;
      uint64_t SE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W2_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:29;
      uint64_t LK2:2;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W3_4;

  uint8_t res52[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t SRTADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W0_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t ENDADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W1_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D0ACP:3;
      uint64_t D1ACP:3;
      uint64_t D2ACP:3;
      uint64_t reservedSpace0:15;
      uint64_t SNUM:4;
      uint64_t reservedSpace1:2;
      uint64_t SE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W2_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:29;
      uint64_t LK2:2;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W3_5;

  uint8_t res53[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t SRTADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W0_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t ENDADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W1_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D0ACP:3;
      uint64_t D1ACP:3;
      uint64_t D2ACP:3;
      uint64_t reservedSpace0:15;
      uint64_t SNUM:4;
      uint64_t reservedSpace1:2;
      uint64_t SE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W2_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:29;
      uint64_t LK2:2;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W3_6;

  uint8_t res54[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t SRTADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W0_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t ENDADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W1_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D0ACP:3;
      uint64_t D1ACP:3;
      uint64_t D2ACP:3;
      uint64_t reservedSpace0:15;
      uint64_t SNUM:4;
      uint64_t reservedSpace1:2;
      uint64_t SE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W2_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:29;
      uint64_t LK2:2;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W3_7;

  uint8_t res55[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t SRTADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W0_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t ENDADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W1_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D0ACP:3;
      uint64_t D1ACP:3;
      uint64_t D2ACP:3;
      uint64_t reservedSpace0:15;
      uint64_t SNUM:4;
      uint64_t reservedSpace1:2;
      uint64_t SE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W2_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:29;
      uint64_t LK2:2;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W3_8;

  uint8_t res56[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t SRTADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W0_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t ENDADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W1_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D0ACP:3;
      uint64_t D1ACP:3;
      uint64_t D2ACP:3;
      uint64_t reservedSpace0:15;
      uint64_t SNUM:4;
      uint64_t reservedSpace1:2;
      uint64_t SE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W2_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:29;
      uint64_t LK2:2;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W3_9;

