iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
  uint8_t res66[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t SRTADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W0_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t ENDADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W1_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D0ACP:3;
      uint64_t D1ACP:3;
      uint64_t D2ACP:3;
      uint64_t reservedSpace0:15;
      uint64_t SNUM:4;
      uint64_t reservedSpace1:2;
      uint64_t SE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W2_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:29;
      uint64_t LK2:2;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W3_19;

  uint8_t res67[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t SRTADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W0_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t ENDADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W1_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D0ACP:3;
      uint64_t D1ACP:3;
      uint64_t D2ACP:3;
      uint64_t reservedSpace0:15;
      uint64_t SNUM:4;
      uint64_t reservedSpace1:2;
      uint64_t SE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W2_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:29;
      uint64_t LK2:2;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W3_20;

  uint8_t res68[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t SRTADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W0_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t ENDADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W1_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D0ACP:3;
      uint64_t D1ACP:3;
      uint64_t D2ACP:3;
      uint64_t reservedSpace0:15;
      uint64_t SNUM:4;
      uint64_t reservedSpace1:2;
      uint64_t SE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W2_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:29;
      uint64_t LK2:2;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W3_21;

  uint8_t res69[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t SRTADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W0_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t ENDADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W1_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D0ACP:3;
      uint64_t D1ACP:3;
      uint64_t D2ACP:3;
      uint64_t reservedSpace0:15;
      uint64_t SNUM:4;
      uint64_t reservedSpace1:2;
      uint64_t SE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W2_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:29;
      uint64_t LK2:2;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W3_22;

  uint8_t res70[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t SRTADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W0_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t ENDADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W1_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D0ACP:3;
      uint64_t D1ACP:3;
      uint64_t D2ACP:3;
      uint64_t reservedSpace0:15;
      uint64_t SNUM:4;
      uint64_t reservedSpace1:2;
      uint64_t SE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W2_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:29;
      uint64_t LK2:2;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W3_23;

  uint8_t res71[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t SRTADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W0_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t ENDADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W1_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D0ACP:3;
      uint64_t D1ACP:3;
      uint64_t D2ACP:3;
      uint64_t reservedSpace0:15;
      uint64_t SNUM:4;
      uint64_t reservedSpace1:2;
      uint64_t SE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W2_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:29;
      uint64_t LK2:2;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W3_24;

  uint8_t res72[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t SRTADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W0_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t ENDADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W1_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D0ACP:3;
      uint64_t D1ACP:3;
      uint64_t D2ACP:3;
      uint64_t reservedSpace0:15;
      uint64_t SNUM:4;
      uint64_t reservedSpace1:2;
      uint64_t SE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W2_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:29;
      uint64_t LK2:2;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W3_25;

  uint8_t res73[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t SRTADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W0_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t ENDADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W1_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D0ACP:3;
      uint64_t D1ACP:3;
      uint64_t D2ACP:3;
      uint64_t reservedSpace0:15;
      uint64_t SNUM:4;
      uint64_t reservedSpace1:2;
      uint64_t SE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W2_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:29;
      uint64_t LK2:2;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W3_26;

  uint8_t res74[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t SRTADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W0_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t ENDADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W1_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D0ACP:3;
      uint64_t D1ACP:3;
      uint64_t D2ACP:3;
      uint64_t reservedSpace0:15;
      uint64_t SNUM:4;
      uint64_t reservedSpace1:2;
      uint64_t SE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W2_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:29;
      uint64_t LK2:2;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W3_27;

  uint8_t res75[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t SRTADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W0_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t ENDADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W1_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D0ACP:3;
      uint64_t D1ACP:3;
      uint64_t D2ACP:3;
      uint64_t reservedSpace0:15;
      uint64_t SNUM:4;
      uint64_t reservedSpace1:2;
      uint64_t SE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W2_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:29;
      uint64_t LK2:2;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRGD_W3_28;

