iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
};

#define XRDC (*(volatile struct XRDC_tag *) 0x40278000)

struct INTM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTM_MM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRQ:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTM_IACK;

};

#define INTM (*(volatile struct INTM_tag *) 0x4027c000)

struct INTM_mon_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRQ:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTM_IRQSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LAT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTM_LATENCY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTM_TIMER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATUS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTM_STATUS;

};

#define INTM_mon_0 (*(volatile struct INTM_mon_0_tag *) 0x4027c008)

struct INTM_mon_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRQ:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTM_IRQSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LAT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTM_LATENCY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTM_TIMER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATUS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTM_STATUS;

};

#define INTM_mon_1 (*(volatile struct INTM_mon_1_tag *) 0x4027c018)

struct INTM_mon_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRQ:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTM_IRQSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LAT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTM_LATENCY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTM_TIMER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATUS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTM_STATUS;

};

#define INTM_mon_2 (*(volatile struct INTM_mon_2_tag *) 0x4027c028)

struct INTM_mon_3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRQ:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTM_IRQSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LAT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTM_LATENCY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTM_TIMER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATUS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTM_STATUS;

};

#define INTM_mon_3 (*(volatile struct INTM_mon_3_tag *) 0x4027c038)

struct DMAMUX_0_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHCFG3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHCFG2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHCFG1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHCFG0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHCFG7;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHCFG6;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHCFG5;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHCFG4;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHCFG11;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHCFG10;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHCFG9;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHCFG8;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHCFG15;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHCFG14;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHCFG13;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHCFG12;

