iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
};

#define MC_RGM (*(volatile struct MC_RGM_tag *) 0x4028c000)

struct SIUL2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MINOR_MASK:4;
      uint64_t MAJOR_MASK:4;
      uint64_t reservedSpace0:8;
      uint64_t PART_NO:10;
      uint64_t PRODUCT_LINE_LETTER:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_SIZE_CODE:8;
      uint64_t FLASH_SIZE_DATA:4;
      uint64_t FLASH_DATA:2;
      uint64_t FLASH_CODE:2;
      uint64_t FREQUENCY:4;
      uint64_t PACKAGE:6;
      uint64_t TEMPERATURE:3;
      uint64_t TECHNOLOGY:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIDR2;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIF0:1;
      uint64_t EIF1:1;
      uint64_t EIF2:1;
      uint64_t EIF3:1;
      uint64_t EIF4:1;
      uint64_t EIF5:1;
      uint64_t EIF6:1;
      uint64_t EIF7:1;
      uint64_t EIF8:1;
      uint64_t EIF9:1;
      uint64_t EIF10:1;
      uint64_t EIF11:1;
      uint64_t EIF12:1;
      uint64_t EIF13:1;
      uint64_t EIF14:1;
      uint64_t EIF15:1;
      uint64_t EIF16:1;
      uint64_t EIF17:1;
      uint64_t EIF18:1;
      uint64_t EIF19:1;
      uint64_t EIF20:1;
      uint64_t EIF21:1;
      uint64_t EIF22:1;
      uint64_t EIF23:1;
      uint64_t EIF24:1;
      uint64_t EIF25:1;
      uint64_t EIF26:1;
      uint64_t EIF27:1;
      uint64_t EIF28:1;
      uint64_t EIF29:1;
      uint64_t EIF30:1;
      uint64_t EIF31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DISR0;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIRE0:1;
      uint64_t EIRE1:1;
      uint64_t EIRE2:1;
      uint64_t EIRE3:1;
      uint64_t EIRE4:1;
      uint64_t EIRE5:1;
      uint64_t EIRE6:1;
      uint64_t EIRE7:1;
      uint64_t EIRE8:1;
      uint64_t EIRE9:1;
      uint64_t EIRE10:1;
      uint64_t EIRE11:1;
      uint64_t EIRE12:1;
      uint64_t EIRE13:1;
      uint64_t EIRE14:1;
      uint64_t EIRE15:1;
      uint64_t EIRE16:1;
      uint64_t EIRE17:1;
      uint64_t EIRE18:1;
      uint64_t EIRE19:1;
      uint64_t EIRE20:1;
      uint64_t EIRE21:1;
      uint64_t EIRE22:1;
      uint64_t EIRE23:1;
      uint64_t EIRE24:1;
      uint64_t EIRE25:1;
      uint64_t EIRE26:1;
      uint64_t EIRE27:1;
      uint64_t EIRE28:1;
      uint64_t EIRE29:1;
      uint64_t EIRE30:1;
      uint64_t EIRE31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRER0;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRSR0:1;
      uint64_t DIRSR1:1;
      uint64_t DIRSR2:1;
      uint64_t DIRSR3:1;
      uint64_t DIRSR4:1;
      uint64_t DIRSR5:1;
      uint64_t DIRSR6:1;
      uint64_t DIRSR7:1;
      uint64_t DIRSR8:1;
      uint64_t DIRSR9:1;
      uint64_t DIRSR10:1;
      uint64_t DIRSR11:1;
      uint64_t DIRSR12:1;
      uint64_t DIRSR13:1;
      uint64_t DIRSR14:1;
      uint64_t DIRSR15:1;
      uint64_t DIRSR16:1;
      uint64_t DIRSR17:1;
      uint64_t DIRSR18:1;
      uint64_t DIRSR19:1;
      uint64_t DIRSR20:1;
      uint64_t DIRSR21:1;
      uint64_t DIRSR22:1;
      uint64_t DIRSR23:1;
      uint64_t DIRSR24:1;
      uint64_t DIRSR25:1;
      uint64_t DIRSR26:1;
      uint64_t DIRSR27:1;
      uint64_t DIRSR28:1;
      uint64_t DIRSR29:1;
      uint64_t DIRSR30:1;
      uint64_t DIRSR31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRSR0;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IREE0:1;
      uint64_t IREE1:1;
      uint64_t IREE2:1;
      uint64_t IREE3:1;
      uint64_t IREE4:1;
      uint64_t IREE5:1;
      uint64_t IREE6:1;
      uint64_t IREE7:1;
      uint64_t IREE8:1;
      uint64_t IREE9:1;
      uint64_t IREE10:1;
      uint64_t IREE11:1;
      uint64_t IREE12:1;
      uint64_t IREE13:1;
      uint64_t IREE14:1;
      uint64_t IREE15:1;
      uint64_t IREE16:1;
      uint64_t IREE17:1;
      uint64_t IREE18:1;
      uint64_t IREE19:1;
      uint64_t IREE20:1;
      uint64_t IREE21:1;
      uint64_t IREE22:1;
      uint64_t IREE23:1;
      uint64_t IREE24:1;
      uint64_t IREE25:1;
      uint64_t IREE26:1;
      uint64_t IREE27:1;
      uint64_t IREE28:1;
      uint64_t IREE29:1;
      uint64_t IREE30:1;
      uint64_t IREE31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IREER0;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IFEE0:1;
      uint64_t IFEE1:1;
      uint64_t IFEE2:1;
      uint64_t IFEE3:1;
      uint64_t IFEE4:1;
      uint64_t IFEE5:1;
      uint64_t IFEE6:1;
      uint64_t IFEE7:1;
      uint64_t IFEE8:1;
      uint64_t IFEE9:1;
      uint64_t IFEE10:1;
      uint64_t IFEE11:1;
      uint64_t IFEE12:1;
      uint64_t IFEE13:1;
      uint64_t IFEE14:1;
      uint64_t IFEE15:1;
      uint64_t IFEE16:1;
      uint64_t IFEE17:1;
      uint64_t IFEE18:1;
      uint64_t IFEE19:1;
      uint64_t IFEE20:1;
      uint64_t IFEE21:1;
      uint64_t IFEE22:1;
      uint64_t IFEE23:1;
      uint64_t IFEE24:1;
      uint64_t IFEE25:1;
      uint64_t IFEE26:1;
      uint64_t IFEE27:1;
      uint64_t IFEE28:1;
      uint64_t IFEE29:1;
      uint64_t IFEE30:1;
      uint64_t IFEE31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFEER0;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IFE0:1;
      uint64_t IFE1:1;
      uint64_t IFE2:1;
      uint64_t IFE3:1;
      uint64_t IFE4:1;
      uint64_t IFE5:1;
      uint64_t IFE6:1;
      uint64_t IFE7:1;
      uint64_t IFE8:1;
      uint64_t IFE9:1;
      uint64_t IFE10:1;
      uint64_t IFE11:1;
      uint64_t IFE12:1;
      uint64_t IFE13:1;
      uint64_t IFE14:1;
      uint64_t IFE15:1;
      uint64_t IFE16:1;
      uint64_t IFE17:1;
      uint64_t IFE18:1;
      uint64_t IFE19:1;
      uint64_t IFE20:1;
      uint64_t IFE21:1;
      uint64_t IFE22:1;
      uint64_t IFE23:1;
      uint64_t IFE24:1;
      uint64_t IFE25:1;
      uint64_t IFE26:1;
      uint64_t IFE27:1;
      uint64_t IFE28:1;
      uint64_t IFE29:1;
      uint64_t IFE30:1;
      uint64_t IFE31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFER0;

