iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IFCP:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFCPR;

  uint8_t res7[316];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYS_RAM_SIZE:6;
      uint64_t reservedSpace0:4;
      uint64_t PART_NO_SUF:6;
      uint64_t PROD_FAM_NO:10;
      uint64_t PROD_FAM_LET:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIDR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CORE_PLAT_FET:3;
      uint64_t EMAC_FET:2;
      uint64_t SEC_FET:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIDR4;

  uint8_t res8[56];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR28;

