iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR32;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR33;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR35;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR36;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR37;

  uint8_t res9[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR40;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR41;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR42;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR43;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR44;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR45;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR46;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR47;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR48;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR49;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR50;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR51;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR52;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR53;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR54;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR55;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR56;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR57;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR58;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR59;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR60;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR61;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR62;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR63;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR64;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR65;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR66;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR67;

