iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR68;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR69;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR70;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR71;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR72;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR73;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR74;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR75;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR76;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR77;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR78;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR79;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR80;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR81;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR82;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR83;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR84;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR85;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR86;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR87;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR88;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR89;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR90;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR91;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR92;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR93;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR94;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR95;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR96;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR97;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR98;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR99;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR100;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR101;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR102;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR103;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR104;

