iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR142;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR143;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR144;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR145;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR146;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR147;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR148;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR149;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR150;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR151;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR152;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR153;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR154;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR155;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR156;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR157;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR158;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR159;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR160;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR161;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR162;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR163;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR164;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR165;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR166;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR167;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR168;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR169;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR170;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR171;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR172;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR173;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR174;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR175;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR176;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR177;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS_0:1;
      uint64_t SSS_1:1;
      uint64_t SSS_2:1;
      uint64_t reservedSpace0:2;
      uint64_t SMC:1;
      uint64_t IFE:1;
      uint64_t reservedSpace1:1;
      uint64_t DSE:1;
      uint64_t reservedSpace2:2;
      uint64_t PUS:1;
      uint64_t reservedSpace3:1;
      uint64_t PUE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace4:1;
      uint64_t PKE:1;
      uint64_t INV:1;
      uint64_t reservedSpace5:1;
      uint64_t IBE:1;
      uint64_t reservedSpace6:1;
      uint64_t OBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR178;

