iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR186;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR187;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR188;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR189;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR190;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR191;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR192;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR193;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR194;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR195;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR196;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR197;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR198;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR199;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR200;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR201;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR202;

  uint8_t res16[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR211;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR212;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR213;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR214;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR215;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR216;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR217;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR218;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR219;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR220;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR221;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR222;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR223;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR224;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR225;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR226;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR227;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR228;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR229;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR230;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR231;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR232;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR233;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR234;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR235;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR236;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR237;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR238;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR239;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR240;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR241;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR242;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR243;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR244;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR245;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR246;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR247;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR248;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR249;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR250;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR251;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR252;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR253;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR254;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR255;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR256;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR257;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR258;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR259;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR260;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR261;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR262;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR263;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR264;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR265;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR266;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR267;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR268;

  uint8_t res17[80];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR289;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR290;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR291;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR292;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR293;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR294;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR295;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR296;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR297;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR298;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR299;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR300;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR301;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR302;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR303;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR304;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR305;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR306;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR307;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR308;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR309;

  uint8_t res18[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR315;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR316;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR317;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR318;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR319;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR320;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR321;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR322;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR323;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR324;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR325;

