iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
  uint8_t res19[68];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR343;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR344;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR345;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR346;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR347;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR348;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR349;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR350;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR351;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR352;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR353;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR354;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR355;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR356;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR357;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR358;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR359;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR360;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR361;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR362;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR363;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR364;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR365;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR366;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR367;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR368;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR369;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR370;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR371;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR372;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR373;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR374;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR375;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR376;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR377;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR378;

  uint8_t res20[724];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO7;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO6;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO5;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO4;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO11;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO10;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO9;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO8;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO15;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO14;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO13;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO12;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO19;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO18;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO17;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO16;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO23;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO22;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO21;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO20;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO27;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO26;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO25;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO24;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO31;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO30;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO29;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO28;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO35;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO34;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO33;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO32;

  uint8_t res21[2];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO37;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO36;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO43;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO42;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO41;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO40;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO47;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO46;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO45;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO44;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO51;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO50;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO49;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO48;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO55;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO54;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO53;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO52;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO59;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO58;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO57;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO56;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO63;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO62;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO61;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO60;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO67;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO66;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO65;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO64;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO71;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO70;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO69;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO68;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO75;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO74;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO73;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO72;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO79;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO78;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO77;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO76;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO83;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO82;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO81;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO80;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO87;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO86;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO85;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO84;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO91;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO90;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO89;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO88;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO95;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO94;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO93;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO92;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO99;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO98;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO97;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO96;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO103;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO102;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO101;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO100;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO107;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO106;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO105;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO104;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO111;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO110;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO109;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO108;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO115;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO114;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO113;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO112;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO119;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO118;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO117;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO116;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO123;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO122;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO121;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO120;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO127;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO126;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO125;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO124;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO131;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO130;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO129;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO128;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO135;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO134;

