iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO133;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO132;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO139;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO138;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO137;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO136;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO143;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO142;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO141;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO140;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO147;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO146;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO145;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO144;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO151;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO150;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO149;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO148;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO155;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO154;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO153;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO152;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO159;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO158;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO157;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO156;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO163;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO162;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO161;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO160;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO167;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO166;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO165;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO164;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO171;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO170;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO169;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO168;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO175;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO174;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO173;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO172;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO179;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO178;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO177;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO176;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO183;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO182;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO181;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO180;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO187;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO186;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO185;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO184;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO191;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO190;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO189;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO188;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO195;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO194;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO193;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO192;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO199;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO198;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO197;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO196;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO203;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO202;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO201;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO200;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO207;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO206;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO205;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO204;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO211;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO210;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO209;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO208;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO215;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO214;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO213;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO212;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO219;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO218;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO217;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO216;

