iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
  uint8_t res22[292];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI7;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI6;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI5;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI4;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI11;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI10;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI9;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI8;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI15;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI14;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI13;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI12;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI19;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI18;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI17;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI16;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI23;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI22;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI21;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI20;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI27;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI26;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI25;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI24;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI31;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI30;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI29;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI28;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI35;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI34;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI33;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI32;

  uint8_t res23[2];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI37;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI36;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI43;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI42;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI41;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI40;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI47;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI46;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI45;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI44;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI51;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI50;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI49;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI48;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI55;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI54;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI53;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI52;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI59;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI58;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI57;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI56;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI63;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI62;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI61;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI60;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI67;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI66;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI65;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI64;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI71;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI70;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI69;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI68;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI75;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI74;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI73;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI72;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI79;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI78;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI77;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI76;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI83;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI82;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI81;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI80;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI87;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI86;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI85;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI84;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI91;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI90;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI89;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI88;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI95;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI94;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI93;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI92;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI99;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI98;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI97;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI96;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI103;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI102;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI101;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI100;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI107;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI106;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI105;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI104;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI111;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI110;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI109;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI108;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI115;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI114;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI113;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI112;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI119;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI118;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI117;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI116;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI123;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI122;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI121;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI120;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI127;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI126;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI125;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI124;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI131;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI130;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI129;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI128;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI135;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI134;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI133;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI132;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI139;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI138;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI137;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI136;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI143;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI142;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI141;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI140;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI147;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI146;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI145;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI144;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI151;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI150;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI149;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI148;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI155;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI154;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI153;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI152;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI159;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI158;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI157;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI156;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI163;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI162;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI161;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI160;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI167;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI166;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI165;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI164;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI171;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI170;

