iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI169;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI168;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI175;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI174;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI173;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI172;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI179;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI178;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI177;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI176;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI183;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI182;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI181;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI180;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI187;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI186;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI185;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI184;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI191;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI190;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI189;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI188;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI195;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI194;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI193;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI192;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI199;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI198;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI197;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI196;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI203;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI202;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI201;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI200;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI207;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI206;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI205;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI204;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI211;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI210;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI209;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI208;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI215;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI214;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI213;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI212;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI219;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI218;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI217;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI216;

  uint8_t res24[292];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDO0:1;
      uint64_t PPDO1:1;
      uint64_t PPDO2:1;
      uint64_t PPDO3:1;
      uint64_t PPDO4:1;
      uint64_t PPDO5:1;
      uint64_t PPDO6:1;
      uint64_t PPDO7:1;
      uint64_t PPDO8:1;
      uint64_t PPDO9:1;
      uint64_t PPDO10:1;
      uint64_t PPDO11:1;
      uint64_t PPDO12:1;
      uint64_t PPDO13:1;
      uint64_t PPDO14:1;
      uint64_t PPDO15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDO1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDO0:1;
      uint64_t PPDO1:1;
      uint64_t PPDO2:1;
      uint64_t PPDO3:1;
      uint64_t PPDO4:1;
      uint64_t PPDO5:1;
      uint64_t PPDO6:1;
      uint64_t PPDO7:1;
      uint64_t PPDO8:1;
      uint64_t PPDO9:1;
      uint64_t PPDO10:1;
      uint64_t PPDO11:1;
      uint64_t PPDO12:1;
      uint64_t PPDO13:1;
      uint64_t PPDO14:1;
      uint64_t PPDO15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDO0;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDO0:1;
      uint64_t PPDO1:1;
      uint64_t PPDO2:1;
      uint64_t PPDO3:1;
      uint64_t PPDO4:1;
      uint64_t PPDO5:1;
      uint64_t PPDO6:1;
      uint64_t PPDO7:1;
      uint64_t PPDO8:1;
      uint64_t PPDO9:1;
      uint64_t PPDO10:1;
      uint64_t PPDO11:1;
      uint64_t PPDO12:1;
      uint64_t PPDO13:1;
      uint64_t PPDO14:1;
      uint64_t PPDO15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDO3;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDO0:1;
      uint64_t PPDO1:1;
      uint64_t PPDO2:1;
      uint64_t PPDO3:1;
      uint64_t PPDO4:1;
      uint64_t PPDO5:1;
      uint64_t PPDO6:1;
      uint64_t PPDO7:1;
      uint64_t reservedSpace0:2;
      uint64_t PPDO10:1;
      uint64_t PPDO11:1;
      uint64_t PPDO12:1;
      uint64_t PPDO13:1;
      uint64_t PPDO14:1;
      uint64_t PPDO15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDO2;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDO0:1;
      uint64_t PPDO1:1;
      uint64_t PPDO2:1;
      uint64_t PPDO3:1;
      uint64_t PPDO4:1;
      uint64_t PPDO5:1;
      uint64_t PPDO6:1;
      uint64_t PPDO7:1;
      uint64_t PPDO8:1;
      uint64_t PPDO9:1;
      uint64_t PPDO10:1;
      uint64_t PPDO11:1;
      uint64_t PPDO12:1;
      uint64_t PPDO13:1;
      uint64_t PPDO14:1;
      uint64_t PPDO15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDO5;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDO0:1;
      uint64_t PPDO1:1;
      uint64_t PPDO2:1;
      uint64_t PPDO3:1;
      uint64_t PPDO4:1;
      uint64_t PPDO5:1;
      uint64_t PPDO6:1;
      uint64_t PPDO7:1;
      uint64_t PPDO8:1;
      uint64_t PPDO9:1;
      uint64_t PPDO10:1;
      uint64_t PPDO11:1;
      uint64_t PPDO12:1;
      uint64_t PPDO13:1;
      uint64_t PPDO14:1;
      uint64_t PPDO15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDO4;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDO0:1;
      uint64_t PPDO1:1;
      uint64_t PPDO2:1;
      uint64_t PPDO3:1;
      uint64_t PPDO4:1;
      uint64_t PPDO5:1;
      uint64_t PPDO6:1;
      uint64_t PPDO7:1;
      uint64_t PPDO8:1;
      uint64_t PPDO9:1;
      uint64_t PPDO10:1;
      uint64_t PPDO11:1;
      uint64_t PPDO12:1;
      uint64_t PPDO13:1;
      uint64_t PPDO14:1;
      uint64_t PPDO15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDO7;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDO0:1;
      uint64_t PPDO1:1;
      uint64_t PPDO2:1;
      uint64_t PPDO3:1;
      uint64_t PPDO4:1;
      uint64_t PPDO5:1;
      uint64_t PPDO6:1;
      uint64_t PPDO7:1;
      uint64_t PPDO8:1;
      uint64_t PPDO9:1;
      uint64_t PPDO10:1;
      uint64_t PPDO11:1;
      uint64_t PPDO12:1;
      uint64_t PPDO13:1;
      uint64_t PPDO14:1;
      uint64_t PPDO15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDO6;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDO0:1;
      uint64_t PPDO1:1;
      uint64_t PPDO2:1;
      uint64_t PPDO3:1;
      uint64_t PPDO4:1;
      uint64_t PPDO5:1;
      uint64_t PPDO6:1;
      uint64_t PPDO7:1;
      uint64_t PPDO8:1;
      uint64_t PPDO9:1;
      uint64_t PPDO10:1;
      uint64_t PPDO11:1;
      uint64_t PPDO12:1;
      uint64_t PPDO13:1;
      uint64_t PPDO14:1;
      uint64_t PPDO15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDO9;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDO0:1;
      uint64_t PPDO1:1;
      uint64_t PPDO2:1;
      uint64_t PPDO3:1;
      uint64_t PPDO4:1;
      uint64_t PPDO5:1;
      uint64_t PPDO6:1;
      uint64_t PPDO7:1;
      uint64_t PPDO8:1;
      uint64_t PPDO9:1;
      uint64_t PPDO10:1;
      uint64_t PPDO11:1;
      uint64_t PPDO12:1;
      uint64_t PPDO13:1;
      uint64_t PPDO14:1;
      uint64_t PPDO15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDO8;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDO0:1;
      uint64_t PPDO1:1;
      uint64_t PPDO2:1;
      uint64_t PPDO3:1;
      uint64_t PPDO4:1;
      uint64_t PPDO5:1;
      uint64_t PPDO6:1;
      uint64_t PPDO7:1;
      uint64_t PPDO8:1;
      uint64_t PPDO9:1;
      uint64_t PPDO10:1;
      uint64_t PPDO11:1;
      uint64_t PPDO12:1;
      uint64_t PPDO13:1;
      uint64_t PPDO14:1;
      uint64_t PPDO15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDO11;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDO0:1;
      uint64_t PPDO1:1;
      uint64_t PPDO2:1;
      uint64_t PPDO3:1;
      uint64_t PPDO4:1;
      uint64_t PPDO5:1;
      uint64_t PPDO6:1;
      uint64_t PPDO7:1;
      uint64_t PPDO8:1;
      uint64_t PPDO9:1;
      uint64_t PPDO10:1;
      uint64_t PPDO11:1;
      uint64_t PPDO12:1;
      uint64_t PPDO13:1;
      uint64_t PPDO14:1;
      uint64_t PPDO15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDO10;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t PPDO4:1;
      uint64_t PPDO5:1;
      uint64_t PPDO6:1;
      uint64_t PPDO7:1;
      uint64_t PPDO8:1;
      uint64_t PPDO9:1;
      uint64_t PPDO10:1;
      uint64_t PPDO11:1;
      uint64_t PPDO12:1;
      uint64_t PPDO13:1;
      uint64_t PPDO14:1;
      uint64_t PPDO15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDO13;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDO0:1;
      uint64_t PPDO1:1;
      uint64_t PPDO2:1;
      uint64_t PPDO3:1;
      uint64_t PPDO4:1;
      uint64_t PPDO5:1;
      uint64_t PPDO6:1;
      uint64_t PPDO7:1;
      uint64_t PPDO8:1;
      uint64_t PPDO9:1;
      uint64_t PPDO10:1;
      uint64_t PPDO11:1;
      uint64_t PPDO12:1;
      uint64_t PPDO13:1;
      uint64_t PPDO14:1;
      uint64_t PPDO15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDO12;

  uint8_t res25[36];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDI0:1;
      uint64_t PPDI1:1;
      uint64_t PPDI2:1;
      uint64_t PPDI3:1;
      uint64_t PPDI4:1;
      uint64_t PPDI5:1;
      uint64_t PPDI6:1;
      uint64_t PPDI7:1;
      uint64_t PPDI8:1;
      uint64_t PPDI9:1;
      uint64_t PPDI10:1;
      uint64_t PPDI11:1;
      uint64_t PPDI12:1;
      uint64_t PPDI13:1;
      uint64_t PPDI14:1;
      uint64_t PPDI15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDI1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDI0:1;
      uint64_t PPDI1:1;
      uint64_t PPDI2:1;
      uint64_t PPDI3:1;
      uint64_t PPDI4:1;
      uint64_t PPDI5:1;
      uint64_t PPDI6:1;
      uint64_t PPDI7:1;
      uint64_t PPDI8:1;
      uint64_t PPDI9:1;
      uint64_t PPDI10:1;
      uint64_t PPDI11:1;
      uint64_t PPDI12:1;
      uint64_t PPDI13:1;
      uint64_t PPDI14:1;
      uint64_t PPDI15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDI0;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDI0:1;
      uint64_t PPDI1:1;
      uint64_t PPDI2:1;
      uint64_t PPDI3:1;
      uint64_t PPDI4:1;
      uint64_t PPDI5:1;
      uint64_t PPDI6:1;
      uint64_t PPDI7:1;
      uint64_t PPDI8:1;
      uint64_t PPDI9:1;
      uint64_t PPDI10:1;
      uint64_t PPDI11:1;
      uint64_t PPDI12:1;
      uint64_t PPDI13:1;
      uint64_t PPDI14:1;
      uint64_t PPDI15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDI3;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDI0:1;
      uint64_t PPDI1:1;
      uint64_t PPDI2:1;
      uint64_t PPDI3:1;
      uint64_t PPDI4:1;
      uint64_t PPDI5:1;
      uint64_t PPDI6:1;
      uint64_t PPDI7:1;
      uint64_t reservedSpace0:2;
      uint64_t PPDI10:1;
      uint64_t PPDI11:1;
      uint64_t PPDI12:1;
      uint64_t PPDI13:1;
      uint64_t PPDI14:1;
      uint64_t PPDI15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDI2;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDI0:1;
      uint64_t PPDI1:1;
      uint64_t PPDI2:1;
      uint64_t PPDI3:1;
      uint64_t PPDI4:1;
      uint64_t PPDI5:1;
      uint64_t PPDI6:1;
      uint64_t PPDI7:1;
      uint64_t PPDI8:1;
      uint64_t PPDI9:1;
      uint64_t PPDI10:1;
      uint64_t PPDI11:1;
      uint64_t PPDI12:1;
      uint64_t PPDI13:1;
      uint64_t PPDI14:1;
      uint64_t PPDI15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDI5;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDI0:1;
      uint64_t PPDI1:1;
      uint64_t PPDI2:1;
      uint64_t PPDI3:1;
      uint64_t PPDI4:1;
      uint64_t PPDI5:1;
      uint64_t PPDI6:1;
      uint64_t PPDI7:1;
      uint64_t PPDI8:1;
      uint64_t PPDI9:1;
      uint64_t PPDI10:1;
      uint64_t PPDI11:1;
      uint64_t PPDI12:1;
      uint64_t PPDI13:1;
      uint64_t PPDI14:1;
      uint64_t PPDI15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDI4;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDI0:1;
      uint64_t PPDI1:1;
      uint64_t PPDI2:1;
      uint64_t PPDI3:1;
      uint64_t PPDI4:1;
      uint64_t PPDI5:1;
      uint64_t PPDI6:1;
      uint64_t PPDI7:1;
      uint64_t PPDI8:1;
      uint64_t PPDI9:1;
      uint64_t PPDI10:1;
      uint64_t PPDI11:1;
      uint64_t PPDI12:1;
      uint64_t PPDI13:1;
      uint64_t PPDI14:1;
      uint64_t PPDI15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDI7;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDI0:1;
      uint64_t PPDI1:1;
      uint64_t PPDI2:1;
      uint64_t PPDI3:1;
      uint64_t PPDI4:1;
      uint64_t PPDI5:1;
      uint64_t PPDI6:1;
      uint64_t PPDI7:1;
      uint64_t PPDI8:1;
      uint64_t PPDI9:1;
      uint64_t PPDI10:1;
      uint64_t PPDI11:1;
      uint64_t PPDI12:1;
      uint64_t PPDI13:1;
      uint64_t PPDI14:1;
      uint64_t PPDI15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDI6;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDI0:1;
      uint64_t PPDI1:1;
      uint64_t PPDI2:1;
      uint64_t PPDI3:1;
      uint64_t PPDI4:1;
      uint64_t PPDI5:1;
      uint64_t PPDI6:1;
      uint64_t PPDI7:1;
      uint64_t PPDI8:1;
      uint64_t PPDI9:1;
      uint64_t PPDI10:1;
      uint64_t PPDI11:1;
      uint64_t PPDI12:1;
      uint64_t PPDI13:1;
      uint64_t PPDI14:1;
      uint64_t PPDI15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDI9;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDI0:1;
      uint64_t PPDI1:1;
      uint64_t PPDI2:1;
      uint64_t PPDI3:1;
      uint64_t PPDI4:1;
      uint64_t PPDI5:1;
      uint64_t PPDI6:1;
      uint64_t PPDI7:1;
      uint64_t PPDI8:1;
      uint64_t PPDI9:1;
      uint64_t PPDI10:1;
      uint64_t PPDI11:1;
      uint64_t PPDI12:1;
      uint64_t PPDI13:1;
      uint64_t PPDI14:1;
      uint64_t PPDI15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDI8;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDI0:1;
      uint64_t PPDI1:1;
      uint64_t PPDI2:1;
      uint64_t PPDI3:1;
      uint64_t PPDI4:1;
      uint64_t PPDI5:1;
      uint64_t PPDI6:1;
      uint64_t PPDI7:1;
      uint64_t PPDI8:1;
      uint64_t PPDI9:1;
      uint64_t PPDI10:1;
      uint64_t PPDI11:1;
      uint64_t PPDI12:1;
      uint64_t PPDI13:1;
      uint64_t PPDI14:1;
      uint64_t PPDI15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDI11;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDI0:1;
      uint64_t PPDI1:1;
      uint64_t PPDI2:1;
      uint64_t PPDI3:1;
      uint64_t PPDI4:1;
      uint64_t PPDI5:1;
      uint64_t PPDI6:1;
      uint64_t PPDI7:1;
      uint64_t PPDI8:1;
      uint64_t PPDI9:1;
      uint64_t PPDI10:1;
      uint64_t PPDI11:1;
      uint64_t PPDI12:1;
      uint64_t PPDI13:1;
      uint64_t PPDI14:1;
      uint64_t PPDI15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDI10;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t PPDI4:1;
      uint64_t PPDI5:1;
      uint64_t PPDI6:1;
      uint64_t PPDI7:1;
      uint64_t PPDI8:1;
      uint64_t PPDI9:1;
      uint64_t PPDI10:1;
      uint64_t PPDI11:1;
      uint64_t PPDI12:1;
      uint64_t PPDI13:1;
      uint64_t PPDI14:1;
      uint64_t PPDI15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDI13;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDI0:1;
      uint64_t PPDI1:1;
      uint64_t PPDI2:1;
      uint64_t PPDI3:1;
      uint64_t PPDI4:1;
      uint64_t PPDI5:1;
      uint64_t PPDI6:1;
      uint64_t PPDI7:1;
      uint64_t PPDI8:1;
      uint64_t PPDI9:1;
      uint64_t PPDI10:1;
      uint64_t PPDI11:1;
      uint64_t PPDI12:1;
      uint64_t PPDI13:1;
      uint64_t PPDI14:1;
      uint64_t PPDI15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDI12;

