iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
  uint8_t res26[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO0:1;
      uint64_t MPPDO1:1;
      uint64_t MPPDO2:1;
      uint64_t MPPDO3:1;
      uint64_t MPPDO4:1;
      uint64_t MPPDO5:1;
      uint64_t MPPDO6:1;
      uint64_t MPPDO7:1;
      uint64_t MPPDO8:1;
      uint64_t MPPDO9:1;
      uint64_t MPPDO10:1;
      uint64_t MPPDO11:1;
      uint64_t MPPDO12:1;
      uint64_t MPPDO13:1;
      uint64_t MPPDO14:1;
      uint64_t MPPDO15:1;
      uint64_t MASK0:1;
      uint64_t MASK1:1;
      uint64_t MASK2:1;
      uint64_t MASK3:1;
      uint64_t MASK4:1;
      uint64_t MASK5:1;
      uint64_t MASK6:1;
      uint64_t MASK7:1;
      uint64_t MASK8:1;
      uint64_t MASK9:1;
      uint64_t MASK10:1;
      uint64_t MASK11:1;
      uint64_t MASK12:1;
      uint64_t MASK13:1;
      uint64_t MASK14:1;
      uint64_t MASK15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO0:1;
      uint64_t MPPDO1:1;
      uint64_t MPPDO2:1;
      uint64_t MPPDO3:1;
      uint64_t MPPDO4:1;
      uint64_t MPPDO5:1;
      uint64_t MPPDO6:1;
      uint64_t MPPDO7:1;
      uint64_t MPPDO8:1;
      uint64_t MPPDO9:1;
      uint64_t MPPDO10:1;
      uint64_t MPPDO11:1;
      uint64_t MPPDO12:1;
      uint64_t MPPDO13:1;
      uint64_t MPPDO14:1;
      uint64_t MPPDO15:1;
      uint64_t MASK0:1;
      uint64_t MASK1:1;
      uint64_t MASK2:1;
      uint64_t MASK3:1;
      uint64_t MASK4:1;
      uint64_t MASK5:1;
      uint64_t MASK6:1;
      uint64_t MASK7:1;
      uint64_t MASK8:1;
      uint64_t MASK9:1;
      uint64_t MASK10:1;
      uint64_t MASK11:1;
      uint64_t MASK12:1;
      uint64_t MASK13:1;
      uint64_t MASK14:1;
      uint64_t MASK15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO0:1;
      uint64_t MPPDO1:1;
      uint64_t MPPDO2:1;
      uint64_t MPPDO3:1;
      uint64_t MPPDO4:1;
      uint64_t MPPDO5:1;
      uint64_t MPPDO6:1;
      uint64_t MPPDO7:1;
      uint64_t reservedSpace0:2;
      uint64_t MPPDO10:1;
      uint64_t MPPDO11:1;
      uint64_t MPPDO12:1;
      uint64_t MPPDO13:1;
      uint64_t MPPDO14:1;
      uint64_t MPPDO15:1;
      uint64_t MASK0:1;
      uint64_t MASK1:1;
      uint64_t MASK2:1;
      uint64_t MASK3:1;
      uint64_t MASK4:1;
      uint64_t MASK5:1;
      uint64_t MASK6:1;
      uint64_t MASK7:1;
      uint64_t reservedSpace1:2;
      uint64_t MASK10:1;
      uint64_t MASK11:1;
      uint64_t MASK12:1;
      uint64_t MASK13:1;
      uint64_t MASK14:1;
      uint64_t MASK15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO0:1;
      uint64_t MPPDO1:1;
      uint64_t MPPDO2:1;
      uint64_t MPPDO3:1;
      uint64_t MPPDO4:1;
      uint64_t MPPDO5:1;
      uint64_t MPPDO6:1;
      uint64_t MPPDO7:1;
      uint64_t MPPDO8:1;
      uint64_t MPPDO9:1;
      uint64_t MPPDO10:1;
      uint64_t MPPDO11:1;
      uint64_t MPPDO12:1;
      uint64_t MPPDO13:1;
      uint64_t MPPDO14:1;
      uint64_t MPPDO15:1;
      uint64_t MASK0:1;
      uint64_t MASK1:1;
      uint64_t MASK2:1;
      uint64_t MASK3:1;
      uint64_t MASK4:1;
      uint64_t MASK5:1;
      uint64_t MASK6:1;
      uint64_t MASK7:1;
      uint64_t MASK8:1;
      uint64_t MASK9:1;
      uint64_t MASK10:1;
      uint64_t MASK11:1;
      uint64_t MASK12:1;
      uint64_t MASK13:1;
      uint64_t MASK14:1;
      uint64_t MASK15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO0:1;
      uint64_t MPPDO1:1;
      uint64_t MPPDO2:1;
      uint64_t MPPDO3:1;
      uint64_t MPPDO4:1;
      uint64_t MPPDO5:1;
      uint64_t MPPDO6:1;
      uint64_t MPPDO7:1;
      uint64_t MPPDO8:1;
      uint64_t MPPDO9:1;
      uint64_t MPPDO10:1;
      uint64_t MPPDO11:1;
      uint64_t MPPDO12:1;
      uint64_t MPPDO13:1;
      uint64_t MPPDO14:1;
      uint64_t MPPDO15:1;
      uint64_t MASK0:1;
      uint64_t MASK1:1;
      uint64_t MASK2:1;
      uint64_t MASK3:1;
      uint64_t MASK4:1;
      uint64_t MASK5:1;
      uint64_t MASK6:1;
      uint64_t MASK7:1;
      uint64_t MASK8:1;
      uint64_t MASK9:1;
      uint64_t MASK10:1;
      uint64_t MASK11:1;
      uint64_t MASK12:1;
      uint64_t MASK13:1;
      uint64_t MASK14:1;
      uint64_t MASK15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO0:1;
      uint64_t MPPDO1:1;
      uint64_t MPPDO2:1;
      uint64_t MPPDO3:1;
      uint64_t MPPDO4:1;
      uint64_t MPPDO5:1;
      uint64_t MPPDO6:1;
      uint64_t MPPDO7:1;
      uint64_t MPPDO8:1;
      uint64_t MPPDO9:1;
      uint64_t MPPDO10:1;
      uint64_t MPPDO11:1;
      uint64_t MPPDO12:1;
      uint64_t MPPDO13:1;
      uint64_t MPPDO14:1;
      uint64_t MPPDO15:1;
      uint64_t MASK0:1;
      uint64_t MASK1:1;
      uint64_t MASK2:1;
      uint64_t MASK3:1;
      uint64_t MASK4:1;
      uint64_t MASK5:1;
      uint64_t MASK6:1;
      uint64_t MASK7:1;
      uint64_t MASK8:1;
      uint64_t MASK9:1;
      uint64_t MASK10:1;
      uint64_t MASK11:1;
      uint64_t MASK12:1;
      uint64_t MASK13:1;
      uint64_t MASK14:1;
      uint64_t MASK15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO0:1;
      uint64_t MPPDO1:1;
      uint64_t MPPDO2:1;
      uint64_t MPPDO3:1;
      uint64_t MPPDO4:1;
      uint64_t MPPDO5:1;
      uint64_t MPPDO6:1;
      uint64_t MPPDO7:1;
      uint64_t MPPDO8:1;
      uint64_t MPPDO9:1;
      uint64_t MPPDO10:1;
      uint64_t MPPDO11:1;
      uint64_t MPPDO12:1;
      uint64_t MPPDO13:1;
      uint64_t MPPDO14:1;
      uint64_t MPPDO15:1;
      uint64_t MASK0:1;
      uint64_t MASK1:1;
      uint64_t MASK2:1;
      uint64_t MASK3:1;
      uint64_t MASK4:1;
      uint64_t MASK5:1;
      uint64_t MASK6:1;
      uint64_t MASK7:1;
      uint64_t MASK8:1;
      uint64_t MASK9:1;
      uint64_t MASK10:1;
      uint64_t MASK11:1;
      uint64_t MASK12:1;
      uint64_t MASK13:1;
      uint64_t MASK14:1;
      uint64_t MASK15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO0:1;
      uint64_t MPPDO1:1;
      uint64_t MPPDO2:1;
      uint64_t MPPDO3:1;
      uint64_t MPPDO4:1;
      uint64_t MPPDO5:1;
      uint64_t MPPDO6:1;
      uint64_t MPPDO7:1;
      uint64_t MPPDO8:1;
      uint64_t MPPDO9:1;
      uint64_t MPPDO10:1;
      uint64_t MPPDO11:1;
      uint64_t MPPDO12:1;
      uint64_t MPPDO13:1;
      uint64_t MPPDO14:1;
      uint64_t MPPDO15:1;
      uint64_t MASK0:1;
      uint64_t MASK1:1;
      uint64_t MASK2:1;
      uint64_t MASK3:1;
      uint64_t MASK4:1;
      uint64_t MASK5:1;
      uint64_t MASK6:1;
      uint64_t MASK7:1;
      uint64_t MASK8:1;
      uint64_t MASK9:1;
      uint64_t MASK10:1;
      uint64_t MASK11:1;
      uint64_t MASK12:1;
      uint64_t MASK13:1;
      uint64_t MASK14:1;
      uint64_t MASK15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO0:1;
      uint64_t MPPDO1:1;
      uint64_t MPPDO2:1;
      uint64_t MPPDO3:1;
      uint64_t MPPDO4:1;
      uint64_t MPPDO5:1;
      uint64_t MPPDO6:1;
      uint64_t MPPDO7:1;
      uint64_t MPPDO8:1;
      uint64_t MPPDO9:1;
      uint64_t MPPDO10:1;
      uint64_t MPPDO11:1;
      uint64_t MPPDO12:1;
      uint64_t MPPDO13:1;
      uint64_t MPPDO14:1;
      uint64_t MPPDO15:1;
      uint64_t MASK0:1;
      uint64_t MASK1:1;
      uint64_t MASK2:1;
      uint64_t MASK3:1;
      uint64_t MASK4:1;
      uint64_t MASK5:1;
      uint64_t MASK6:1;
      uint64_t MASK7:1;
      uint64_t MASK8:1;
      uint64_t MASK9:1;
      uint64_t MASK10:1;
      uint64_t MASK11:1;
      uint64_t MASK12:1;
      uint64_t MASK13:1;
      uint64_t MASK14:1;
      uint64_t MASK15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO0:1;
      uint64_t MPPDO1:1;
      uint64_t MPPDO2:1;
      uint64_t MPPDO3:1;
      uint64_t MPPDO4:1;
      uint64_t MPPDO5:1;
      uint64_t MPPDO6:1;
      uint64_t MPPDO7:1;
      uint64_t MPPDO8:1;
      uint64_t MPPDO9:1;
      uint64_t MPPDO10:1;
      uint64_t MPPDO11:1;
      uint64_t MPPDO12:1;
      uint64_t MPPDO13:1;
      uint64_t MPPDO14:1;
      uint64_t MPPDO15:1;
      uint64_t MASK0:1;
      uint64_t MASK1:1;
      uint64_t MASK2:1;
      uint64_t MASK3:1;
      uint64_t MASK4:1;
      uint64_t MASK5:1;
      uint64_t MASK6:1;
      uint64_t MASK7:1;
      uint64_t MASK8:1;
      uint64_t MASK9:1;
      uint64_t MASK10:1;
      uint64_t MASK11:1;
      uint64_t MASK12:1;
      uint64_t MASK13:1;
      uint64_t MASK14:1;
      uint64_t MASK15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO0:1;
      uint64_t MPPDO1:1;
      uint64_t MPPDO2:1;
      uint64_t MPPDO3:1;
      uint64_t MPPDO4:1;
      uint64_t MPPDO5:1;
      uint64_t MPPDO6:1;
      uint64_t MPPDO7:1;
      uint64_t MPPDO8:1;
      uint64_t MPPDO9:1;
      uint64_t MPPDO10:1;
      uint64_t MPPDO11:1;
      uint64_t MPPDO12:1;
      uint64_t MPPDO13:1;
      uint64_t MPPDO14:1;
      uint64_t MPPDO15:1;
      uint64_t MASK0:1;
      uint64_t MASK1:1;
      uint64_t MASK2:1;
      uint64_t MASK3:1;
      uint64_t MASK4:1;
      uint64_t MASK5:1;
      uint64_t MASK6:1;
      uint64_t MASK7:1;
      uint64_t MASK8:1;
      uint64_t MASK9:1;
      uint64_t MASK10:1;
      uint64_t MASK11:1;
      uint64_t MASK12:1;
      uint64_t MASK13:1;
      uint64_t MASK14:1;
      uint64_t MASK15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO0:1;
      uint64_t MPPDO1:1;
      uint64_t MPPDO2:1;
      uint64_t MPPDO3:1;
      uint64_t MPPDO4:1;
      uint64_t MPPDO5:1;
      uint64_t MPPDO6:1;
      uint64_t MPPDO7:1;
      uint64_t MPPDO8:1;
      uint64_t MPPDO9:1;
      uint64_t MPPDO10:1;
      uint64_t MPPDO11:1;
      uint64_t MPPDO12:1;
      uint64_t MPPDO13:1;
      uint64_t MPPDO14:1;
      uint64_t MPPDO15:1;
      uint64_t MASK0:1;
      uint64_t MASK1:1;
      uint64_t MASK2:1;
      uint64_t MASK3:1;
      uint64_t MASK4:1;
      uint64_t MASK5:1;
      uint64_t MASK6:1;
      uint64_t MASK7:1;
      uint64_t MASK8:1;
      uint64_t MASK9:1;
      uint64_t MASK10:1;
      uint64_t MASK11:1;
      uint64_t MASK12:1;
      uint64_t MASK13:1;
      uint64_t MASK14:1;
      uint64_t MASK15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO0:1;
      uint64_t MPPDO1:1;
      uint64_t MPPDO2:1;
      uint64_t MPPDO3:1;
      uint64_t MPPDO4:1;
      uint64_t MPPDO5:1;
      uint64_t MPPDO6:1;
      uint64_t MPPDO7:1;
      uint64_t MPPDO8:1;
      uint64_t MPPDO9:1;
      uint64_t MPPDO10:1;
      uint64_t MPPDO11:1;
      uint64_t MPPDO12:1;
      uint64_t MPPDO13:1;
      uint64_t MPPDO14:1;
      uint64_t MPPDO15:1;
      uint64_t MASK0:1;
      uint64_t MASK1:1;
      uint64_t MASK2:1;
      uint64_t MASK3:1;
      uint64_t MASK4:1;
      uint64_t MASK5:1;
      uint64_t MASK6:1;
      uint64_t MASK7:1;
      uint64_t MASK8:1;
      uint64_t MASK9:1;
      uint64_t MASK10:1;
      uint64_t MASK11:1;
      uint64_t MASK12:1;
      uint64_t MASK13:1;
      uint64_t MASK14:1;
      uint64_t MASK15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t MPPDO4:1;
      uint64_t MPPDO5:1;
      uint64_t MPPDO6:1;
      uint64_t MPPDO7:1;
      uint64_t MPPDO8:1;
      uint64_t MPPDO9:1;
      uint64_t MPPDO10:1;
      uint64_t MPPDO11:1;
      uint64_t MPPDO12:1;
      uint64_t MPPDO13:1;
      uint64_t MPPDO14:1;
      uint64_t MPPDO15:1;
      uint64_t reservedSpace1:4;
      uint64_t MASK4:1;
      uint64_t MASK5:1;
      uint64_t MASK6:1;
      uint64_t MASK7:1;
      uint64_t MASK8:1;
      uint64_t MASK9:1;
      uint64_t MASK10:1;
      uint64_t MASK11:1;
      uint64_t MASK12:1;
      uint64_t MASK13:1;
      uint64_t MASK14:1;
      uint64_t MASK15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO13;

