iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
};

#define SIUL2 (*(volatile struct SIUL2_tag *) 0x40290004)

struct VIRT_WRAPPER_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD_0:2;
      uint64_t PAD_1:2;
      uint64_t PAD_2:2;
      uint64_t PAD_3:2;
      uint64_t PAD_4:2;
      uint64_t PAD_5:2;
      uint64_t PAD_6:2;
      uint64_t PAD_7:2;
      uint64_t PAD_8:2;
      uint64_t PAD_9:2;
      uint64_t PAD_10:2;
      uint64_t PAD_11:2;
      uint64_t PAD_12:2;
      uint64_t PAD_13:2;
      uint64_t PAD_14:2;
      uint64_t PAD_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_A15_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD_0:2;
      uint64_t PAD_1:2;
      uint64_t PAD_2:2;
      uint64_t PAD_3:2;
      uint64_t PAD_4:2;
      uint64_t PAD_5:2;
      uint64_t PAD_6:2;
      uint64_t PAD_7:2;
      uint64_t PAD_8:2;
      uint64_t PAD_9:2;
      uint64_t PAD_10:2;
      uint64_t PAD_11:2;
      uint64_t PAD_12:2;
      uint64_t PAD_13:2;
      uint64_t PAD_14:2;
      uint64_t PAD_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_A31_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD_0:2;
      uint64_t PAD_1:2;
      uint64_t PAD_2:2;
      uint64_t PAD_3:2;
      uint64_t PAD_4:2;
      uint64_t PAD_5:2;
      uint64_t PAD_6:2;
      uint64_t PAD_7:2;
      uint64_t PAD_8:2;
      uint64_t PAD_9:2;
      uint64_t PAD_10:2;
      uint64_t PAD_11:2;
      uint64_t PAD_12:2;
      uint64_t PAD_13:2;
      uint64_t PAD_14:2;
      uint64_t PAD_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_A47_32;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD_0:2;
      uint64_t PAD_1:2;
      uint64_t PAD_2:2;
      uint64_t PAD_3:2;
      uint64_t PAD_4:2;
      uint64_t PAD_5:2;
      uint64_t PAD_6:2;
      uint64_t PAD_7:2;
      uint64_t PAD_8:2;
      uint64_t PAD_9:2;
      uint64_t PAD_10:2;
      uint64_t PAD_11:2;
      uint64_t PAD_12:2;
      uint64_t PAD_13:2;
      uint64_t PAD_14:2;
      uint64_t PAD_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_A63_48;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD_0:2;
      uint64_t PAD_1:2;
      uint64_t PAD_2:2;
      uint64_t PAD_3:2;
      uint64_t PAD_4:2;
      uint64_t PAD_5:2;
      uint64_t PAD_6:2;
      uint64_t PAD_7:2;
      uint64_t PAD_8:2;
      uint64_t PAD_9:2;
      uint64_t PAD_10:2;
      uint64_t PAD_11:2;
      uint64_t PAD_12:2;
      uint64_t PAD_13:2;
      uint64_t PAD_14:2;
      uint64_t PAD_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_A79_64;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD_0:2;
      uint64_t PAD_1:2;
      uint64_t PAD_2:2;
      uint64_t PAD_3:2;
      uint64_t PAD_4:2;
      uint64_t PAD_5:2;
      uint64_t PAD_6:2;
      uint64_t PAD_7:2;
      uint64_t PAD_8:2;
      uint64_t PAD_9:2;
      uint64_t PAD_10:2;
      uint64_t PAD_11:2;
      uint64_t PAD_12:2;
      uint64_t PAD_13:2;
      uint64_t PAD_14:2;
      uint64_t PAD_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_A95_80;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD_0:2;
      uint64_t PAD_1:2;
      uint64_t PAD_2:2;
      uint64_t PAD_3:2;
      uint64_t PAD_4:2;
      uint64_t PAD_5:2;
      uint64_t PAD_6:2;
      uint64_t PAD_7:2;
      uint64_t PAD_8:2;
      uint64_t PAD_9:2;
      uint64_t PAD_10:2;
      uint64_t PAD_11:2;
      uint64_t PAD_12:2;
      uint64_t PAD_13:2;
      uint64_t PAD_14:2;
      uint64_t PAD_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_A111_96;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD_0:2;
      uint64_t PAD_1:2;
      uint64_t PAD_2:2;
      uint64_t PAD_3:2;
      uint64_t PAD_4:2;
      uint64_t PAD_5:2;
      uint64_t PAD_6:2;
      uint64_t PAD_7:2;
      uint64_t PAD_8:2;
      uint64_t PAD_9:2;
      uint64_t PAD_10:2;
      uint64_t PAD_11:2;
      uint64_t PAD_12:2;
      uint64_t PAD_13:2;
      uint64_t PAD_14:2;
      uint64_t PAD_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_A127_112;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD_0:2;
      uint64_t PAD_1:2;
      uint64_t PAD_2:2;
      uint64_t PAD_3:2;
      uint64_t PAD_4:2;
      uint64_t PAD_5:2;
      uint64_t PAD_6:2;
      uint64_t PAD_7:2;
      uint64_t PAD_8:2;
      uint64_t PAD_9:2;
      uint64_t PAD_10:2;
      uint64_t PAD_11:2;
      uint64_t PAD_12:2;
      uint64_t PAD_13:2;
      uint64_t PAD_14:2;
      uint64_t PAD_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_A143_128;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD_0:2;
      uint64_t PAD_1:2;
      uint64_t PAD_2:2;
      uint64_t PAD_3:2;
      uint64_t PAD_4:2;
      uint64_t PAD_5:2;
      uint64_t PAD_6:2;
      uint64_t PAD_7:2;
      uint64_t PAD_8:2;
      uint64_t PAD_9:2;
      uint64_t PAD_10:2;
      uint64_t PAD_11:2;
      uint64_t PAD_12:2;
      uint64_t PAD_13:2;
      uint64_t PAD_14:2;
      uint64_t PAD_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_A159_144;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD_0:2;
      uint64_t PAD_1:2;
      uint64_t PAD_2:2;
      uint64_t PAD_3:2;
      uint64_t PAD_4:2;
      uint64_t PAD_5:2;
      uint64_t PAD_6:2;
      uint64_t PAD_7:2;
      uint64_t PAD_8:2;
      uint64_t PAD_9:2;
      uint64_t PAD_10:2;
      uint64_t PAD_11:2;
      uint64_t PAD_12:2;
      uint64_t PAD_13:2;
      uint64_t PAD_14:2;
      uint64_t PAD_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_A175_160;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD_0:2;
      uint64_t PAD_1:2;
      uint64_t PAD_2:2;
      uint64_t PAD_3:2;
      uint64_t PAD_4:2;
      uint64_t PAD_5:2;
      uint64_t PAD_6:2;
      uint64_t PAD_7:2;
      uint64_t PAD_8:2;
      uint64_t PAD_9:2;
      uint64_t PAD_10:2;
      uint64_t PAD_11:2;
      uint64_t PAD_12:2;
      uint64_t PAD_13:2;
      uint64_t PAD_14:2;
      uint64_t PAD_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_A191_176;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD_0:2;
      uint64_t PAD_1:2;
      uint64_t PAD_2:2;
      uint64_t PAD_3:2;
      uint64_t PAD_4:2;
      uint64_t PAD_5:2;
      uint64_t PAD_6:2;
      uint64_t PAD_7:2;
      uint64_t PAD_8:2;
      uint64_t PAD_9:2;
      uint64_t PAD_10:2;
      uint64_t PAD_11:2;
      uint64_t PAD_12:2;
      uint64_t PAD_13:2;
      uint64_t PAD_14:2;
      uint64_t PAD_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_A207_192;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD_0:2;
      uint64_t PAD_1:2;
      uint64_t PAD_2:2;
      uint64_t PAD_3:2;
      uint64_t PAD_4:2;
      uint64_t PAD_5:2;
      uint64_t PAD_6:2;
      uint64_t PAD_7:2;
      uint64_t PAD_8:2;
      uint64_t PAD_9:2;
      uint64_t PAD_10:2;
      uint64_t PAD_11:2;
      uint64_t PAD_12:2;
      uint64_t PAD_13:2;
      uint64_t PAD_14:2;
      uint64_t PAD_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_A223_208;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD_0:2;
      uint64_t PAD_1:2;
      uint64_t PAD_2:2;
      uint64_t PAD_3:2;
      uint64_t PAD_4:2;
      uint64_t PAD_5:2;
      uint64_t PAD_6:2;
      uint64_t PAD_7:2;
      uint64_t PAD_8:2;
      uint64_t PAD_9:2;
      uint64_t PAD_10:2;
      uint64_t PAD_11:2;
      uint64_t PAD_12:2;
      uint64_t PAD_13:2;
      uint64_t PAD_14:2;
      uint64_t PAD_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_A239_224;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD_0:2;
      uint64_t PAD_1:2;
      uint64_t PAD_2:2;
      uint64_t PAD_3:2;
      uint64_t PAD_4:2;
      uint64_t PAD_5:2;
      uint64_t PAD_6:2;
      uint64_t PAD_7:2;
      uint64_t PAD_8:2;
      uint64_t PAD_9:2;
      uint64_t PAD_10:2;
      uint64_t PAD_11:2;
      uint64_t PAD_12:2;
      uint64_t PAD_13:2;
      uint64_t PAD_14:2;
      uint64_t PAD_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_A255_240;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD_0:2;
      uint64_t PAD_1:2;
      uint64_t PAD_2:2;
      uint64_t PAD_3:2;
      uint64_t PAD_4:2;
      uint64_t PAD_5:2;
      uint64_t PAD_6:2;
      uint64_t PAD_7:2;
      uint64_t PAD_8:2;
      uint64_t PAD_9:2;
      uint64_t PAD_10:2;
      uint64_t PAD_11:2;
      uint64_t PAD_12:2;
      uint64_t PAD_13:2;
      uint64_t PAD_14:2;
      uint64_t PAD_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_A271_256;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD_0:2;
      uint64_t PAD_1:2;
      uint64_t PAD_2:2;
      uint64_t PAD_3:2;
      uint64_t PAD_4:2;
      uint64_t PAD_5:2;
      uint64_t PAD_6:2;
      uint64_t PAD_7:2;
      uint64_t PAD_8:2;
      uint64_t PAD_9:2;
      uint64_t PAD_10:2;
      uint64_t PAD_11:2;
      uint64_t PAD_12:2;
      uint64_t PAD_13:2;
      uint64_t PAD_14:2;
      uint64_t PAD_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_A287_272;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD_0:2;
      uint64_t PAD_1:2;
      uint64_t PAD_2:2;
      uint64_t PAD_3:2;
      uint64_t PAD_4:2;
      uint64_t PAD_5:2;
      uint64_t PAD_6:2;
      uint64_t PAD_7:2;
      uint64_t PAD_8:2;
      uint64_t PAD_9:2;
      uint64_t PAD_10:2;
      uint64_t PAD_11:2;
      uint64_t PAD_12:2;
      uint64_t PAD_13:2;
      uint64_t PAD_14:2;
      uint64_t PAD_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_A303_288;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD_0:2;
      uint64_t PAD_1:2;
      uint64_t PAD_2:2;
      uint64_t PAD_3:2;
      uint64_t PAD_4:2;
      uint64_t PAD_5:2;
      uint64_t PAD_6:2;
      uint64_t PAD_7:2;
      uint64_t PAD_8:2;
      uint64_t PAD_9:2;
      uint64_t PAD_10:2;
      uint64_t PAD_11:2;
      uint64_t PAD_12:2;
      uint64_t PAD_13:2;
      uint64_t PAD_14:2;
      uint64_t PAD_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_A319_304;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD_0:2;
      uint64_t PAD_1:2;
      uint64_t PAD_2:2;
      uint64_t PAD_3:2;
      uint64_t PAD_4:2;
      uint64_t PAD_5:2;
      uint64_t PAD_6:2;
      uint64_t PAD_7:2;
      uint64_t PAD_8:2;
      uint64_t PAD_9:2;
      uint64_t PAD_10:2;
      uint64_t PAD_11:2;
      uint64_t PAD_12:2;
      uint64_t PAD_13:2;
      uint64_t PAD_14:2;
      uint64_t PAD_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_A335_320;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD_0:2;
      uint64_t PAD_1:2;
      uint64_t PAD_2:2;
      uint64_t PAD_3:2;
      uint64_t PAD_4:2;
      uint64_t PAD_5:2;
      uint64_t PAD_6:2;
      uint64_t PAD_7:2;
      uint64_t PAD_8:2;
      uint64_t PAD_9:2;
      uint64_t PAD_10:2;
      uint64_t PAD_11:2;
      uint64_t PAD_12:2;
      uint64_t PAD_13:2;
      uint64_t PAD_14:2;
      uint64_t PAD_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_A351_336;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD_0:2;
      uint64_t PAD_1:2;
      uint64_t PAD_2:2;
      uint64_t PAD_3:2;
      uint64_t PAD_4:2;
      uint64_t PAD_5:2;
      uint64_t PAD_6:2;
      uint64_t PAD_7:2;
      uint64_t PAD_8:2;
      uint64_t PAD_9:2;
      uint64_t PAD_10:2;
      uint64_t PAD_11:2;
      uint64_t PAD_12:2;
      uint64_t PAD_13:2;
      uint64_t PAD_14:2;
      uint64_t PAD_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_A367_352;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD_0:2;
      uint64_t PAD_1:2;
      uint64_t PAD_2:2;
      uint64_t PAD_3:2;
      uint64_t PAD_4:2;
      uint64_t PAD_5:2;
      uint64_t PAD_6:2;
      uint64_t PAD_7:2;
      uint64_t PAD_8:2;
      uint64_t PAD_9:2;
      uint64_t PAD_10:2;
      uint64_t PAD_11:2;
      uint64_t PAD_12:2;
      uint64_t PAD_13:2;
      uint64_t PAD_14:2;
      uint64_t PAD_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_A383_368;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD_0:2;
      uint64_t PAD_1:2;
      uint64_t PAD_2:2;
      uint64_t PAD_3:2;
      uint64_t PAD_4:2;
      uint64_t PAD_5:2;
      uint64_t PAD_6:2;
      uint64_t PAD_7:2;
      uint64_t PAD_8:2;
      uint64_t PAD_9:2;
      uint64_t PAD_10:2;
      uint64_t PAD_11:2;
      uint64_t PAD_12:2;
      uint64_t PAD_13:2;
      uint64_t PAD_14:2;
      uint64_t PAD_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_A399_384;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD_0:2;
      uint64_t PAD_1:2;
      uint64_t PAD_2:2;
      uint64_t PAD_3:2;
      uint64_t PAD_4:2;
      uint64_t PAD_5:2;
      uint64_t PAD_6:2;
      uint64_t PAD_7:2;
      uint64_t PAD_8:2;
      uint64_t PAD_9:2;
      uint64_t PAD_10:2;
      uint64_t PAD_11:2;
      uint64_t PAD_12:2;
      uint64_t PAD_13:2;
      uint64_t PAD_14:2;
      uint64_t PAD_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_A415_400;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD_0:2;
      uint64_t PAD_1:2;
      uint64_t PAD_2:2;
      uint64_t PAD_3:2;
      uint64_t PAD_4:2;
      uint64_t PAD_5:2;
      uint64_t PAD_6:2;
      uint64_t PAD_7:2;
      uint64_t PAD_8:2;
      uint64_t PAD_9:2;
      uint64_t PAD_10:2;
      uint64_t PAD_11:2;
      uint64_t PAD_12:2;
      uint64_t PAD_13:2;
      uint64_t PAD_14:2;
      uint64_t PAD_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_A431_416;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD_0:2;
      uint64_t PAD_1:2;
      uint64_t PAD_2:2;
      uint64_t PAD_3:2;
      uint64_t PAD_4:2;
      uint64_t PAD_5:2;
      uint64_t PAD_6:2;
      uint64_t PAD_7:2;
      uint64_t PAD_8:2;
      uint64_t PAD_9:2;
      uint64_t PAD_10:2;
      uint64_t PAD_11:2;
      uint64_t PAD_12:2;
      uint64_t PAD_13:2;
      uint64_t PAD_14:2;
      uint64_t PAD_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_A447_432;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD_0:2;
      uint64_t PAD_1:2;
      uint64_t PAD_2:2;
      uint64_t PAD_3:2;
      uint64_t PAD_4:2;
      uint64_t PAD_5:2;
      uint64_t PAD_6:2;
      uint64_t PAD_7:2;
      uint64_t PAD_8:2;
      uint64_t PAD_9:2;
      uint64_t PAD_10:2;
      uint64_t PAD_11:2;
      uint64_t PAD_12:2;
      uint64_t PAD_13:2;
      uint64_t PAD_14:2;
      uint64_t PAD_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_A463_448;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD_0:2;
      uint64_t PAD_1:2;
      uint64_t PAD_2:2;
      uint64_t PAD_3:2;
      uint64_t PAD_4:2;
      uint64_t PAD_5:2;
      uint64_t PAD_6:2;
      uint64_t PAD_7:2;
      uint64_t PAD_8:2;
      uint64_t PAD_9:2;
      uint64_t PAD_10:2;
      uint64_t PAD_11:2;
      uint64_t PAD_12:2;
      uint64_t PAD_13:2;
      uint64_t PAD_14:2;
      uint64_t PAD_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_A479_464;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD_0:2;
      uint64_t PAD_1:2;
      uint64_t PAD_2:2;
      uint64_t PAD_3:2;
      uint64_t PAD_4:2;
      uint64_t PAD_5:2;
      uint64_t PAD_6:2;
      uint64_t PAD_7:2;
      uint64_t PAD_8:2;
      uint64_t PAD_9:2;
      uint64_t PAD_10:2;
      uint64_t PAD_11:2;
      uint64_t PAD_12:2;
      uint64_t PAD_13:2;
      uint64_t PAD_14:2;
      uint64_t PAD_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_A495_480;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD_0:2;
      uint64_t PAD_1:2;
      uint64_t PAD_2:2;
      uint64_t PAD_3:2;
      uint64_t PAD_4:2;
      uint64_t PAD_5:2;
      uint64_t PAD_6:2;
      uint64_t PAD_7:2;
      uint64_t PAD_8:2;
      uint64_t PAD_9:2;
      uint64_t PAD_10:2;
      uint64_t PAD_11:2;
      uint64_t PAD_12:2;
      uint64_t PAD_13:2;
      uint64_t PAD_14:2;
      uint64_t PAD_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_A511_496;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
      uint64_t INMUX_13:2;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B527_512;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
      uint64_t INMUX_13:2;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B543_528;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
      uint64_t INMUX_13:2;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B559_544;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
      uint64_t INMUX_13:2;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B575_560;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
      uint64_t INMUX_13:2;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B591_576;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
      uint64_t INMUX_13:2;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B607_592;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
      uint64_t INMUX_13:2;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B623_608;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
      uint64_t INMUX_13:2;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B639_624;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
      uint64_t INMUX_13:2;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B655_640;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
      uint64_t INMUX_13:2;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B671_656;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
      uint64_t INMUX_13:2;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B687_672;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
      uint64_t INMUX_13:2;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B703_688;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
      uint64_t INMUX_13:2;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B719_704;

