iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
      uint64_t INMUX_13:2;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B735_720;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
      uint64_t INMUX_13:2;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B751_736;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
      uint64_t INMUX_13:2;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B767_752;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
      uint64_t INMUX_13:2;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B783_768;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
      uint64_t INMUX_13:2;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B799_784;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
      uint64_t INMUX_13:2;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B815_800;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
      uint64_t INMUX_13:2;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B831_816;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
      uint64_t INMUX_13:2;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B847_832;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
      uint64_t INMUX_13:2;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B863_848;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
      uint64_t INMUX_13:2;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B879_864;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
      uint64_t INMUX_13:2;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B895_880;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
      uint64_t INMUX_13:2;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B911_896;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
      uint64_t INMUX_13:2;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B927_912;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
      uint64_t INMUX_13:2;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B943_928;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
      uint64_t INMUX_13:2;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B959_944;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
      uint64_t INMUX_13:2;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B975_960;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
      uint64_t INMUX_13:2;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B991_976;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
      uint64_t INMUX_13:2;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B1007_992;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
      uint64_t INMUX_13:2;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B1023_1008;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTC_CTRL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_C1039_1024;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:30;
      uint64_t REG_GCR:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_D1055_1040;

