iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
};

#define VIRT_WRAPPER (*(volatile struct VIRT_WRAPPER_tag *) 0x402a8000)

struct DCM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCMDONE:1;
      uint64_t DCMERR:1;
      uint64_t reservedSpace0:2;
      uint64_t DCMLCST:1;
      uint64_t reservedSpace1:3;
      uint64_t DCMUTS:1;
      uint64_t DCMOTAS:1;
      uint64_t DCMDBGPS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCMCLC:3;
      uint64_t DCMLCFN:1;
      uint64_t DCMRLC:3;
      uint64_t reservedSpace0:1;
      uint64_t DCMFLC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMLCC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCMLCSS1:1;
      uint64_t DCMLCC1:3;
      uint64_t DCMLCE1:1;
      uint64_t DCMLCFE1:1;
      uint64_t DCMLCSS2:1;
      uint64_t DCMLCC2:3;
      uint64_t DCMLCE2:1;
      uint64_t DCMLCFE2:1;
      uint64_t DCMLCSS3:1;
      uint64_t DCMLCC3:3;
      uint64_t DCMLCE3:1;
      uint64_t DCMLCFE3:1;
      uint64_t DCMLCSS4:1;
      uint64_t DCMLCC4:3;
      uint64_t DCMLCE4:1;
      uint64_t DCMLCFE4:1;
      uint64_t DCMLCSS5:1;
      uint64_t DCMLCC5:3;
      uint64_t DCMLCE5:1;
      uint64_t DCMLCFE5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMLCS;

  uint8_t res0[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:10;
      uint64_t DCMDBGT:1;
      uint64_t DCMDBGE:1;
      uint64_t reservedSpace1:16;
      uint64_t DCMCERS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMMISC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t DCM_APPDBG_STAT:1;
      uint64_t reservedSpace1:14;
      uint64_t APPDBG_STAT_SOC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMDEB;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCMECT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMEC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCMDCFE1:21;
      uint64_t reservedSpace0:3;
      uint64_t DCMDCFF1:3;
      uint64_t DCMESF1:1;
      uint64_t DCMESD1:1;
      uint64_t DCMDCFT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMSRR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCMDCFE1:21;
      uint64_t reservedSpace0:3;
      uint64_t DCMDCFF1:3;
      uint64_t DCMESF1:1;
      uint64_t DCMESD1:1;
      uint64_t DCMDCFT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMSRR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCMDCFE1:21;
      uint64_t reservedSpace0:3;
      uint64_t DCMDCFF1:3;
      uint64_t DCMESF1:1;
      uint64_t DCMESD1:1;
      uint64_t DCMDCFT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMSRR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCMDCFE1:21;
      uint64_t reservedSpace0:3;
      uint64_t DCMDCFF1:3;
      uint64_t DCMESF1:1;
      uint64_t DCMESD1:1;
      uint64_t DCMDCFT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMSRR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCMDCFE1:21;
      uint64_t reservedSpace0:3;
      uint64_t DCMDCFF1:3;
      uint64_t DCMESF1:1;
      uint64_t DCMESD1:1;
      uint64_t DCMDCFT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMSRR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCMDCFE1:21;
      uint64_t reservedSpace0:3;
      uint64_t DCMDCFF1:3;
      uint64_t DCMESF1:1;
      uint64_t DCMESD1:1;
      uint64_t DCMDCFT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMSRR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCMDCFE1:21;
      uint64_t reservedSpace0:3;
      uint64_t DCMDCFF1:3;
      uint64_t DCMESF1:1;
      uint64_t DCMESD1:1;
      uint64_t DCMDCFT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMSRR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCMDCFE1:21;
      uint64_t reservedSpace0:3;
      uint64_t DCMDCFF1:3;
      uint64_t DCMESF1:1;
      uint64_t DCMESD1:1;
      uint64_t DCMDCFT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMSRR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCMDCFE1:21;
      uint64_t reservedSpace0:3;
      uint64_t DCMDCFF1:3;
      uint64_t DCMESF1:1;
      uint64_t DCMESD1:1;
      uint64_t DCMDCFT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMSRR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCMDCFE1:21;
      uint64_t reservedSpace0:3;
      uint64_t DCMDCFF1:3;
      uint64_t DCMESF1:1;
      uint64_t DCMESD1:1;
      uint64_t DCMDCFT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMSRR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCMDCFE1:21;
      uint64_t reservedSpace0:3;
      uint64_t DCMDCFF1:3;
      uint64_t DCMESF1:1;
      uint64_t DCMESD1:1;
      uint64_t DCMDCFT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMSRR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCMDCFE1:21;
      uint64_t reservedSpace0:3;
      uint64_t DCMDCFF1:3;
      uint64_t DCMESF1:1;
      uint64_t DCMESD1:1;
      uint64_t DCMDCFT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMSRR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCMDCFE1:21;
      uint64_t reservedSpace0:3;
      uint64_t DCMDCFF1:3;
      uint64_t DCMESF1:1;
      uint64_t DCMESD1:1;
      uint64_t DCMDCFT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMSRR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCMDCFE1:21;
      uint64_t reservedSpace0:3;
      uint64_t DCMDCFF1:3;
      uint64_t DCMESF1:1;
      uint64_t DCMESD1:1;
      uint64_t DCMDCFT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMSRR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCMDCFE1:21;
      uint64_t reservedSpace0:3;
      uint64_t DCMDCFF1:3;
      uint64_t DCMESF1:1;
      uint64_t DCMESD1:1;
      uint64_t DCMDCFT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMSRR15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCMDCFE1:21;
      uint64_t reservedSpace0:3;
      uint64_t DCMDCFF1:3;
      uint64_t DCMESF1:1;
      uint64_t DCMESD1:1;
      uint64_t DCMDCFT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMSRR16;

