iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
  uint8_t res2[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCMLCSS6:1;
      uint64_t DCMLCC6:3;
      uint64_t DCMLCE6:1;
      uint64_t DCMLCFE6:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMLCS_2;

};

#define DCM (*(volatile struct DCM_tag *) 0x402ac000)

struct DCM_GPR_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCU_ISO_STATUS:1;
      uint64_t HSE_DCF_VIO:1;
      uint64_t KEY_RESP_READY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROD1;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CM7_0_LOCKUP:1;
      uint64_t reservedSpace0:1;
      uint64_t HSE_LOCKUP:1;
      uint64_t CM7_RCCU1_ALARM:1;
      uint64_t CM7_RCCU2_ALARM:1;
      uint64_t TCM_GSKT_ALARM:1;
      uint64_t DMA_SYS_GSKT_ALARM:1;
      uint64_t DMA_PERIPH_GSKT_ALARM:1;
      uint64_t SYS_AXBS_ALARM:1;
      uint64_t DMA_AXBS_ALARM:1;
      uint64_t reservedSpace1:1;
      uint64_t HSE_GSKT_ALARM:1;
      uint64_t QSPI_GSKT_ALARM:1;
      uint64_t AIPS1_GSKT_ALARM:1;
      uint64_t AIPS2_GSKT_ALARM:1;
      uint64_t ADDR_EDC_ERR:1;
      uint64_t DATA_EDC_ERR:1;
      uint64_t TCM_AXBS_ALARM:1;
      uint64_t EMAC_GSKT_ALARM:1;
      uint64_t PERIPH_AXBS_ALARM:1;
      uint64_t reservedSpace2:2;
      uint64_t LC_ERR:1;
      uint64_t reservedSpace3:1;
      uint64_t PRAM1_ECC_ERR:1;
      uint64_t PRAM0_ECC_ERR:1;
      uint64_t CM7_0_DCDATA_ECC_ERR:1;
      uint64_t reservedSpace4:1;
      uint64_t CM7_0_DCTAG_ECC_ERR:1;
      uint64_t reservedSpace5:1;
      uint64_t CM7_0_ICDATA_ECC_ERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CM7_0_ICTAG_ECC_ERR:1;
      uint64_t reservedSpace0:1;
      uint64_t CM7_0_ITCM_ECC_ERR:1;
      uint64_t CM7_0_DTCM0_ECC_ERR:1;
      uint64_t CM7_0_DTCM1_ECC_ERR:1;
      uint64_t CM7_1_ITCM_ECC_ERR:1;
      uint64_t CM7_1_DTCM0_ECC_ERR:1;
      uint64_t CM7_1_DTCM1_ECC_ERR:1;
      uint64_t DMA_TCD_RAM_ECC_ERR:1;
      uint64_t PRAM0_FCCU_ALARM:1;
      uint64_t PRAM1_FCCU_ALARM:1;
      uint64_t HSE_RAM_ECC_ERR:1;
      uint64_t PF0_CODE_ECC_ERR:1;
      uint64_t PF0_DATA_ECC_ERR:1;
      uint64_t PF1_CODE_ECC_ERR:1;
      uint64_t PF1_DATA_ECC_ERR:1;
      uint64_t reservedSpace1:2;
      uint64_t FLASH_EDC_ERR:1;
      uint64_t FLASH_ADDR_ENC_ERR:1;
      uint64_t FLASH_REF_ERR:1;
      uint64_t FLASH_RST_ERR:1;
      uint64_t FLASH_SCAN_ERR:1;
      uint64_t reservedSpace2:1;
      uint64_t FLASH_ACCESS_ERR:1;
      uint64_t reservedSpace3:1;
      uint64_t VDD1P1_GNG_ERR:1;
      uint64_t VDD2P5_GNG_ERR:1;
      uint64_t reservedSpace4:1;
      uint64_t TEST_ACTIVATION_0_ERR:1;
      uint64_t TEST_ACTIVATION_1_ERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROD4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t INTM_0_ERR:1;
      uint64_t INTM_1_ERR:1;
      uint64_t INTM_2_ERR:1;
      uint64_t INTM_3_ERR:1;
      uint64_t SW_NCF_0:1;
      uint64_t SW_NCF_1:1;
      uint64_t SW_NCF_2:1;
      uint64_t SW_NCF_3:1;
      uint64_t STCU_NCF:1;
      uint64_t MBIST_ACTIVATION_ERR:1;
      uint64_t STCU_BIST_USER_CF:1;
      uint64_t MTR_BUS_ERR:1;
      uint64_t DEBUG_ACTIVATION_ERR:1;
      uint64_t TCM_RDATA_EDC_ERR:1;
      uint64_t EMAC_RDATA_EDC_ERR:1;
      uint64_t reservedSpace1:1;
      uint64_t DMA_RDATA_EDC_ERR:1;
      uint64_t reservedSpace2:2;
      uint64_t CM7_0_AHBP_RDATA_EDC_ERR:1;
      uint64_t CM7_0_AHBM_RDATA_EDC_ERR:1;
      uint64_t HSE_RDATA_EDC_ERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROD5;

  uint8_t res1[236];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_MDC_CHID_0:1;
      uint64_t EMAC_MDC_CHID_1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROF1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCF_SDID0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROF2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCF_SDID1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROF3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCF_SDID2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROF4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCF_SDID3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROF5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCF_SDID4:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROF6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCF_SDID5:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROF7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCF_SDID6:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROF8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCF_SDID7:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROF9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCF_SDID8:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROF10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCF_SDID9:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROF11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCF_SDID10:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROF12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCF_SDID11:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROF13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCF_SDID12:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROF14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCF_SDID13:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROF15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCF_SDID14:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROF16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCF_SDID15:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROF17;

