iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
  uint8_t res7[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t MUX_MODE_EN_ADC0_S8:1;
      uint64_t MUX_MODE_EN_ADC0_S9:1;
      uint64_t MUX_MODE_EN_ADC1_S14:1;
      uint64_t MUX_MODE_EN_ADC1_S15:1;
      uint64_t MUX_MODE_EN_ADC1_S22:1;
      uint64_t MUX_MODE_EN_ADC1_S23:1;
      uint64_t reservedSpace1:2;
      uint64_t MUX_MODE_EN_ADC2_S8:1;
      uint64_t MUX_MODE_EN_ADC2_S9:1;
      uint64_t reservedSpace2:2;
      uint64_t GLITCH_FIL_TRG_IN0_BYP:1;
      uint64_t GLITCH_FIL_TRG_IN1_BYP:1;
      uint64_t GLITCH_FIL_TRG_IN2_BYP:1;
      uint64_t GLITCH_FIL_TRG_IN3_BYP:1;
      uint64_t CM7_0_CPUWAIT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMRWF4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BOOT_MODE:1;
      uint64_t BOOT_ADDRESS:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMRWF5;

  uint8_t res8[236];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POR_WDG_STAT0:1;
      uint64_t POR_WDG_STAT1:1;
      uint64_t POR_WDG_STAT2:1;
      uint64_t POR_WDG_STAT3:1;
      uint64_t POR_WDG_STAT4:1;
      uint64_t POR_WDG_STAT5:1;
      uint64_t POR_WDG_STAT6:1;
      uint64_t reservedSpace0:3;
      uint64_t POR_WDG_STAT10:1;
      uint64_t POR_WDG_STAT11:1;
      uint64_t reservedSpace1:2;
      uint64_t POR_WDG_STAT14:1;
      uint64_t reservedSpace2:2;
      uint64_t POR_WDG_STAT17:1;
      uint64_t reservedSpace3:2;
      uint64_t POR_WDG_STAT20:1;
      uint64_t reservedSpace4:8;
      uint64_t POR_WDG_STAT29:1;
      uint64_t POR_WDG_STAT30:1;
      uint64_t POR_WDG_STAT31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROPP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POR_WDG_STAT32:1;
      uint64_t POR_WDG_STAT33:1;
      uint64_t POR_WDG_STAT34:1;
      uint64_t POR_WDG_STAT35:1;
      uint64_t POR_WDG_STAT36:1;
      uint64_t POR_WDG_STAT37:1;
      uint64_t POR_WDG_STAT38:1;
      uint64_t POR_WDG_STAT39:1;
      uint64_t POR_WDG_STAT40:1;
      uint64_t POR_WDG_STAT41:1;
      uint64_t POR_WDG_STAT42:1;
      uint64_t POR_WDG_STAT43:1;
      uint64_t POR_WDG_STAT44:1;
      uint64_t POR_WDG_STAT45:1;
      uint64_t POR_WDG_STAT46:1;
      uint64_t POR_WDG_STAT47:1;
      uint64_t POR_WDG_STAT48:1;
      uint64_t POR_WDG_STAT49:1;
      uint64_t POR_WDG_STAT50:1;
      uint64_t POR_WDG_STAT51:1;
      uint64_t POR_WDG_STAT52:1;
      uint64_t POR_WDG_STAT53:1;
      uint64_t POR_WDG_STAT54:1;
      uint64_t POR_WDG_STAT55:1;
      uint64_t POR_WDG_STAT56:1;
      uint64_t POR_WDG_STAT57:1;
      uint64_t POR_WDG_STAT58:1;
      uint64_t POR_WDG_STAT59:1;
      uint64_t POR_WDG_STAT60:1;
      uint64_t POR_WDG_STAT61:1;
      uint64_t POR_WDG_STAT62:1;
      uint64_t POR_WDG_STAT63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROPP2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POR_WDG_STAT64:1;
      uint64_t POR_WDG_STAT65:1;
      uint64_t POR_WDG_STAT66:1;
      uint64_t POR_WDG_STAT67:1;
      uint64_t POR_WDG_STAT68:1;
      uint64_t POR_WDG_STAT69:1;
      uint64_t POR_WDG_STAT70:1;
      uint64_t POR_WDG_STAT71:1;
      uint64_t POR_WDG_STAT72:1;
      uint64_t POR_WDG_STAT73:1;
      uint64_t POR_WDG_STAT74:1;
      uint64_t POR_WDG_STAT75:1;
      uint64_t POR_WDG_STAT76:1;
      uint64_t POR_WDG_STAT77:1;
      uint64_t POR_WDG_STAT78:1;
      uint64_t POR_WDG_STAT79:1;
      uint64_t POR_WDG_STAT80:1;
      uint64_t POR_WDG_STAT81:1;
      uint64_t POR_WDG_STAT82:1;
      uint64_t POR_WDG_STAT83:1;
      uint64_t POR_WDG_STAT84:1;
      uint64_t POR_WDG_STAT85:1;
      uint64_t POR_WDG_STAT86:1;
      uint64_t POR_WDG_STAT87:1;
      uint64_t POR_WDG_STAT88:1;
      uint64_t POR_WDG_STAT89:1;
      uint64_t POR_WDG_STAT90:1;
      uint64_t POR_WDG_STAT91:1;
      uint64_t POR_WDG_STAT92:1;
      uint64_t POR_WDG_STAT93:1;
      uint64_t POR_WDG_STAT94:1;
      uint64_t POR_WDG_STAT95:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROPP3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POR_WDG_STAT96:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROPP4;

};

#define DCM_GPR (*(volatile struct DCM_GPR_tag *) 0x402ac200)

struct WKPU_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:22;
      uint64_t NOVF1:1;
      uint64_t NIF1:1;
      uint64_t reservedSpace1:6;
      uint64_t NOVF0:1;
      uint64_t NIF0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NSR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t NFE1:1;
      uint64_t NFEE1:1;
      uint64_t NREE1:1;
      uint64_t reservedSpace1:1;
      uint64_t NWRE1:1;
      uint64_t NDSS1:2;
      uint64_t NLOCK1:1;
      uint64_t NFE0:1;
      uint64_t NFEE0:1;
      uint64_t NREE0:1;
      uint64_t reservedSpace2:1;
      uint64_t NWRE0:1;
      uint64_t NDSS0:2;
      uint64_t NLOCK0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NCR;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIRE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WRE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WRER;

  uint8_t res2[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IREE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WIREER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IFEEx:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WIFEER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IFE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WIFER;

  uint8_t res3[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIF_1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WISR_64;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIRE_1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRER_64;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WRE_1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WRER_64;

