iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
  uint8_t res4[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IREE_1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WIREER_64;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IFEEx_1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WIFEER_64;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IFE_1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WIFER_64;

};

#define WKPU (*(volatile struct WKPU_tag *) 0x402b4000)

struct CMU_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REF_CNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HFREF:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LFREF:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLL:1;
      uint64_t FHH:1;
      uint64_t reservedSpace0:2;
      uint64_t RS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLLIE:1;
      uint64_t FHHIE:1;
      uint64_t FLLAIE:1;
      uint64_t FHHAIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

};

#define CMU_0 (*(volatile struct CMU_0_tag *) 0x402bc000)

struct CMU_3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REF_CNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HFREF:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LFREF:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLL:1;
      uint64_t FHH:1;
      uint64_t reservedSpace0:2;
      uint64_t RS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLLIE:1;
      uint64_t FHHIE:1;
      uint64_t FLLAIE:1;
      uint64_t FHHAIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

};

#define CMU_3 (*(volatile struct CMU_3_tag *) 0x402bc060)

struct CMU_4_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REF_CNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HFREF:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LFREF:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLL:1;
      uint64_t FHH:1;
      uint64_t reservedSpace0:2;
      uint64_t RS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLLIE:1;
      uint64_t FHHIE:1;
      uint64_t FLLAIE:1;
      uint64_t FHHAIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

};

#define CMU_4 (*(volatile struct CMU_4_tag *) 0x402bc080)

struct CMU_5_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REF_CNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HFREF:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LFREF:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLL:1;
      uint64_t FHH:1;
      uint64_t reservedSpace0:2;
      uint64_t RS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLLIE:1;
      uint64_t FHHIE:1;
      uint64_t FLLAIE:1;
      uint64_t FHHAIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

};

#define CMU_5 (*(volatile struct CMU_5_tag *) 0x402bc0a0)

struct CMU_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FME:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REF_CNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FMC:1;
      uint64_t FMTO:1;
      uint64_t reservedSpace0:2;
      uint64_t RS:1;
      uint64_t reservedSpace1:3;
      uint64_t MET_CNT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FMCIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

};

#define CMU_1 (*(volatile struct CMU_1_tag *) 0x402bc020)

struct CMU_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FME:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REF_CNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FMC:1;
      uint64_t FMTO:1;
      uint64_t reservedSpace0:2;
      uint64_t RS:1;
      uint64_t reservedSpace1:3;
      uint64_t MET_CNT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FMCIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

