iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
};

#define CMU_2 (*(volatile struct CMU_2_tag *) 0x402bc040)

struct TSPC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRP1_EN:1;
      uint64_t GRP2_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GRP_EN;

  uint8_t res0[76];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OBE0:1;
      uint64_t OBE1:1;
      uint64_t OBE2:1;
      uint64_t OBE3:1;
      uint64_t OBE4:1;
      uint64_t OBE5:1;
      uint64_t OBE6:1;
      uint64_t OBE7:1;
      uint64_t OBE8:1;
      uint64_t OBE9:1;
      uint64_t OBE10:1;
      uint64_t OBE11:1;
      uint64_t OBE12:1;
      uint64_t OBE13:1;
      uint64_t OBE14:1;
      uint64_t OBE15:1;
      uint64_t OBE16:1;
      uint64_t OBE17:1;
      uint64_t OBE18:1;
      uint64_t OBE19:1;
      uint64_t OBE20:1;
      uint64_t OBE21:1;
      uint64_t OBE22:1;
      uint64_t OBE23:1;
      uint64_t OBE24:1;
      uint64_t OBE25:1;
      uint64_t OBE26:1;
      uint64_t OBE27:1;
      uint64_t OBE28:1;
      uint64_t OBE29:1;
      uint64_t OBE30:1;
      uint64_t OBE31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GRP1_OBE1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OBE32:1;
      uint64_t OBE33:1;
      uint64_t OBE34:1;
      uint64_t OBE35:1;
      uint64_t OBE36:1;
      uint64_t OBE37:1;
      uint64_t OBE38:1;
      uint64_t OBE39:1;
      uint64_t OBE40:1;
      uint64_t OBE41:1;
      uint64_t OBE42:1;
      uint64_t OBE43:1;
      uint64_t OBE44:1;
      uint64_t OBE45:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GRP1_OBE2;

  uint8_t res1[72];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OBE0:1;
      uint64_t OBE1:1;
      uint64_t OBE2:1;
      uint64_t OBE3:1;
      uint64_t OBE4:1;
      uint64_t OBE5:1;
      uint64_t OBE6:1;
      uint64_t OBE7:1;
      uint64_t OBE8:1;
      uint64_t OBE9:1;
      uint64_t OBE10:1;
      uint64_t OBE11:1;
      uint64_t OBE12:1;
      uint64_t OBE13:1;
      uint64_t OBE14:1;
      uint64_t OBE15:1;
      uint64_t OBE16:1;
      uint64_t OBE17:1;
      uint64_t OBE18:1;
      uint64_t OBE19:1;
      uint64_t OBE20:1;
      uint64_t OBE21:1;
      uint64_t OBE22:1;
      uint64_t OBE23:1;
      uint64_t OBE24:1;
      uint64_t OBE25:1;
      uint64_t OBE26:1;
      uint64_t OBE27:1;
      uint64_t OBE28:1;
      uint64_t OBE29:1;
      uint64_t OBE30:1;
      uint64_t OBE31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GRP2_OBE1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OBE32:1;
      uint64_t OBE33:1;
      uint64_t OBE34:1;
      uint64_t OBE35:1;
      uint64_t OBE36:1;
      uint64_t OBE37:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GRP2_OBE2;

};

#define TSPC (*(volatile struct TSPC_tag *) 0x402c4000)

struct SIRC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATUS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t STANDBY_ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MISCELLANEOUS_IN;

};

#define SIRC (*(volatile struct SIRC_tag *) 0x402c8004)

struct SXOSC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t OSCON:1;
      uint64_t reservedSpace0:15;
      uint64_t EOCV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SXOSC_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:31;
      uint64_t OSC_STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SXOSC_STAT;

};

#define SXOSC (*(volatile struct SXOSC_tag *) 0x402cc000)

struct FIRC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATUS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Status_Register;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STDBY_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STDBY_ENABLE;

};

#define FIRC (*(volatile struct FIRC_tag *) 0x402d0004)

struct FXOSC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t OSCON:1;
      uint64_t reservedSpace0:3;
      uint64_t GM_SEL:4;
      uint64_t reservedSpace1:8;
      uint64_t EOCV:8;
      uint64_t COMP_EN:1;
      uint64_t reservedSpace2:6;
      uint64_t OSC_BYP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:31;
      uint64_t OSC_STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

};

#define FXOSC (*(volatile struct FXOSC_tag *) 0x402d4000)

struct MC_CGM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SDUR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCFS_SDUR;

  uint8_t res0[84];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RATE:8;
      uint64_t reservedSpace0:8;
      uint64_t INIT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCFS_DIVC8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVE:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCFS_DIVE8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVS:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCFS_DIVS8;

  uint8_t res1[668];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RAMPUP:1;
      uint64_t RAMPDOWN:1;
      uint64_t CLK_SW:1;
      uint64_t SAFE_SW:1;
      uint64_t reservedSpace0:20;
      uint64_t SELCTL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_0_CSC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RAMPUP:1;
      uint64_t RAMPDOWN:1;
      uint64_t CLK_SW:1;
      uint64_t SAFE_SW:1;
      uint64_t reservedSpace0:12;
      uint64_t SWIP:1;
      uint64_t SWTRG:3;
      uint64_t reservedSpace1:4;
      uint64_t SELSTAT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_0_CSS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIV:3;
      uint64_t reservedSpace1:12;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_0_DC_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIV:3;
      uint64_t reservedSpace1:12;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_0_DC_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIV:4;
      uint64_t reservedSpace1:11;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_0_DC_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIV:3;
      uint64_t reservedSpace1:12;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_0_DC_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIV:3;
      uint64_t reservedSpace1:12;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_0_DC_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIV:3;
      uint64_t reservedSpace1:12;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_0_DC_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIV:3;
      uint64_t reservedSpace1:12;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_0_DC_6;

