iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
  uint8_t res12[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV_STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_10_DIV_UPD_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t CG:1;
      uint64_t FCG:1;
      uint64_t reservedSpace1:20;
      uint64_t SELCTL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_11_CSC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t GRIP:1;
      uint64_t CS:1;
      uint64_t reservedSpace1:6;
      uint64_t SELSTAT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_11_CSS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIV:3;
      uint64_t reservedSpace1:12;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_11_DC_0;

  uint8_t res13[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV_STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_11_DIV_UPD_STAT;

};

#define MC_CGM (*(volatile struct MC_CGM_tag *) 0x402d8000)

struct MC_ME_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL_KEY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEST_RST:1;
      uint64_t FUNC_RST:1;
      uint64_t reservedSpace0:13;
      uint64_t STANDBY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MODE_CONF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE_UPD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MODE_UPD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PREV_MODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MODE_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIDX:3;
      uint64_t reservedSpace0:5;
      uint64_t PIDX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAIN_COREID;

  uint8_t res0[236];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRTN0_PCONF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCUD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRTN0_PUPD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRTN0_STAT;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCK32:1;
      uint64_t BLOCK33:1;
      uint64_t BLOCK34:1;
      uint64_t BLOCK35:1;
      uint64_t BLOCK36:1;
      uint64_t reservedSpace0:1;
      uint64_t BLOCK38:1;
      uint64_t BLOCK39:1;
      uint64_t BLOCK40:1;
      uint64_t BLOCK41:1;
      uint64_t BLOCK42:1;
      uint64_t reservedSpace1:1;
      uint64_t BLOCK44:1;
      uint64_t BLOCK45:1;
      uint64_t BLOCK46:1;
      uint64_t BLOCK47:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRTN0_COFB1_STAT;

  uint8_t res2[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REQ32:1;
      uint64_t REQ33:1;
      uint64_t REQ34:1;
      uint64_t REQ35:1;
      uint64_t REQ36:1;
      uint64_t reservedSpace0:1;
      uint64_t REQ38:1;
      uint64_t REQ39:1;
      uint64_t REQ40:1;
      uint64_t REQ41:1;
      uint64_t REQ42:1;
      uint64_t reservedSpace1:1;
      uint64_t REQ44:1;
      uint64_t REQ45:1;
      uint64_t REQ46:1;
      uint64_t REQ47:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRTN0_COFB1_CLKEN;

  uint8_t res3[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRTN0_CORE0_PCONF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCUPD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRTN0_CORE0_PUPD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCS:1;
      uint64_t reservedSpace0:30;
      uint64_t WFI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRTN0_CORE0_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t ADDR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRTN0_CORE0_ADDR;

  uint8_t res4[56];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCS:1;
      uint64_t reservedSpace0:30;
      uint64_t WFI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRTN0_CORE2_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t ADDR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRTN0_CORE2_ADDR;

  uint8_t res5[368];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRTN1_PCONF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCUD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRTN1_PUPD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRTN1_STAT;

  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCK0:1;
      uint64_t BLOCK1:1;
      uint64_t BLOCK2:1;
      uint64_t BLOCK3:1;
      uint64_t BLOCK4:1;
      uint64_t BLOCK5:1;
      uint64_t BLOCK6:1;
      uint64_t BLOCK7:1;
      uint64_t BLOCK8:1;
      uint64_t BLOCK9:1;
      uint64_t BLOCK10:1;
      uint64_t BLOCK11:1;
      uint64_t BLOCK12:1;
      uint64_t BLOCK13:1;
      uint64_t BLOCK14:1;
      uint64_t BLOCK15:1;
      uint64_t BLOCK16:1;
      uint64_t BLOCK17:1;
      uint64_t BLOCK18:1;
      uint64_t BLOCK19:1;
      uint64_t BLOCK20:1;
      uint64_t BLOCK21:1;
      uint64_t BLOCK22:1;
      uint64_t BLOCK23:1;
      uint64_t BLOCK24:1;
      uint64_t BLOCK25:1;
      uint64_t BLOCK26:1;
      uint64_t BLOCK27:1;
      uint64_t BLOCK28:1;
      uint64_t BLOCK29:1;
      uint64_t BLOCK30:1;
      uint64_t BLOCK31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRTN1_COFB0_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCK32:1;
      uint64_t BLOCK33:1;
      uint64_t BLOCK34:1;
      uint64_t BLOCK35:1;
      uint64_t BLOCK36:1;
      uint64_t BLOCK37:1;
      uint64_t BLOCK38:1;
      uint64_t BLOCK39:1;
      uint64_t BLOCK40:1;
      uint64_t BLOCK41:1;
      uint64_t BLOCK42:1;
      uint64_t BLOCK43:1;
      uint64_t reservedSpace0:1;
      uint64_t BLOCK45:1;
      uint64_t reservedSpace1:1;
      uint64_t BLOCK47:1;
      uint64_t reservedSpace2:1;
      uint64_t BLOCK49:1;
      uint64_t BLOCK50:1;
      uint64_t BLOCK51:1;
      uint64_t BLOCK52:1;
      uint64_t BLOCK53:1;
      uint64_t BLOCK54:1;
      uint64_t BLOCK55:1;
      uint64_t BLOCK56:1;
      uint64_t reservedSpace3:1;
      uint64_t BLOCK58:1;
      uint64_t BLOCK59:1;
      uint64_t BLOCK60:1;
      uint64_t reservedSpace4:2;
      uint64_t BLOCK63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRTN1_COFB1_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t BLOCK65:1;
      uint64_t BLOCK66:1;
      uint64_t BLOCK67:1;
      uint64_t BLOCK68:1;
      uint64_t BLOCK69:1;
      uint64_t BLOCK70:1;
      uint64_t reservedSpace1:2;
      uint64_t BLOCK73:1;
      uint64_t BLOCK74:1;
      uint64_t BLOCK75:1;
      uint64_t BLOCK76:1;
      uint64_t BLOCK77:1;
      uint64_t BLOCK78:1;
      uint64_t BLOCK79:1;
      uint64_t BLOCK80:1;
      uint64_t BLOCK81:1;
      uint64_t reservedSpace2:2;
      uint64_t BLOCK84:1;
      uint64_t BLOCK85:1;
      uint64_t BLOCK86:1;
      uint64_t BLOCK87:1;
      uint64_t BLOCK88:1;
      uint64_t BLOCK89:1;
      uint64_t reservedSpace3:1;
      uint64_t BLOCK91:1;
      uint64_t BLOCK92:1;
      uint64_t BLOCK93:1;
      uint64_t reservedSpace4:1;
      uint64_t BLOCK95:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRTN1_COFB2_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCK96:1;
      uint64_t BLOCK97:1;
      uint64_t BLOCK98:1;
      uint64_t BLOCK99:1;
      uint64_t reservedSpace0:1;
      uint64_t BLOCK101:1;
      uint64_t BLOCK102:1;
      uint64_t BLOCK103:1;
      uint64_t BLOCK104:1;
      uint64_t BLOCK105:1;
      uint64_t BLOCK106:1;
      uint64_t BLOCK107:1;
      uint64_t BLOCK108:1;
      uint64_t reservedSpace1:1;
      uint64_t BLOCK110:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRTN1_COFB3_STAT;

  uint8_t res7[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t REQ3:1;
      uint64_t REQ4:1;
      uint64_t REQ5:1;
      uint64_t REQ6:1;
      uint64_t REQ7:1;
      uint64_t REQ8:1;
      uint64_t REQ9:1;
      uint64_t REQ10:1;
      uint64_t REQ11:1;
      uint64_t REQ12:1;
      uint64_t REQ13:1;
      uint64_t REQ14:1;
      uint64_t REQ15:1;
      uint64_t reservedSpace1:5;
      uint64_t REQ21:1;
      uint64_t REQ22:1;
      uint64_t REQ23:1;
      uint64_t REQ24:1;
      uint64_t reservedSpace2:3;
      uint64_t REQ28:1;
      uint64_t REQ29:1;
      uint64_t reservedSpace3:1;
      uint64_t REQ31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRTN1_COFB0_CLKEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REQ32:1;
      uint64_t REQ33:1;
      uint64_t REQ34:1;
      uint64_t reservedSpace0:7;
      uint64_t REQ42:1;
      uint64_t reservedSpace1:2;
      uint64_t REQ45:1;
      uint64_t reservedSpace2:1;
      uint64_t REQ47:1;
      uint64_t reservedSpace3:1;
      uint64_t REQ49:1;
      uint64_t reservedSpace4:1;
      uint64_t REQ51:1;
      uint64_t reservedSpace5:1;
      uint64_t REQ53:1;
      uint64_t reservedSpace6:2;
      uint64_t REQ56:1;
      uint64_t reservedSpace7:6;
      uint64_t REQ63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRTN1_COFB1_CLKEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t REQ65:1;
      uint64_t REQ66:1;
      uint64_t REQ67:1;
      uint64_t REQ68:1;
      uint64_t REQ69:1;
      uint64_t REQ70:1;
      uint64_t reservedSpace1:2;
      uint64_t REQ73:1;
      uint64_t REQ74:1;
      uint64_t REQ75:1;
      uint64_t REQ76:1;
      uint64_t REQ77:1;
      uint64_t REQ78:1;
      uint64_t REQ79:1;
      uint64_t REQ80:1;
      uint64_t REQ81:1;
      uint64_t reservedSpace2:2;
      uint64_t REQ84:1;
      uint64_t REQ85:1;
      uint64_t REQ86:1;
      uint64_t REQ87:1;
      uint64_t REQ88:1;
      uint64_t REQ89:1;
      uint64_t reservedSpace3:1;
      uint64_t REQ91:1;
      uint64_t REQ92:1;
      uint64_t REQ93:1;
      uint64_t reservedSpace4:1;
      uint64_t REQ95:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRTN1_COFB2_CLKEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REQ96:1;
      uint64_t reservedSpace0:5;
      uint64_t REQ102:1;
      uint64_t reservedSpace1:1;
      uint64_t REQ104:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRTN1_COFB3_CLKEN;

  uint8_t res8[448];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRTN2_PCONF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCUD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRTN2_PUPD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRTN2_STAT;

  uint8_t res9[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCK0:1;
      uint64_t BLOCK1:1;
      uint64_t reservedSpace0:2;
      uint64_t BLOCK4:1;
      uint64_t BLOCK5:1;
      uint64_t BLOCK6:1;
      uint64_t BLOCK7:1;
      uint64_t BLOCK8:1;
      uint64_t BLOCK9:1;
      uint64_t BLOCK10:1;
      uint64_t BLOCK11:1;
      uint64_t BLOCK12:1;
      uint64_t BLOCK13:1;
      uint64_t BLOCK14:1;
      uint64_t BLOCK15:1;
      uint64_t BLOCK16:1;
      uint64_t BLOCK17:1;
      uint64_t BLOCK18:1;
      uint64_t BLOCK19:1;
      uint64_t BLOCK20:1;
      uint64_t BLOCK21:1;
      uint64_t BLOCK22:1;
      uint64_t BLOCK23:1;
      uint64_t BLOCK24:1;
      uint64_t BLOCK25:1;
      uint64_t reservedSpace1:3;
      uint64_t BLOCK29:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRTN2_COFB0_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCK32:1;
      uint64_t reservedSpace0:2;
      uint64_t BLOCK35:1;
      uint64_t BLOCK36:1;
      uint64_t BLOCK37:1;
      uint64_t BLOCK38:1;
      uint64_t BLOCK39:1;
      uint64_t BLOCK40:1;
      uint64_t BLOCK41:1;
      uint64_t BLOCK42:1;
      uint64_t reservedSpace1:4;
      uint64_t BLOCK47:1;
      uint64_t BLOCK48:1;
      uint64_t reservedSpace2:2;
      uint64_t BLOCK51:1;
      uint64_t reservedSpace3:3;
      uint64_t BLOCK55:1;
      uint64_t reservedSpace4:2;
      uint64_t BLOCK58:1;
      uint64_t BLOCK59:1;
      uint64_t reservedSpace5:2;
      uint64_t BLOCK62:1;
      uint64_t BLOCK63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRTN2_COFB1_STAT;

  uint8_t res10[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t REQ4:1;
      uint64_t REQ5:1;
      uint64_t REQ6:1;
      uint64_t REQ7:1;
      uint64_t REQ8:1;
      uint64_t REQ9:1;
      uint64_t REQ10:1;
      uint64_t REQ11:1;
      uint64_t REQ12:1;
      uint64_t REQ13:1;
      uint64_t REQ14:1;
      uint64_t REQ15:1;
      uint64_t REQ16:1;
      uint64_t REQ17:1;
      uint64_t REQ18:1;
      uint64_t REQ19:1;
      uint64_t REQ20:1;
      uint64_t REQ21:1;
      uint64_t REQ22:1;
      uint64_t REQ23:1;
      uint64_t REQ24:1;
      uint64_t reservedSpace1:4;
      uint64_t REQ29:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRTN2_COFB0_CLKEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REQ32:1;
      uint64_t reservedSpace0:2;
      uint64_t REQ35:1;
      uint64_t REQ36:1;
      uint64_t REQ37:1;
      uint64_t REQ38:1;
      uint64_t REQ39:1;
      uint64_t REQ40:1;
      uint64_t REQ41:1;
      uint64_t REQ42:1;
      uint64_t reservedSpace1:4;
      uint64_t REQ47:1;
      uint64_t REQ48:1;
      uint64_t reservedSpace2:2;
      uint64_t REQ51:1;
      uint64_t reservedSpace3:3;
      uint64_t REQ55:1;
      uint64_t reservedSpace4:2;
      uint64_t REQ58:1;
      uint64_t reservedSpace5:3;
      uint64_t REQ62:1;
      uint64_t REQ63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRTN2_COFB1_CLKEN;

