iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
};

#define MC_ME (*(volatile struct MC_ME_tag *) 0x402dc000)

struct PLL_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:31;
      uint64_t PLLPD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t LOCK:1;
      uint64_t LOL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFI:8;
      uint64_t reservedSpace0:4;
      uint64_t RDIV:3;
      uint64_t reservedSpace1:10;
      uint64_t ODIV2:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLDV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STEPNO:11;
      uint64_t reservedSpace0:5;
      uint64_t STEPSIZE:10;
      uint64_t reservedSpace1:3;
      uint64_t SPREADCTL:1;
      uint64_t SSCGBYP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLFM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFN:15;
      uint64_t reservedSpace0:13;
      uint64_t SDM3:1;
      uint64_t SDM2:1;
      uint64_t SDMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLFD;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:7;
      uint64_t ULKCTL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLCAL2;

  uint8_t res1[100];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIV:4;
      uint64_t reservedSpace1:11;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLODIV__0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIV:4;
      uint64_t reservedSpace1:11;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLODIV__1;

};

#define PLL (*(volatile struct PLL_tag *) 0x402e0000)

struct PMC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t HVDAF:1;
      uint64_t HVDBF:1;
      uint64_t HVD25F:1;
      uint64_t HVD11F:1;
      uint64_t LVD5AF:1;
      uint64_t LVD15F:1;
      uint64_t reservedSpace0:2;
      uint64_t HVDAS:1;
      uint64_t HVDBS:1;
      uint64_t HVD25S:1;
      uint64_t HVD11S:1;
      uint64_t LVD5AS:1;
      uint64_t LVD15S:1;
      uint64_t reservedSpace1:2;
      uint64_t LVRAF:1;
      uint64_t LVRALPF:1;
      uint64_t LVRBF:1;
      uint64_t LVRBLPF:1;
      uint64_t LVR25F:1;
      uint64_t LVR25LPF:1;
      uint64_t LVR11F:1;
      uint64_t LVR11LPF:1;
      uint64_t GNG25OSCF:1;
      uint64_t GNG11OSCF:1;
      uint64_t reservedSpace2:5;
      uint64_t PORF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LVSC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LMEN:1;
      uint64_t LMBCTLEN:1;
      uint64_t FASTREC:1;
      uint64_t LPM25EN:1;
      uint64_t LVRBLPEN:1;
      uint64_t reservedSpace0:3;
      uint64_t HVDIE:1;
      uint64_t LVDIE:1;
      uint64_t reservedSpace1:6;
      uint64_t LMAUTOEN:1;
      uint64_t LMSTAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LMFEAT:1;
      uint64_t reservedSpace0:15;
      uint64_t MINOR:8;
      uint64_t MAJOR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VERID;

};

#define PMC (*(volatile struct PMC_tag *) 0x402e8000)

struct FLASH_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EHV:1;
      uint64_t reservedSpace0:3;
      uint64_t ERS:1;
      uint64_t ESS:1;
      uint64_t reservedSpace1:2;
      uint64_t PGM:1;
      uint64_t reservedSpace2:3;
      uint64_t WDIE:1;
      uint64_t reservedSpace3:2;
      uint64_t PECIE:1;
      uint64_t PEID:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RE:1;
      uint64_t reservedSpace0:7;
      uint64_t TSPELOCK:1;
      uint64_t EPEG:1;
      uint64_t reservedSpace1:2;
      uint64_t WDI:1;
      uint64_t reservedSpace2:1;
      uint64_t PEG:1;
      uint64_t DONE:1;
      uint64_t PES:1;
      uint64_t PEP:1;
      uint64_t reservedSpace3:2;
      uint64_t RWE:1;
      uint64_t reservedSpace4:3;
      uint64_t RRE:1;
      uint64_t RVE:1;
      uint64_t reservedSpace5:2;
      uint64_t EEE:1;
      uint64_t AEE:1;
      uint64_t SBC:1;
      uint64_t EER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCRS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:6;
      uint64_t n256K:2;
      uint64_t reservedSpace1:6;
      uint64_t n512K:2;
      uint64_t reservedSpace2:5;
      uint64_t n1M:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCRE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t RWSC:5;
      uint64_t reservedSpace1:2;
      uint64_t RWSL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t ADDR:18;
      uint64_t A0:1;
      uint64_t A1:1;
      uint64_t A2:1;
      uint64_t A3:1;
      uint64_t A4:1;
      uint64_t A5:1;
      uint64_t reservedSpace1:6;
      uint64_t SAD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t PEADDR:14;
      uint64_t PEA0:1;
      uint64_t PEA1:1;
      uint64_t PEA2:1;
      uint64_t PEA3:1;
      uint64_t PEA4:1;
      uint64_t PEA5:1;
      uint64_t reservedSpace1:6;
      uint64_t PEASAD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEADR;

  uint8_t res0[56];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPELOCK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPELOCK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSPELOCK:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSPELOCK;

  uint8_t res1[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XSPELOCK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XSPELOCK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XSSPELOCK:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XSSPELOCK;

