iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
  uint8_t res2[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AID:1;
      uint64_t AIE:1;
      uint64_t AIS:1;
      uint64_t reservedSpace0:1;
      uint64_t MRV:1;
      uint64_t MRE:1;
      uint64_t AISUS:1;
      uint64_t reservedSpace1:1;
      uint64_t AIBPE:1;
      uint64_t NAIBP:1;
      uint64_t reservedSpace2:2;
      uint64_t EIE:1;
      uint64_t EDIE:1;
      uint64_t AEIE:1;
      uint64_t RRIE:1;
      uint64_t reservedSpace3:14;
      uint64_t SBCE:1;
      uint64_t UTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UM_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UM_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UM_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UM_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UM_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UM_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UM_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UM_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UM_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UM9;

  uint8_t res3[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EDATAC:8;
      uint64_t reservedSpace0:16;
      uint64_t ED0:1;
      uint64_t ED1:1;
      uint64_t ED2:1;
      uint64_t ED3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EDDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EDDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UD4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EDDATAC:8;
      uint64_t reservedSpace0:16;
      uint64_t EDD0:1;
      uint64_t EDD1:1;
      uint64_t EDD2:1;
      uint64_t EDD3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UD5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AEI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AEI:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XEHV:1;
      uint64_t reservedSpace0:7;
      uint64_t XPGM:1;
      uint64_t XEPEG:1;
      uint64_t reservedSpace1:1;
      uint64_t XWDIE:1;
      uint64_t XWDI:1;
      uint64_t XDOK:1;
      uint64_t XPEG:1;
      uint64_t XDONE:1;
      uint64_t XPEID:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XMCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t XPEADDR:14;
      uint64_t XPEA0:1;
      uint64_t XPEA1:1;
      uint64_t XPEA2:1;
      uint64_t XPEA3:1;
      uint64_t XPEA4:1;
      uint64_t XPEA5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XPEADR;

  uint8_t res4[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_31;

