iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
  uint8_t res6[240];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENPRESDIV:10;
      uint64_t reservedSpace0:6;
      uint64_t EDPRESDIV:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EPRS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NTSEG1:8;
      uint64_t reservedSpace0:4;
      uint64_t NTSEG2:7;
      uint64_t reservedSpace1:3;
      uint64_t NRJW:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENCBT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTSEG1:5;
      uint64_t reservedSpace0:7;
      uint64_t DTSEG2:4;
      uint64_t reservedSpace1:6;
      uint64_t DRJW:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EDCBT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ETDCVAL:8;
      uint64_t reservedSpace0:7;
      uint64_t ETDCFAIL:1;
      uint64_t ETDCOFF:7;
      uint64_t reservedSpace1:7;
      uint64_t TDMDIS:1;
      uint64_t ETDCEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETDC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDCVAL:6;
      uint64_t reservedSpace0:2;
      uint64_t TDCOFF:5;
      uint64_t reservedSpace1:1;
      uint64_t TDCFAIL:1;
      uint64_t TDCEN:1;
      uint64_t MBDSR0:2;
      uint64_t reservedSpace2:1;
      uint64_t MBDSR1:2;
      uint64_t reservedSpace3:1;
      uint64_t MBDSR2:2;
      uint64_t reservedSpace4:7;
      uint64_t FDRATE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FPSEG2:3;
      uint64_t reservedSpace0:2;
      uint64_t FPSEG1:3;
      uint64_t reservedSpace1:2;
      uint64_t FPROPSEG:5;
      uint64_t reservedSpace2:1;
      uint64_t FRJW:3;
      uint64_t reservedSpace3:1;
      uint64_t FPRESDIV:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCBT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD_TXCRC:21;
      uint64_t reservedSpace0:3;
      uint64_t FD_MBCRC:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERFWM:5;
      uint64_t reservedSpace0:3;
      uint64_t NFE:6;
      uint64_t reservedSpace1:2;
      uint64_t NEXIF:7;
      uint64_t reservedSpace2:3;
      uint64_t DMALW:5;
      uint64_t ERFEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:28;
      uint64_t ERFDAIE:1;
      uint64_t ERFWMIIE:1;
      uint64_t ERFOVFIE:1;
      uint64_t ERFUFWIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFIER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERFEL:6;
      uint64_t reservedSpace0:10;
      uint64_t ERFF:1;
      uint64_t ERFE:1;
      uint64_t reservedSpace1:9;
      uint64_t ERFCLR:1;
      uint64_t ERFDA:1;
      uint64_t ERFWMI:1;
      uint64_t ERFOVF:1;
      uint64_t ERFUFW:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFSR;

  uint8_t res7[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_32;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_33;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_35;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_36;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_37;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_38;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_39;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_40;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_41;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_42;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_43;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_44;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_45;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_46;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_47;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_48;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_49;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_50;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_51;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_52;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_53;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_54;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_55;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_56;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_57;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_58;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_59;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_60;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_61;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_62;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_63;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_64;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_65;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_66;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_67;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_68;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_69;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_70;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_71;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_72;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_73;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_74;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_75;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_76;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_77;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_78;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_79;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_80;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_81;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_82;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_83;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_84;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_85;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_86;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_87;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_88;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_89;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_90;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_91;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_92;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_93;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_94;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_95;

  uint8_t res8[8784];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_32;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_33;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_35;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_36;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_37;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_38;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_39;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_40;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_41;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_42;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_43;

