iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_44;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_45;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_46;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_47;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_48;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_49;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_50;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_51;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_52;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_53;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_54;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_55;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_56;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_57;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_58;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_59;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_60;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_61;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_62;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_63;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_64;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_65;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_66;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_67;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_68;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_69;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_70;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_71;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_72;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_73;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_74;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_75;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_76;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_77;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_78;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_79;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_80;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_81;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_82;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_83;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_84;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_85;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_86;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_87;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_88;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_89;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_90;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_91;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_92;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_93;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_94;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_95;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_96;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_97;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_98;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_99;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_100;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_101;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_102;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_103;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_104;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_105;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_106;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_107;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_108;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_109;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_110;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_111;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_112;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_113;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_114;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_115;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_116;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_117;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_118;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_119;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_120;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_121;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_122;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_123;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_124;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_125;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_126;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERFFEL_127;

