iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
  uint8_t res6[240];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENPRESDIV:10;
      uint64_t reservedSpace0:6;
      uint64_t EDPRESDIV:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EPRS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NTSEG1:8;
      uint64_t reservedSpace0:4;
      uint64_t NTSEG2:7;
      uint64_t reservedSpace1:3;
      uint64_t NRJW:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENCBT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTSEG1:5;
      uint64_t reservedSpace0:7;
      uint64_t DTSEG2:4;
      uint64_t reservedSpace1:6;
      uint64_t DRJW:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EDCBT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ETDCVAL:8;
      uint64_t reservedSpace0:7;
      uint64_t ETDCFAIL:1;
      uint64_t ETDCOFF:7;
      uint64_t reservedSpace1:7;
      uint64_t TDMDIS:1;
      uint64_t ETDCEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETDC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDCVAL:6;
      uint64_t reservedSpace0:2;
      uint64_t TDCOFF:5;
      uint64_t reservedSpace1:1;
      uint64_t TDCFAIL:1;
      uint64_t TDCEN:1;
      uint64_t MBDSR0:2;
      uint64_t reservedSpace2:13;
      uint64_t FDRATE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FPSEG2:3;
      uint64_t reservedSpace0:2;
      uint64_t FPSEG1:3;
      uint64_t reservedSpace1:2;
      uint64_t FPROPSEG:5;
      uint64_t reservedSpace2:1;
      uint64_t FRJW:3;
      uint64_t reservedSpace3:1;
      uint64_t FPRESDIV:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCBT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD_TXCRC:21;
      uint64_t reservedSpace0:3;
      uint64_t FD_MBCRC:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCRC;

  uint8_t res7[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_31;

