iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
};

#define CAN_4 (*(volatile struct CAN_4_tag *) 0x40314000)

struct CAN_5_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXMB:7;
      uint64_t reservedSpace0:1;
      uint64_t IDAM:2;
      uint64_t reservedSpace1:1;
      uint64_t FDEN:1;
      uint64_t AEN:1;
      uint64_t LPRIOEN:1;
      uint64_t reservedSpace2:1;
      uint64_t DMA:1;
      uint64_t IRMQ:1;
      uint64_t SRXDIS:1;
      uint64_t reservedSpace3:2;
      uint64_t LPMACK:1;
      uint64_t WRNEN:1;
      uint64_t reservedSpace4:1;
      uint64_t SUPV:1;
      uint64_t FRZACK:1;
      uint64_t SOFTRST:1;
      uint64_t reservedSpace5:1;
      uint64_t NOTRDY:1;
      uint64_t HALT:1;
      uint64_t RFEN:1;
      uint64_t FRZ:1;
      uint64_t MDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROPSEG:3;
      uint64_t LOM:1;
      uint64_t LBUF:1;
      uint64_t TSYN:1;
      uint64_t BOFFREC:1;
      uint64_t SMP:1;
      uint64_t reservedSpace0:2;
      uint64_t RWRNMSK:1;
      uint64_t TWRNMSK:1;
      uint64_t LPB:1;
      uint64_t reservedSpace1:1;
      uint64_t ERRMSK:1;
      uint64_t BOFFMSK:1;
      uint64_t PSEG2:3;
      uint64_t PSEG1:3;
      uint64_t RJW:2;
      uint64_t PRESDIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXMGMASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX14M:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX14MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX15M:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX15MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXERRCNT:8;
      uint64_t RXERRCNT:8;
      uint64_t TXERRCNT_FAST:8;
      uint64_t RXERRCNT_FAST:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t ERRINT:1;
      uint64_t BOFFINT:1;
      uint64_t RX:1;
      uint64_t FLTCONF:2;
      uint64_t TX:1;
      uint64_t IDLE:1;
      uint64_t RXWRN:1;
      uint64_t TXWRN:1;
      uint64_t STFERR:1;
      uint64_t FRMERR:1;
      uint64_t CRCERR:1;
      uint64_t ACKERR:1;
      uint64_t BIT0ERR:1;
      uint64_t BIT1ERR:1;
      uint64_t RWRNINT:1;
      uint64_t TWRNINT:1;
      uint64_t SYNCH:1;
      uint64_t BOFFDONEINT:1;
      uint64_t ERRINT_FAST:1;
      uint64_t ERROVR:1;
      uint64_t reservedSpace1:4;
      uint64_t STFERR_FAST:1;
      uint64_t FRMERR_FAST:1;
      uint64_t CRCERR_FAST:1;
      uint64_t reservedSpace2:1;
      uint64_t BIT0ERR_FAST:1;
      uint64_t BIT1ERR_FAST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESR1;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUF31TO0M:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMASK1;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUF0I:1;
      uint64_t BUF4TO1I:4;
      uint64_t BUF5I:1;
      uint64_t BUF6I:1;
      uint64_t BUF7I:1;
      uint64_t BUF31TO8I:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFLAG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:6;
      uint64_t TSTAMPCAP:2;
      uint64_t MBTSBASE:2;
      uint64_t reservedSpace1:1;
      uint64_t EDFLTDIS:1;
      uint64_t ISOCANFDEN:1;
      uint64_t BTE:1;
      uint64_t PREXCEN:1;
      uint64_t TIMER_SRC:1;
      uint64_t EACEN:1;
      uint64_t RRS:1;
      uint64_t MRP:1;
      uint64_t TASD:5;
      uint64_t RFFN:4;
      uint64_t WRMFRZ:1;
      uint64_t ECRWRE:1;
      uint64_t BOFFDONEMSK:1;
      uint64_t ERRMSK_FAST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:13;
      uint64_t IMB:1;
      uint64_t VPS:1;
      uint64_t reservedSpace1:1;
      uint64_t LPTM:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESR2;

  uint8_t res3[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXCRC:15;
      uint64_t reservedSpace0:1;
      uint64_t MBCRC:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FGM:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXFGMASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDHIT:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXFIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EPSEG2:5;
      uint64_t EPSEG1:5;
      uint64_t EPROPSEG:6;
      uint64_t ERJW:5;
      uint64_t EPRESDIV:10;
      uint64_t BTF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CBT;

  uint8_t res4[2092];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXIMR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXIMR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXIMR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXIMR_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXIMR_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXIMR_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXIMR_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXIMR_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXIMR_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXIMR_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXIMR_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXIMR_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXIMR_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXIMR_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXIMR_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXIMR_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXIMR_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXIMR_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXIMR_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXIMR_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXIMR_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXIMR_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXIMR_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXIMR_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXIMR_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXIMR_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXIMR_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXIMR_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXIMR_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXIMR_29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXIMR_30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXIMR_31;

  uint8_t res5[480];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:7;
      uint64_t NCEFAFRZ:1;
      uint64_t ECCDIS:1;
      uint64_t RERRDIS:1;
      uint64_t reservedSpace1:3;
      uint64_t EXTERRIE:1;
      uint64_t FAERRIE:1;
      uint64_t HAERRIE:1;
      uint64_t CEI_MSK:1;
      uint64_t reservedSpace2:1;
      uint64_t FANCEI_MSK:1;
      uint64_t HANCEI_MSK:1;
      uint64_t reservedSpace3:11;
      uint64_t ECRWRDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MECR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INJADDR_L:2;
      uint64_t INJADDR_H:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERRIAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DFLIP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERRIDPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PFLIP0:5;
      uint64_t reservedSpace0:3;
      uint64_t PFLIP1:5;
      uint64_t reservedSpace1:3;
      uint64_t PFLIP2:5;
      uint64_t reservedSpace2:3;
      uint64_t PFLIP3:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERRIPPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERRADDR:14;
      uint64_t reservedSpace0:2;
      uint64_t SAID:3;
      uint64_t reservedSpace1:5;
      uint64_t NCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RERRAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RERRDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYND0:5;
      uint64_t reservedSpace0:2;
      uint64_t BE0:1;
      uint64_t SYND1:5;
      uint64_t reservedSpace1:2;
      uint64_t BE1:1;
      uint64_t SYND2:5;
      uint64_t reservedSpace2:2;
      uint64_t BE2:1;
      uint64_t SYND3:5;
      uint64_t reservedSpace3:2;
      uint64_t BE3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RERRSYNR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEIOF:1;
      uint64_t reservedSpace0:1;
      uint64_t FANCEIOF:1;
      uint64_t HANCEIOF:1;
      uint64_t reservedSpace1:12;
      uint64_t CEIF:1;
      uint64_t reservedSpace2:1;
      uint64_t FANCEIF:1;
      uint64_t HANCEIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERRSR;

