iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
};

#define LPUART_14 (*(volatile struct LPUART_14_tag *) 0x404a4000)

struct LPUART_15_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEATURE:16;
      uint64_t MINOR:8;
      uint64_t MAJOR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VERID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXFIFO:8;
      uint64_t RXFIFO:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PARAM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t RST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GLOBAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PINCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SBR:13;
      uint64_t SBNS:1;
      uint64_t RXEDGIE:1;
      uint64_t LBKDIE:1;
      uint64_t RESYNCDIS:1;
      uint64_t BOTHEDGE:1;
      uint64_t MATCFG:2;
      uint64_t reservedSpace0:1;
      uint64_t RDMAE:1;
      uint64_t reservedSpace1:1;
      uint64_t TDMAE:1;
      uint64_t OSR:5;
      uint64_t M10:1;
      uint64_t MAEN2:1;
      uint64_t MAEN1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BAUD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LBKFE:1;
      uint64_t AME:1;
      uint64_t reservedSpace0:12;
      uint64_t MA2F:1;
      uint64_t MA1F:1;
      uint64_t PF:1;
      uint64_t FE:1;
      uint64_t NF:1;
      uint64_t OR:1;
      uint64_t IDLE:1;
      uint64_t RDRF:1;
      uint64_t TC:1;
      uint64_t TDRE:1;
      uint64_t RAF:1;
      uint64_t LBKDE:1;
      uint64_t BRK13:1;
      uint64_t RWUID:1;
      uint64_t RXINV:1;
      uint64_t MSBF:1;
      uint64_t RXEDGIF:1;
      uint64_t LBKDIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PT:1;
      uint64_t PE:1;
      uint64_t ILT:1;
      uint64_t WAKE:1;
      uint64_t M:1;
      uint64_t RSRC:1;
      uint64_t DOZEEN:1;
      uint64_t LOOPS:1;
      uint64_t IDLECFG:3;
      uint64_t M7:1;
      uint64_t reservedSpace0:2;
      uint64_t MA2IE:1;
      uint64_t MA1IE:1;
      uint64_t SBK:1;
      uint64_t RWU:1;
      uint64_t RE:1;
      uint64_t TE:1;
      uint64_t ILIE:1;
      uint64_t RIE:1;
      uint64_t TCIE:1;
      uint64_t TIE:1;
      uint64_t PEIE:1;
      uint64_t FEIE:1;
      uint64_t NEIE:1;
      uint64_t ORIE:1;
      uint64_t TXINV:1;
      uint64_t TXDIR:1;
      uint64_t R9T8:1;
      uint64_t R8T9:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R0T0:1;
      uint64_t R1T1:1;
      uint64_t R2T2:1;
      uint64_t R3T3:1;
      uint64_t R4T4:1;
      uint64_t R5T5:1;
      uint64_t R6T6:1;
      uint64_t R7T7:1;
      uint64_t R8T8:1;
      uint64_t R9T9:1;
      uint64_t LINBRK:1;
      uint64_t IDLINE:1;
      uint64_t RXEMPT:1;
      uint64_t FRETSC:1;
      uint64_t PARITYE:1;
      uint64_t NOISY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MA1:10;
      uint64_t reservedSpace0:6;
      uint64_t MA2:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATCH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXCTSE:1;
      uint64_t TXRTSE:1;
      uint64_t TXRTSPOL:1;
      uint64_t RXRTSE:1;
      uint64_t TXCTSC:1;
      uint64_t TXCTSSRC:1;
      uint64_t reservedSpace0:2;
      uint64_t RTSWATER:2;
      uint64_t reservedSpace1:6;
      uint64_t TNP:2;
      uint64_t IREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MODIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXFIFOSIZE:3;
      uint64_t RXFE:1;
      uint64_t TXFIFOSIZE:3;
      uint64_t TXFE:1;
      uint64_t RXUFE:1;
      uint64_t TXOFE:1;
      uint64_t RXIDEN:3;
      uint64_t reservedSpace0:1;
      uint64_t RXFLUSH:1;
      uint64_t TXFLUSH:1;
      uint64_t RXUF:1;
      uint64_t TXOF:1;
      uint64_t reservedSpace1:4;
      uint64_t RXEMPT:1;
      uint64_t TXEMPT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXWATER:2;
      uint64_t reservedSpace0:6;
      uint64_t TXCOUNT:3;
      uint64_t reservedSpace1:5;
      uint64_t RXWATER:2;
      uint64_t reservedSpace2:6;
      uint64_t RXCOUNT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WATER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATARO;

};

#define LPUART_15 (*(volatile struct LPUART_15_tag *) 0x404a8000)

struct LPI2C_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEATURE:16;
      uint64_t MINOR:8;
      uint64_t MAJOR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VERID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MTXFIFO:4;
      uint64_t reservedSpace0:4;
      uint64_t MRXFIFO:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PARAM;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MEN:1;
      uint64_t RST:1;
      uint64_t DOZEN:1;
      uint64_t DBGEN:1;
      uint64_t reservedSpace0:4;
      uint64_t RTF:1;
      uint64_t RRF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDF:1;
      uint64_t RDF:1;
      uint64_t reservedSpace0:6;
      uint64_t EPF:1;
      uint64_t SDF:1;
      uint64_t NDF:1;
      uint64_t ALF:1;
      uint64_t FEF:1;
      uint64_t PLTF:1;
      uint64_t DMF:1;
      uint64_t reservedSpace1:9;
      uint64_t MBF:1;
      uint64_t BBF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDIE:1;
      uint64_t RDIE:1;
      uint64_t reservedSpace0:6;
      uint64_t EPIE:1;
      uint64_t SDIE:1;
      uint64_t NDIE:1;
      uint64_t ALIE:1;
      uint64_t FEIE:1;
      uint64_t PLTIE:1;
      uint64_t DMIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDDE:1;
      uint64_t RDDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HREN:1;
      uint64_t HRPOL:1;
      uint64_t HRSEL:1;
      uint64_t reservedSpace0:5;
      uint64_t CIRFIFO:1;
      uint64_t RDMO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCFGR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRESCALE:3;
      uint64_t reservedSpace0:5;
      uint64_t AUTOSTOP:1;
      uint64_t IGNACK:1;
      uint64_t TIMECFG:1;
      uint64_t reservedSpace1:5;
      uint64_t MATCFG:3;
      uint64_t reservedSpace2:5;
      uint64_t PINCFG:3;
      uint64_t FRCHS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCFGR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUSIDLE:12;
      uint64_t reservedSpace0:4;
      uint64_t FILTSCL:4;
      uint64_t reservedSpace1:4;
      uint64_t FILTSDA:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCFGR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t PINLOW:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCFGR3;

  uint8_t res1[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH0:8;
      uint64_t reservedSpace0:8;
      uint64_t MATCH1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMR;

