iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLKLO:6;
      uint64_t reservedSpace0:2;
      uint64_t CLKHI:6;
      uint64_t reservedSpace1:2;
      uint64_t SETHOLD:6;
      uint64_t reservedSpace2:2;
      uint64_t DATAVD:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCCR0;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLKLO:6;
      uint64_t reservedSpace0:2;
      uint64_t CLKHI:6;
      uint64_t reservedSpace1:2;
      uint64_t SETHOLD:6;
      uint64_t reservedSpace2:2;
      uint64_t DATAVD:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCCR1;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXWATER:2;
      uint64_t reservedSpace0:14;
      uint64_t RXWATER:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MFCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXCOUNT:3;
      uint64_t reservedSpace0:13;
      uint64_t RXCOUNT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MFSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:8;
      uint64_t CMD:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MTDR;

  uint8_t res5[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:8;
      uint64_t reservedSpace0:6;
      uint64_t RXEMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRDR;

  uint8_t res6[156];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEN:1;
      uint64_t RST:1;
      uint64_t reservedSpace0:2;
      uint64_t FILTEN:1;
      uint64_t FILTDZ:1;
      uint64_t reservedSpace1:2;
      uint64_t RTF:1;
      uint64_t RRF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDF:1;
      uint64_t RDF:1;
      uint64_t AVF:1;
      uint64_t TAF:1;
      uint64_t reservedSpace0:4;
      uint64_t RSF:1;
      uint64_t SDF:1;
      uint64_t BEF:1;
      uint64_t FEF:1;
      uint64_t AM0F:1;
      uint64_t AM1F:1;
      uint64_t GCF:1;
      uint64_t SARF:1;
      uint64_t reservedSpace1:8;
      uint64_t SBF:1;
      uint64_t BBF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDIE:1;
      uint64_t RDIE:1;
      uint64_t AVIE:1;
      uint64_t TAIE:1;
      uint64_t reservedSpace0:4;
      uint64_t RSIE:1;
      uint64_t SDIE:1;
      uint64_t BEIE:1;
      uint64_t FEIE:1;
      uint64_t AM0IE:1;
      uint64_t AM1IE:1;
      uint64_t GCIE:1;
      uint64_t SARIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDDE:1;
      uint64_t RDDE:1;
      uint64_t AVDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDER;

  uint8_t res7[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADRSTALL:1;
      uint64_t RXSTALL:1;
      uint64_t TXDSTALL:1;
      uint64_t ACKSTALL:1;
      uint64_t reservedSpace0:4;
      uint64_t GCEN:1;
      uint64_t SAEN:1;
      uint64_t TXCFG:1;
      uint64_t RXCFG:1;
      uint64_t IGNACK:1;
      uint64_t HSMEN:1;
      uint64_t reservedSpace1:2;
      uint64_t ADDRCFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCFGR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLKHOLD:4;
      uint64_t reservedSpace0:4;
      uint64_t DATAVD:6;
      uint64_t reservedSpace1:2;
      uint64_t FILTSCL:4;
      uint64_t reservedSpace2:4;
      uint64_t FILTSDA:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCFGR2;

  uint8_t res8[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t ADDR0:10;
      uint64_t reservedSpace1:6;
      uint64_t ADDR1:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAMR;

  uint8_t res9[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RADDR:11;
      uint64_t reservedSpace0:3;
      uint64_t ANV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SASR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXNACK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAR;

  uint8_t res10[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STDR;

  uint8_t res11[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:8;
      uint64_t RADDR:3;
      uint64_t reservedSpace0:3;
      uint64_t RXEMPTY:1;
      uint64_t SOF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRDR;

};

#define LPI2C_1 (*(volatile struct LPI2C_1_tag *) 0x40354000)

struct LPSPI_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEATURE:16;
      uint64_t MINOR:8;
      uint64_t MAJOR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VERID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXFIFO:8;
      uint64_t RXFIFO:8;
      uint64_t PCSNUM:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PARAM;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MEN:1;
      uint64_t RST:1;
      uint64_t reservedSpace0:1;
      uint64_t DBGEN:1;
      uint64_t reservedSpace1:4;
      uint64_t RTF:1;
      uint64_t RRF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDF:1;
      uint64_t RDF:1;
      uint64_t reservedSpace0:6;
      uint64_t WCF:1;
      uint64_t FCF:1;
      uint64_t TCF:1;
      uint64_t TEF:1;
      uint64_t REF:1;
      uint64_t DMF:1;
      uint64_t reservedSpace1:10;
      uint64_t MBF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDIE:1;
      uint64_t RDIE:1;
      uint64_t reservedSpace0:6;
      uint64_t WCIE:1;
      uint64_t FCIE:1;
      uint64_t TCIE:1;
      uint64_t TEIE:1;
      uint64_t REIE:1;
      uint64_t DMIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDDE:1;
      uint64_t RDDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HREN:1;
      uint64_t HRPOL:1;
      uint64_t HRSEL:1;
      uint64_t HRDIR:1;
      uint64_t reservedSpace0:4;
      uint64_t CIRFIFO:1;
      uint64_t RDMO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASTER:1;
      uint64_t SAMPLE:1;
      uint64_t AUTOPCS:1;
      uint64_t NOSTALL:1;
      uint64_t PARTIAL:1;
      uint64_t reservedSpace0:3;
      uint64_t PCSPOL:8;
      uint64_t MATCFG:3;
      uint64_t reservedSpace1:5;
      uint64_t PINCFG:2;
      uint64_t OUTCFG:1;
      uint64_t PCSCFG:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGR1;

