iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
};

#define LPSPI_5 (*(volatile struct LPSPI_5_tag *) 0x404c0000)

struct SAI_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEATURE:16;
      uint64_t MINOR:8;
      uint64_t MAJOR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VERID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATALINE:4;
      uint64_t reservedSpace0:4;
      uint64_t FIFO:4;
      uint64_t reservedSpace1:4;
      uint64_t FRAME:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PARAM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRDE:1;
      uint64_t FWDE:1;
      uint64_t reservedSpace0:6;
      uint64_t FRIE:1;
      uint64_t FWIE:1;
      uint64_t FEIE:1;
      uint64_t SEIE:1;
      uint64_t WSIE:1;
      uint64_t reservedSpace1:3;
      uint64_t FRF:1;
      uint64_t FWF:1;
      uint64_t FEF:1;
      uint64_t SEF:1;
      uint64_t WSF:1;
      uint64_t reservedSpace2:3;
      uint64_t SR:1;
      uint64_t FR:1;
      uint64_t reservedSpace3:2;
      uint64_t BCE:1;
      uint64_t DBGE:1;
      uint64_t reservedSpace4:1;
      uint64_t TE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFW:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:15;
      uint64_t BYP:1;
      uint64_t BCD:1;
      uint64_t BCP:1;
      uint64_t MSEL:2;
      uint64_t BCI:1;
      uint64_t reservedSpace1:1;
      uint64_t SYNC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDFL:4;
      uint64_t reservedSpace0:12;
      uint64_t TCE:4;
      uint64_t reservedSpace1:4;
      uint64_t CFR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSD:1;
      uint64_t FSP:1;
      uint64_t ONDEM:1;
      uint64_t FSE:1;
      uint64_t MF:1;
      uint64_t CHMOD:1;
      uint64_t reservedSpace0:2;
      uint64_t SYWD:5;
      uint64_t reservedSpace1:3;
      uint64_t FRSZ:4;
      uint64_t reservedSpace2:4;
      uint64_t FPACK:2;
      uint64_t FCOMB:2;
      uint64_t FCONT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t FBT:5;
      uint64_t reservedSpace1:3;
      uint64_t W0W:5;
      uint64_t reservedSpace2:3;
      uint64_t WNW:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TDR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TDR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TDR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TDR_3;

  uint8_t res0[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFP:4;
      uint64_t reservedSpace0:12;
      uint64_t WFP:4;
      uint64_t reservedSpace1:11;
      uint64_t WCP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFP:4;
      uint64_t reservedSpace0:12;
      uint64_t WFP:4;
      uint64_t reservedSpace1:11;
      uint64_t WCP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFP:4;
      uint64_t reservedSpace0:12;
      uint64_t WFP:4;
      uint64_t reservedSpace1:11;
      uint64_t WCP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFP:4;
      uint64_t reservedSpace0:12;
      uint64_t WFP:4;
      uint64_t reservedSpace1:11;
      uint64_t WCP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFR_3;

  uint8_t res1[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TWM:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMR;

  uint8_t res2[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRDE:1;
      uint64_t FWDE:1;
      uint64_t reservedSpace0:6;
      uint64_t FRIE:1;
      uint64_t FWIE:1;
      uint64_t FEIE:1;
      uint64_t SEIE:1;
      uint64_t WSIE:1;
      uint64_t reservedSpace1:3;
      uint64_t FRF:1;
      uint64_t FWF:1;
      uint64_t FEF:1;
      uint64_t SEF:1;
      uint64_t WSF:1;
      uint64_t reservedSpace2:3;
      uint64_t SR:1;
      uint64_t FR:1;
      uint64_t reservedSpace3:2;
      uint64_t BCE:1;
      uint64_t DBGE:1;
      uint64_t reservedSpace4:1;
      uint64_t RE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFW:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:15;
      uint64_t BYP:1;
      uint64_t BCD:1;
      uint64_t BCP:1;
      uint64_t MSEL:2;
      uint64_t BCI:1;
      uint64_t reservedSpace1:1;
      uint64_t SYNC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDFL:4;
      uint64_t reservedSpace0:12;
      uint64_t RCE:4;
      uint64_t reservedSpace1:4;
      uint64_t CFR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSD:1;
      uint64_t FSP:1;
      uint64_t ONDEM:1;
      uint64_t FSE:1;
      uint64_t MF:1;
      uint64_t reservedSpace0:3;
      uint64_t SYWD:5;
      uint64_t reservedSpace1:3;
      uint64_t FRSZ:4;
      uint64_t reservedSpace2:4;
      uint64_t FPACK:2;
      uint64_t FCOMB:2;
      uint64_t FCONT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t FBT:5;
      uint64_t reservedSpace1:3;
      uint64_t W0W:5;
      uint64_t reservedSpace2:3;
      uint64_t WNW:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RDR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RDR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RDR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RDR_3;

  uint8_t res3[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFP:4;
      uint64_t reservedSpace0:11;
      uint64_t RCP:1;
      uint64_t WFP:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFP:4;
      uint64_t reservedSpace0:11;
      uint64_t RCP:1;
      uint64_t WFP:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFP:4;
      uint64_t reservedSpace0:11;
      uint64_t RCP:1;
      uint64_t WFP:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFP:4;
      uint64_t reservedSpace0:11;
      uint64_t RCP:1;
      uint64_t WFP:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFR_3;

  uint8_t res4[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RWM:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RMR;

