iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
};

#define LPCMP_1 (*(volatile struct LPCMP_1_tag *) 0x40374000)

struct LPCMP_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEATURE:16;
      uint64_t MINOR:8;
      uint64_t MAJOR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VERID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAC_RES:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PARAM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP_EN:1;
      uint64_t CMP_STOP_EN:1;
      uint64_t LINKEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WINDOW_EN:1;
      uint64_t SAMPLE_EN:1;
      uint64_t DMA_EN:1;
      uint64_t COUT_INV:1;
      uint64_t COUT_SEL:1;
      uint64_t COUT_PEN:1;
      uint64_t COUTA_OWEN:1;
      uint64_t COUTA_OW:1;
      uint64_t WINDOW_INV:1;
      uint64_t WINDOW_CLS:1;
      uint64_t EVT_SEL:2;
      uint64_t reservedSpace0:4;
      uint64_t FILT_CNT:3;
      uint64_t reservedSpace1:5;
      uint64_t FILT_PER:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP_HPMD:1;
      uint64_t reservedSpace0:1;
      uint64_t OFFSET:1;
      uint64_t reservedSpace1:1;
      uint64_t HYSTCTR:2;
      uint64_t reservedSpace2:10;
      uint64_t PSEL:3;
      uint64_t reservedSpace3:1;
      uint64_t MSEL:3;
      uint64_t reservedSpace4:1;
      uint64_t INPSEL:2;
      uint64_t reservedSpace5:2;
      uint64_t INMSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR2;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAC_EN:1;
      uint64_t reservedSpace0:7;
      uint64_t VRSEL:1;
      uint64_t reservedSpace1:7;
      uint64_t DAC_DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFR_IE:1;
      uint64_t CFF_IE:1;
      uint64_t RRF_IE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFR:1;
      uint64_t CFF:1;
      uint64_t RRF:1;
      uint64_t reservedSpace0:5;
      uint64_t COUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RR_EN:1;
      uint64_t reservedSpace0:7;
      uint64_t RR_NSAM:2;
      uint64_t reservedSpace1:6;
      uint64_t RR_INITMOD:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RRCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RR_CH0EN:1;
      uint64_t RR_CH1EN:1;
      uint64_t RR_CH2EN:1;
      uint64_t RR_CH3EN:1;
      uint64_t RR_CH4EN:1;
      uint64_t RR_CH5EN:1;
      uint64_t RR_CH6EN:1;
      uint64_t RR_CH7EN:1;
      uint64_t reservedSpace0:8;
      uint64_t FIXP:1;
      uint64_t reservedSpace1:3;
      uint64_t FIXCH:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RRCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RR_CH0OUT:1;
      uint64_t RR_CH1OUT:1;
      uint64_t RR_CH2OUT:1;
      uint64_t RR_CH3OUT:1;
      uint64_t RR_CH4OUT:1;
      uint64_t RR_CH5OUT:1;
      uint64_t RR_CH6OUT:1;
      uint64_t RR_CH7OUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RRCSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RR_CH0F:1;
      uint64_t RR_CH1F:1;
      uint64_t RR_CH2F:1;
      uint64_t RR_CH3F:1;
      uint64_t RR_CH4F:1;
      uint64_t RR_CH5F:1;
      uint64_t RR_CH6F:1;
      uint64_t RR_CH7F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RRSR;

};

#define LPCMP_2 (*(volatile struct LPCMP_2_tag *) 0x404e8000)

struct TEMPSENSE_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ETS_EN:1;
      uint64_t GNDSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETSCTL;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCA0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCA1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCA2:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCA2;

};

#define TEMPSENSE (*(volatile struct TEMPSENSE_tag *) 0x4037c000)

struct CRC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL:8;
      uint64_t LU:8;
      uint64_t HL:8;
      uint64_t HU:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOW:16;
      uint64_t HIGH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPOLY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t TCRC:1;
      uint64_t WAS:1;
      uint64_t FXOR:1;
      uint64_t reservedSpace1:1;
      uint64_t TOTR:2;
      uint64_t TOT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

};

#define CRC (*(volatile struct CRC_tag *) 0x40380000)

struct FCCU_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPR:5;
      uint64_t reservedSpace0:1;
      uint64_t OPS:2;
      uint64_t reservedSpace1:1;
      uint64_t DEBUG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTRLK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRLK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:6;
      uint64_t FOM:3;
      uint64_t PS:1;
      uint64_t reservedSpace1:1;
      uint64_t CM:1;
      uint64_t reservedSpace2:10;
      uint64_t FCCU_SET_CLEAR:2;
      uint64_t FCCU_SET_AFTER_RESET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  uint8_t res0[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NCFC0:1;
      uint64_t NCFC1:1;
      uint64_t NCFC2:1;
      uint64_t NCFC3:1;
      uint64_t NCFC4:1;
      uint64_t NCFC5:1;
      uint64_t NCFC6:1;
      uint64_t NCFC7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NCF_CFG0;

  uint8_t res1[44];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NCFSC0:2;
      uint64_t NCFSC1:2;
      uint64_t NCFSC2:2;
      uint64_t NCFSC3:2;
      uint64_t NCFSC4:2;
      uint64_t NCFSC5:2;
      uint64_t NCFSC6:2;
      uint64_t NCFSC7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NCFS_CFG0;

