iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
  uint8_t res2[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NCFS0:1;
      uint64_t NCFS1:1;
      uint64_t NCFS2:1;
      uint64_t NCFS3:1;
      uint64_t NCFS4:1;
      uint64_t NCFS5:1;
      uint64_t NCFS6:1;
      uint64_t NCFS7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NCF_S0;

  uint8_t res3[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NCFK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NCFK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NCFE0:1;
      uint64_t NCFE1:1;
      uint64_t NCFE2:1;
      uint64_t NCFE3:1;
      uint64_t NCFE4:1;
      uint64_t NCFE5:1;
      uint64_t NCFE6:1;
      uint64_t NCFE7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NCF_E0;

  uint8_t res4[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NCFTOE0:1;
      uint64_t NCFTOE1:1;
      uint64_t NCFTOE2:1;
      uint64_t NCFTOE3:1;
      uint64_t NCFTOE4:1;
      uint64_t NCFTOE5:1;
      uint64_t NCFTOE6:1;
      uint64_t NCFTOE7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NCF_TOE0;

  uint8_t res5[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NCF_TO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TO:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_TO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EOUT0:1;
      uint64_t EOUT1:1;
      uint64_t reservedSpace0:2;
      uint64_t EIN0:1;
      uint64_t EIN1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EINOUT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATUS:3;
      uint64_t ESTAT:1;
      uint64_t PhysicErrorPin:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NAFS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) N2AF_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AFFS:8;
      uint64_t AF_SRC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) A2FF_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NFFS:8;
      uint64_t NF_SRC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) N2FF_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FAFS:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F2AF_STATUS;

  uint8_t res6[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FNCFC:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NCFF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFG_TO_STAT:1;
      uint64_t ALRM_STAT:1;
      uint64_t NMI_STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFG_TO_IEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ_EN;

  uint8_t res7[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRANSKEY:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRANS_LOCK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERMNTKEY:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERMNT_LOCK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DELTA_T:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DELTA_T;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRQEN0:1;
      uint64_t IRQEN1:1;
      uint64_t IRQEN2:1;
      uint64_t IRQEN3:1;
      uint64_t IRQEN4:1;
      uint64_t IRQEN5:1;
      uint64_t IRQEN6:1;
      uint64_t IRQEN7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ_ALARM_EN0;

  uint8_t res8[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NMIEN0:1;
      uint64_t NMIEN1:1;
      uint64_t NMIEN2:1;
      uint64_t NMIEN3:1;
      uint64_t NMIEN4:1;
      uint64_t NMIEN5:1;
      uint64_t NMIEN6:1;
      uint64_t NMIEN7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NMI_EN0;

  uint8_t res9[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EOUTEN0:1;
      uint64_t EOUTEN1:1;
      uint64_t EOUTEN2:1;
      uint64_t EOUTEN3:1;
      uint64_t EOUTEN4:1;
      uint64_t EOUTEN5:1;
      uint64_t EOUTEN6:1;
      uint64_t EOUTEN7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EOUT_SIG_EN0;

  uint8_t res10[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMR_ALARM;

  uint8_t res11[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMR_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMR_ETMR;

};

#define FCCU (*(volatile struct FCCU_tag *) 0x40384000)

struct MU_0__MUB_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEATURE:16;
      uint64_t MINOR:8;
      uint64_t MAJOR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TR_NUM:8;
      uint64_t RR_NUM:8;
      uint64_t GIR_NUM:8;
      uint64_t FLAG_WIDTH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MUR:1;
      uint64_t MURIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MURS:1;
      uint64_t MURIP:1;
      uint64_t EP:1;
      uint64_t FUP:1;
      uint64_t GIRP:1;
      uint64_t TEP:1;
      uint64_t RFP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NMI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR0;

