iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NMIC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSSR0;

  uint8_t res1[228];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F0:1;
      uint64_t F1:1;
      uint64_t F2:1;
      uint64_t F3:1;
      uint64_t F4:1;
      uint64_t F5:1;
      uint64_t F6:1;
      uint64_t F7:1;
      uint64_t F8:1;
      uint64_t F9:1;
      uint64_t F10:1;
      uint64_t F11:1;
      uint64_t F12:1;
      uint64_t F13:1;
      uint64_t F14:1;
      uint64_t F15:1;
      uint64_t F16:1;
      uint64_t F17:1;
      uint64_t F18:1;
      uint64_t F19:1;
      uint64_t F20:1;
      uint64_t F21:1;
      uint64_t F22:1;
      uint64_t F23:1;
      uint64_t F24:1;
      uint64_t F25:1;
      uint64_t F26:1;
      uint64_t F27:1;
      uint64_t F28:1;
      uint64_t F29:1;
      uint64_t F30:1;
      uint64_t F31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F0:1;
      uint64_t F1:1;
      uint64_t F2:1;
      uint64_t F3:1;
      uint64_t F4:1;
      uint64_t F5:1;
      uint64_t F6:1;
      uint64_t F7:1;
      uint64_t F8:1;
      uint64_t F9:1;
      uint64_t F10:1;
      uint64_t F11:1;
      uint64_t F12:1;
      uint64_t F13:1;
      uint64_t F14:1;
      uint64_t F15:1;
      uint64_t F16:1;
      uint64_t F17:1;
      uint64_t F18:1;
      uint64_t F19:1;
      uint64_t F20:1;
      uint64_t F21:1;
      uint64_t F22:1;
      uint64_t F23:1;
      uint64_t F24:1;
      uint64_t F25:1;
      uint64_t F26:1;
      uint64_t F27:1;
      uint64_t F28:1;
      uint64_t F29:1;
      uint64_t F30:1;
      uint64_t F31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSR;

  uint8_t res2[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIE0:1;
      uint64_t GIE1:1;
      uint64_t GIE2:1;
      uint64_t GIE3:1;
      uint64_t GIE4:1;
      uint64_t GIE5:1;
      uint64_t GIE6:1;
      uint64_t GIE7:1;
      uint64_t GIE8:1;
      uint64_t GIE9:1;
      uint64_t GIE10:1;
      uint64_t GIE11:1;
      uint64_t GIE12:1;
      uint64_t GIE13:1;
      uint64_t GIE14:1;
      uint64_t GIE15:1;
      uint64_t GIE16:1;
      uint64_t GIE17:1;
      uint64_t GIE18:1;
      uint64_t GIE19:1;
      uint64_t GIE20:1;
      uint64_t GIE21:1;
      uint64_t GIE22:1;
      uint64_t GIE23:1;
      uint64_t GIE24:1;
      uint64_t GIE25:1;
      uint64_t GIE26:1;
      uint64_t GIE27:1;
      uint64_t GIE28:1;
      uint64_t GIE29:1;
      uint64_t GIE30:1;
      uint64_t GIE31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIR0:1;
      uint64_t GIR1:1;
      uint64_t GIR2:1;
      uint64_t GIR3:1;
      uint64_t GIR4:1;
      uint64_t GIR5:1;
      uint64_t GIR6:1;
      uint64_t GIR7:1;
      uint64_t GIR8:1;
      uint64_t GIR9:1;
      uint64_t GIR10:1;
      uint64_t GIR11:1;
      uint64_t GIR12:1;
      uint64_t GIR13:1;
      uint64_t GIR14:1;
      uint64_t GIR15:1;
      uint64_t GIR16:1;
      uint64_t GIR17:1;
      uint64_t GIR18:1;
      uint64_t GIR19:1;
      uint64_t GIR20:1;
      uint64_t GIR21:1;
      uint64_t GIR22:1;
      uint64_t GIR23:1;
      uint64_t GIR24:1;
      uint64_t GIR25:1;
      uint64_t GIR26:1;
      uint64_t GIR27:1;
      uint64_t GIR28:1;
      uint64_t GIR29:1;
      uint64_t GIR30:1;
      uint64_t GIR31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIP0:1;
      uint64_t GIP1:1;
      uint64_t GIP2:1;
      uint64_t GIP3:1;
      uint64_t GIP4:1;
      uint64_t GIP5:1;
      uint64_t GIP6:1;
      uint64_t GIP7:1;
      uint64_t GIP8:1;
      uint64_t GIP9:1;
      uint64_t GIP10:1;
      uint64_t GIP11:1;
      uint64_t GIP12:1;
      uint64_t GIP13:1;
      uint64_t GIP14:1;
      uint64_t GIP15:1;
      uint64_t GIP16:1;
      uint64_t GIP17:1;
      uint64_t GIP18:1;
      uint64_t GIP19:1;
      uint64_t GIP20:1;
      uint64_t GIP21:1;
      uint64_t GIP22:1;
      uint64_t GIP23:1;
      uint64_t GIP24:1;
      uint64_t GIP25:1;
      uint64_t GIP26:1;
      uint64_t GIP27:1;
      uint64_t GIP28:1;
      uint64_t GIP29:1;
      uint64_t GIP30:1;
      uint64_t GIP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GSR;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIE0:1;
      uint64_t TIE1:1;
      uint64_t TIE2:1;
      uint64_t TIE3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TE0:1;
      uint64_t TE1:1;
      uint64_t TE2:1;
      uint64_t TE3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RIE0:1;
      uint64_t RIE1:1;
      uint64_t RIE2:1;
      uint64_t RIE3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RF0:1;
      uint64_t RF1:1;
      uint64_t RF2:1;
      uint64_t RF3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSR;

  uint8_t res4[208];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TR_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TR_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TR_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TR_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TR_3;

  uint8_t res5[112];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RR_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RR_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RR_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RR_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RR_3;

