iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
};

#define STCU (*(volatile struct STCU_tag *) 0x403a0004)

struct SELFTEST_GPR_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t PCS_STEP_SIZE:3;
      uint64_t PCS_ENABLE_START:1;
      uint64_t PCS_ENABLE_END:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG_REG;

  uint8_t res0[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LBIST_SHIFT_COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LBIST_PROG_REG;

};

#define SELFTEST_GPR (*(volatile struct SELFTEST_GPR_tag *) 0x403b0000)

struct QUADSPI_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWRSTSD:1;
      uint64_t SWRSTHD:1;
      uint64_t reservedSpace0:8;
      uint64_t CLR_RXF:1;
      uint64_t CLR_TXF:1;
      uint64_t reservedSpace1:2;
      uint64_t MDIS:1;
      uint64_t reservedSpace2:9;
      uint64_t DQS_FA_SEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDATSZ:16;
      uint64_t reservedSpace0:8;
      uint64_t SEQID:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IPCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCSS:4;
      uint64_t reservedSpace0:4;
      uint64_t TCSH:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLSHCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTRID:4;
      uint64_t reservedSpace0:4;
      uint64_t ADATSZ:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUF0CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTRID:4;
      uint64_t reservedSpace0:4;
      uint64_t ADATSZ:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUF1CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTRID:4;
      uint64_t reservedSpace0:4;
      uint64_t ADATSZ:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUF2CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTRID:4;
      uint64_t reservedSpace0:4;
      uint64_t ADATSZ:6;
      uint64_t reservedSpace1:17;
      uint64_t ALLMST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUF3CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:12;
      uint64_t SEQID:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BFGENCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SOCCFG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SOCCR;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t TPINDX0:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUF0IND;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t TPINDX1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUF1IND;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t TPINDX2:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUF2IND;

  uint8_t res2[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLV_UPD:1;
      uint64_t SLV_DLL_BYPASS:1;
      uint64_t SLV_EN:1;
      uint64_t reservedSpace0:5;
      uint64_t SLV_DLY_COARSE:4;
      uint64_t SLV_DLY_OFFSET:3;
      uint64_t reservedSpace1:1;
      uint64_t SLV_FINE_OFFSET:4;
      uint64_t reservedSpace2:10;
      uint64_t FREQEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DLLCRA;

  uint8_t res3[156];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SFADR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFAR;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t FSPHS:1;
      uint64_t FSDLY:1;
      uint64_t reservedSpace1:17;
      uint64_t DLLFSMPFA:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDBFL:8;
      uint64_t reservedSpace0:8;
      uint64_t RDCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WMRK:7;
      uint64_t reservedSpace0:1;
      uint64_t RXBRD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBCT;

  uint8_t res5[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NEG_EDGE:8;
      uint64_t POS_EDGE:8;
      uint64_t reservedSpace0:15;
      uint64_t DLPFFA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DLSR_FA;

  uint8_t res6[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRBFL:6;
      uint64_t reservedSpace0:10;
      uint64_t TRCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TBSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TBDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WMRK:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TBCT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUSY:1;
      uint64_t IP_ACC:1;
      uint64_t AHB_ACC:1;
      uint64_t reservedSpace0:3;
      uint64_t AHBTRN:1;
      uint64_t AHB0NE:1;
      uint64_t AHB1NE:1;
      uint64_t AHB2NE:1;
      uint64_t AHB3NE:1;
      uint64_t AHB0FUL:1;
      uint64_t AHB1FUL:1;
      uint64_t AHB2FUL:1;
      uint64_t AHB3FUL:1;
      uint64_t reservedSpace1:1;
      uint64_t RXWE:1;
      uint64_t reservedSpace2:2;
      uint64_t RXFULL:1;
      uint64_t reservedSpace3:3;
      uint64_t RXDMA:1;
      uint64_t TXNE:1;
      uint64_t TXWA:1;
      uint64_t TXDMA:1;
      uint64_t TXFULL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFF:1;
      uint64_t reservedSpace0:5;
      uint64_t IPIEF:1;
      uint64_t IPAEF:1;
      uint64_t reservedSpace1:4;
      uint64_t ABOF:1;
      uint64_t AIBSEF:1;
      uint64_t AITEF:1;
      uint64_t reservedSpace2:1;
      uint64_t RBDF:1;
      uint64_t RBOF:1;
      uint64_t reservedSpace3:5;
      uint64_t ILLINE:1;
      uint64_t reservedSpace4:2;
      uint64_t TBUF:1;
      uint64_t TBFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFIE:1;
      uint64_t reservedSpace0:5;
      uint64_t IPIEIE:1;
      uint64_t IPAEIE:1;
      uint64_t reservedSpace1:4;
      uint64_t ABOIE:1;
      uint64_t AIBSIE:1;
      uint64_t AITIE:1;
      uint64_t reservedSpace2:1;
      uint64_t RBDIE:1;
      uint64_t RBOIE:1;
      uint64_t reservedSpace3:3;
      uint64_t RBDDE:1;
      uint64_t reservedSpace4:1;
      uint64_t ILLINIE:1;
      uint64_t reservedSpace5:1;
      uint64_t TBFDE:1;
      uint64_t TBUIE:1;
      uint64_t TBFIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSER;

