iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
  uint8_t res7[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BFPTRC:1;
      uint64_t reservedSpace0:7;
      uint64_t IPPTRC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPTRCLR;

  uint8_t res8[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:10;
      uint64_t TPADA1:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFA1AD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:10;
      uint64_t TPADA2:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFA2AD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:10;
      uint64_t TPADB1:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFB1AD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:10;
      uint64_t TPADB2:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFB2AD;

  uint8_t res9[112];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_32;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_33;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_35;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_36;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_37;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_38;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_39;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_40;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_41;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_42;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_43;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_44;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_45;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_46;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_47;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_48;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_49;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_50;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_51;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_52;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_53;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_54;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_55;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_56;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_57;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_58;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_59;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_60;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_61;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_62;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_63;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUTKEY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCK:1;
      uint64_t UNLOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCKCR;

  uint8_t res10[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT19;

