iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K344_RAM_GCC/emptyTargetInit/S32K344_sfr.h
};

#define QUADSPI (*(volatile struct QUADSPI_tag *) 0x404cc000)

struct SAI_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEATURE:16;
      uint64_t MINOR:8;
      uint64_t MAJOR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VERID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATALINE:4;
      uint64_t reservedSpace0:4;
      uint64_t FIFO:4;
      uint64_t reservedSpace1:4;
      uint64_t FRAME:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PARAM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRDE:1;
      uint64_t FWDE:1;
      uint64_t reservedSpace0:6;
      uint64_t FRIE:1;
      uint64_t FWIE:1;
      uint64_t FEIE:1;
      uint64_t SEIE:1;
      uint64_t WSIE:1;
      uint64_t reservedSpace1:3;
      uint64_t FRF:1;
      uint64_t FWF:1;
      uint64_t FEF:1;
      uint64_t SEF:1;
      uint64_t WSF:1;
      uint64_t reservedSpace2:3;
      uint64_t SR:1;
      uint64_t FR:1;
      uint64_t reservedSpace3:2;
      uint64_t BCE:1;
      uint64_t DBGE:1;
      uint64_t reservedSpace4:1;
      uint64_t TE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFW:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:15;
      uint64_t BYP:1;
      uint64_t BCD:1;
      uint64_t BCP:1;
      uint64_t MSEL:2;
      uint64_t BCI:1;
      uint64_t reservedSpace1:1;
      uint64_t SYNC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDFL:4;
      uint64_t reservedSpace0:12;
      uint64_t TCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSD:1;
      uint64_t FSP:1;
      uint64_t ONDEM:1;
      uint64_t FSE:1;
      uint64_t MF:1;
      uint64_t CHMOD:1;
      uint64_t reservedSpace0:2;
      uint64_t SYWD:5;
      uint64_t reservedSpace1:3;
      uint64_t FRSZ:4;
      uint64_t reservedSpace2:4;
      uint64_t FPACK:2;
      uint64_t reservedSpace3:2;
      uint64_t FCONT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t FBT:5;
      uint64_t reservedSpace1:3;
      uint64_t W0W:5;
      uint64_t reservedSpace2:3;
      uint64_t WNW:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TDR0;

  uint8_t res0[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFP:4;
      uint64_t reservedSpace0:12;
      uint64_t WFP:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFR0;

  uint8_t res1[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TWM:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMR;

  uint8_t res2[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRDE:1;
      uint64_t FWDE:1;
      uint64_t reservedSpace0:6;
      uint64_t FRIE:1;
      uint64_t FWIE:1;
      uint64_t FEIE:1;
      uint64_t SEIE:1;
      uint64_t WSIE:1;
      uint64_t reservedSpace1:3;
      uint64_t FRF:1;
      uint64_t FWF:1;
      uint64_t FEF:1;
      uint64_t SEF:1;
      uint64_t WSF:1;
      uint64_t reservedSpace2:3;
      uint64_t SR:1;
      uint64_t FR:1;
      uint64_t reservedSpace3:2;
      uint64_t BCE:1;
      uint64_t DBGE:1;
      uint64_t reservedSpace4:1;
      uint64_t RE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFW:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:15;
      uint64_t BYP:1;
      uint64_t BCD:1;
      uint64_t BCP:1;
      uint64_t MSEL:2;
      uint64_t BCI:1;
      uint64_t reservedSpace1:1;
      uint64_t SYNC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDFL:4;
      uint64_t reservedSpace0:12;
      uint64_t RCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSD:1;
      uint64_t FSP:1;
      uint64_t ONDEM:1;
      uint64_t FSE:1;
      uint64_t MF:1;
      uint64_t reservedSpace0:3;
      uint64_t SYWD:5;
      uint64_t reservedSpace1:3;
      uint64_t FRSZ:4;
      uint64_t reservedSpace2:4;
      uint64_t FPACK:2;
      uint64_t reservedSpace3:2;
      uint64_t FCONT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t FBT:5;
      uint64_t reservedSpace1:3;
      uint64_t W0W:5;
      uint64_t reservedSpace2:3;
      uint64_t WNW:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RDR0;

  uint8_t res3[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFP:4;
      uint64_t reservedSpace0:12;
      uint64_t WFP:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFR0;

  uint8_t res4[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RWM:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RMR;

};

#define SAI_1 (*(volatile struct SAI_1_tag *) 0x404dc000)

struct QUADSPI_ARDB_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_32;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_33;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_35;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_36;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_37;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_38;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_39;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_40;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_41;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_42;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_43;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_44;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_45;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_46;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_47;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_48;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_49;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_50;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_51;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_52;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_53;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_54;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_55;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_56;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_57;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_58;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_59;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_60;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_61;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_62;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_63;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_64;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_65;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_66;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_67;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_68;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_69;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_70;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_71;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_72;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_73;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_74;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_75;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_76;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_77;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_78;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_79;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_80;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_81;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_82;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_83;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_84;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_85;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_86;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_87;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_88;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_89;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_90;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_91;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_92;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_93;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_94;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_95;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_96;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_97;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_98;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_99;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_100;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_101;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_102;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_103;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_104;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_105;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_106;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_107;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_108;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_109;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_110;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_111;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_112;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_113;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_114;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_115;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_116;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_117;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_118;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_119;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_120;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_121;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_122;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_123;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_124;

